{
    "genres": [
      {
          "genre": "Action",
          "image": "/static/genresPics/1000000001.jpg",
          "link": "action",
          "history": ["This major genre type includes films that have tremendous impact, continuous high energy, lots of physical stunts and activity, possibly extended chase scenes, races, rescues, battles, martial arts, mountains and mountaineering, destructive disasters (floods, explosions, natural disasters, fires, etc.), fights, escapes, non-stop motion, spectacular rhythm and pacing, and adventurous heroes - all designed for pure audience escapism with the action sequences at the core of the film.","Action films and adventure films have tremendous cross-over potential as film genres, and road films often overlap with action films. (See the adventure film genre listings for examples of these action/adventure pictures.) Both types of films come in a variety of forms or genre-hybrids: sci-fi or space, thrillers, crime-drama, war, horror, westerns, etc. Oftentimes, action films are great box-office hits, but lack critical appeal because of their two-dimensional heroes or villains.","The main action centers around a male action hero or protagonist - portrayed by these most prominent actors: Bruce Lee, Steven Seagal, Sylvester Stallone, Harrison Ford, Bruce Willis, Chuck Norris, Arnold Schwarzenegger, Douglas Fairbanks Sr., Bruce Lee, Charles Bronson, Steve McQueen, Jean-Paul Belmondo, Chuck Norris, and Jean Claude Van Damme. Women in action-films usually play the roles of accomplices or romantic interests of the hero, although modern action films have featured strong female characters to broaden demographic appeal.","They almost always have a resourceful hero(ine) struggling against incredible odds, life-threatening circumstances, or an evil villain, and/or trapped or chasing each other in various modes of transportation (bus, auto, ship, train, plane, horseback, on foot, etc.), with victory or resolution attained by the end after strenuous physical feats and violence (fist fights, gunplay). Action films have traditionally been aimed at male audiences, ages 13 to the mid-30s in both American and world-wide markets."]
      },
      {
        "genre": "Comedy",
        "image": "/static/genresPics/1000000002.jpg",
        "link": "comedy",
        "history": ["Comedy Films are 'make 'em laugh' films designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment. The comedy genre humorously exaggerates the situation, the language, action, and characters. Comedies observe the deficiencies, foibles, and frustrations of life, providing merriment and a momentary escape from day-to-day life. They usually have happy endings, although the humor may have a serious or pessimistic side.","Comedies usually come in two general formats: comedian-led (with well-timed gags, jokes, or sketches) and situation-comedies that are told within a narrative. Both comedy elements may appear together and/or overlap. Comedy hybrids commonly exist with other major genres, such as musical-comedy, horror-comedy, and comedy-thriller. Comedies have also been classified in various subgenres, such as romantic comedy, crime/caper comedy, sports comedy, teen or coming-of-age comedy, social-class comedy, military comedy, fish-out-of-water comedy, and gross-out comedy."]
      },
      {
        "genre": "Crime",
        "image": "/static/genresPics/1000000003.jpg",
        "link": "crime",
        "history":  ["Crime and Gangster Films are developed around the sinister actions of criminals or gangsters, particularly bankrobbers, underworld figures, or ruthless hoodlums who operate outside the law, stealing and violently murdering their way through life. In the 1940s, a new type of crime thriller emerged, more dark and cynical - see the section on film-noir for further examples of crime films. Criminal and gangster films are often categorized as post-war film noir or detective-mystery films - because of underlying similarities between these cinematic forms. Crime films encompass or cross over many levels, and may include at least these different types of films: the gangster film, the detective (or who-dun-it) film, the crime comedy, the suspense-thriller, and the police (procedural) film.","Crime stories in this genre often highlight the life of a crime figure or a crime's victim(s). Or they glorify the rise and fall of a particular criminal(s), gang, bank robber, murderer or lawbreakers in personal power struggles or conflict with law and order figures, an underling or competitive colleague, or a rival gang. Headline-grabbing situations, real-life gangsters, or crime reports have often been used in crime films. Gangster/crime films are usually set in large, crowded cities, to provide a view of the secret world of the criminal: dark nightclubs or streets with lurid neon signs, fast cars, piles of cash, sleazy bars, contraband, seedy living quarters or rooming houses. Exotic locales for crimes often add an element of adventure and wealth. Writers dreamed up appropriate gangland jargon for the tales, such as 'tommy guns' or 'molls.'","Film gangsters are usually materialistic, street-smart, immoral, meglo-maniacal, and self-destructive. Rivalry with other criminals in gangster warfare is often a significant plot characteristic. Crime plots also include questions such as how the criminal will be apprehended by police, private eyes, special agents or lawful authorities, or mysteries such as who stole the valued object. They rise to power with a tough cruel facade while showing an ambitious desire for success and recognition, but underneath they can express sensitivity and gentleness."]
      },
      {
        "genre": "Drama",
        "image": "/static/genresPics/1000000004.jpg",
        "link": "drama",
        "history": ["Drama is a genre of narrative fiction(or semi-fiction) intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular subgenre, such as 'police creme drama', 'political drama', 'legal drama', 'historical period drama', 'domestic drama', or 'comedy drama'. Theses terms tend to indicate a particular setting of subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods.","All forms of cinema or television that involve fictional stories are forms of drama in the broader sense if their storytelling is achieved by means of actors who represent characters. In this broader sense, drama is a mode distinct from novels, short stories, and narrrative poetry or songs. In the modern era before the birth of cinema or television, 'drama' came to be used within the theatre as a generic term to describe a type of play that was neither a comedy nor a tragedy. It is this narrower sense that the film and television industries, along with film studies, adopted. 'Radio drama' has been used in both senses originally transmitted in a live performance, it has also been used to describe the more high-brow and serious end of the dramatic output of radio."]
      },
      {
        "genre": "Historical",
        "image": "/static/genresPics/1000000005.jpg",
        "link": "historical",
        "history": ["Epics-Historical Films often take an historical or imagined event, mythic, legendary, or heroic figure, and add an extravagant setting and lavish costumes, accompanied by grandeur and spectacle and a sweeping musical score. Epics, costume dramas, historical dramas, war film epics, medieval romps, or 'period pictures' are tales that often cover a large expanse of time set against a vast, panoramic backdrop. In an episodic manner, they follow the continuing adventures of the hero(s), who are presented in the context of great historical events of the past.","Epics are historical films that recreate past events. They are expensive and lavish to produce, because they require elaborate and panoramic settings, on-location filming, authentic period costumes, inflated action on a massive scale and large casts of characters. Biopic (biographical) films are often less lavish versions of the epic film.","Epics often rewrite history, suffering from inauthenticity, fictitious recreations, excessive religiosity, hard-to-follow details and characters, romantic dreamworlds, ostentatious vulgarity, political correctness, and leaden scripts."]

      },
      {
        "genre": "Horror",
        "image": "/static/genresPics/1000000006.jpg",
        "link": "horror",
        "history": ["Horror Films are unsettling films designed to frighten and panic, cause dread and alarm, and to invoke our hidden worst fears, often in a terrifying, shocking finale, while captivating and entertaining us at the same time in a cathartic experience. Horror films effectively center on the dark side of life, the forbidden, and strange and alarming events. They deal with our most primal nature and its fears: our nightmares, our vulnerability, our alienation, our revulsions, our terror of the unknown, our fear of death and dismemberment, loss of identity, or fear of sexuality.","Whatever dark, primitive, and revolting traits that simultaneously attract and repel us are featured in the horror genre. Horror films are often combined with science fiction when the menace or monster is related to a corruption of technology, or when Earth is threatened by aliens. The fantasy and supernatural film genres are not synonymous with the horror genre, although thriller films may have some relation when they focus on the revolting and horrible acts of the killer/madman. Horror films are also known as chillers, scary movies, spookfests, and the macabre. See also Scariest Film Moments and Scenes (illustrated) - from many of the Greatest Horror Films ever made, Best Film Death Scenes (illustrated), and Three Great Horror Film Franchises."]

      },
      {
        "genre": "Science Fiction",
        "image": "/static/genresPics/1000000007.jpg",
        "link": "sciencefiction",
        "history": ["Science Fiction Films are usually scientific, visionary, comic-strip-like, and imaginative, and usually visualized through fanciful, imaginative settings, expert film production design, advanced technology gadgets (i.e., robots and spaceships), scientific developments, or by fantastic special effects. Sci-fi films are complete with heroes, distant planets, impossible quests, improbable settings, fantastic places, great dark and shadowy villains, futuristic technology and gizmos, and unknown and inexplicable forces. Many other SF films feature time travels or fantastic journeys, and are set either on Earth, into outer space, or (most often) into the future time. Quite a few examples of science-fiction cinema owe their origins to writers Jules Verne and H.G. Wells.","They often portray the dangerous and sinister nature of knowledge ('there are some things Man is not meant to know') (i.e., the classic Frankenstein (1931), The Island of Lost Souls (1933), and David Cronenberg's The Fly (1986) - an updating of the 1958 version directed by Kurt Neumann and starring Vincent Price), and vital issues about the nature of mankind and our place in the whole scheme of things, including the threatening, existential loss of personal individuality (i.e., Invasion of the Body Snatchers (1956), and The Incredible Shrinking Man (1957)). Plots of space-related conspiracies (Capricorn One (1977)), supercomputers threatening impregnation (Demon Seed (1977)), the results of germ-warfare (The Omega Man (1971)) and laboratory-bred viruses or plagues (28 Days Later (2002)), black-hole exploration (Event Horizon (1997)), and futuristic genetic engineering and cloning (Gattaca (1997) and Michael Bay's The Island (2005)) show the tremendous range that science-fiction can delve into."]

      },
      {
        "genre": "Western",
        "image": "/static/genresPics/1000000008.jpg",
        "link": "western",
        "history": ["Westerns are the major defining genre of the American film industry, a nostalgic eulogy to the early days of the expansive, untamed American frontier (the borderline between civilization and the wilderness). They are one of the oldest, most enduring and flexible genres and one of the most characteristically American genres in their mythic origins.","This indigenous American art form focuses on the frontier West that existed in North America. Westerns are often set on the American frontier during the last part of the 19th century (1865-1900) following the Civil War, in a geographically western (trans-Mississippi) setting with romantic, sweeping frontier landscapes or rugged rural terrain. However, Westerns may extend back to the time of America's colonial period or forward to the mid-20th century, or as far geographically as Mexico. A number of westerns use the Civil War, the Battle of the Alamo (1836) or the Mexican Revolution (1910) as a backdrop."]

      }
    ],
    "act": [
      {
          "id": 1,
          "name": "Brad Pitt",
          "link": "bradpitt",
          "image": "/static/actPics/2000000001.jpg",
          "history": ["Pitt was born in Shawnee, Oklahoma, to William Alvin Pitt, the proprietor of a trucking company, and Jane Etta , a school counsellor. The family soon moved to Springfield, Missouri, where he lived together with his younger siblings, Douglas (born 1966) and Julie Neal (born 1969).Born into a conservative household, he was raised as Southern Baptist but has since stated that he does not \"have a great relationship with religion\" and that he \"oscillate[s] between agnosticism and atheism\". Pitt has described Springfield as \"Mark Twain country, Jesse James country\", having grown up with \"a lot of hills, a lot of lakes\".","Pitt attended Kickapoo High School, where he was a member of the golf, swimming and tennis teams. He participated in the school's Key and Forensics clubs, in school debates, and in musicals. Following his graduation from high school, Pitt enrolled in the University of Missouri in 1982, majoring in journalism with a focus on advertising. As graduation approached, Pitt did not feel ready to settle down. He loved films \"a portal into different worlds for me\" and, since films were not made in Missouri, he decided to go to where they were made. Two weeks short of completing the coursework for a degree, Pitt left the university and moved to Los Angeles, where he took acting lessons and worked odd jobs. He has named his early acting heroes as Gary Oldman, Sean Penn and Mickey Rourke."]
      },
      {
        "id": 12,
        "name": "Cate Blanchett",
        "link": "cateblanchett",
        "image": "/static/actPics/2000000012.jpg",
        "history": ["Blanchett was born on 14 May 1969 in the Melbourne suburb of Ivanhoe. Her Australian mother, June Blanchett (born Gamble), worked as a property developer and teacher, and her American father, Robert DeWitt Blanchett, Jr., a Texas native, was a United States Navy Chief Petty Officer who later worked as an advertising executive. The two met when Blanchett's father's ship broke down in Melbourne. When Blanchett was 10, her father died of a heart attack, leaving her mother to raise the family on her own. Blanchett is the middle of three children, she has an older brother Bob Blanchett (born 1968), and a younger sister Genevieve Blanchett (born 1971). Her ancestry includes English, some Scottish, and remote French roots.","Blanchett has described herself as being \"part extrovert, part wallflower\" during childhood. She had a penchant for dressing in traditionally masculine clothing, and went through goth and punk phases during her teenage years, and shaved her head at one point. She attended primary school in Melbourne at Ivanhoe East Primary School; for her secondary education, she attended Ivanhoe Girls' Grammar School and then Methodist Ladies' College, where she explored her passion for the performing arts. In her late teens and early twenties, she worked at a nursing home in Victoria. She studied economics and fine arts at the University of Melbourne but dropped out after one year to travel overseas. While in Egypt, Blanchett was asked to play an American cheerleader, as an extra in the Egyptian boxing movie, Kaboria; in need of money, she accepted. Upon her return to Australia, she moved to Sydney and enrolled in the National Institute of Dramatic Art (NIDA) to pursue an acting career. She graduated from NIDA in 1992 with a Bachelor of Fine Arts."]
      },
      {
        "id": 8,
        "name": "Daniel Day-Lewis",
        "link": "danieldaylewis",
        "image": "/static/actPics/2000000008.jpg",
        "history": ["Daniel Michael Blake Day-Lewis was born in Kensington, London, the second child of poet Cecil Day-Lewis  and his second wife, actress Jill Balcon. His older sister, Tamasin Day-Lewis (born 1953), is a television chef and food critic. His father, who was born in the Irish town of Ballintubbert, County Laois, was of Protestant Anglo-Irish descent, lived in England from the age of two, and was appointed Poet Laureate of the United Kingdom.[14] His mother was Jewish; her ancestors were immigrants to England in the late 19th century, from Latvia and Poland.His maternal grandfather, Sir Michael Balcon, became the head of Ealing Studios, helping develop the new British film industry.","Two years after Day-Lewis' birth, he moved with his family to Croom's Hill in Greenwich via Port Clarence Middlesbrough. He and his older sister did not see much of their older two half-brothers, who had been teenagers when Day-Lewis' father divorced their mother. Living in Greenwich (he attended Invicta and Sherington Primary Schools), Day-Lewis had to deal with tough South London children. Identified as Jewish and \"posh\", he was often bullied. He mastered the local accent and mannerisms, and credits that as being his first convincing performance. Later in life, he has been known to speak of himself as very much a disorderly character in his younger years, often in trouble for shoplifting and other petty crimes.","In 1968, Day-Lewis' parents, finding his behaviour to be too wild, sent him as a boarder to the independent Sevenoaks School in Kent. At the school, he was introduced to his three most prominent interests: woodworking, acting, and fishing. However, his disdain for the school grew, and after two years at Sevenoaks, he was transferred to another independent school, Bedales in Petersfield, Hampshire. His sister was already a student there, and it had a more relaxed and creative ethos. He made his film debut at the age of 14 in Sunday Bloody Sunday, in which he played a vandal in an uncredited role. He described the experience as \"heaven\" for getting paid to vandalise expensive cars parked outside his local church."]
      },
      {
        "id": 11,
        "name": "Gwyneth Paltrow",
        "link": "gwynethpaltrow",
        "image": "/static/actPics/2000000011.jpg",
        "history": ["Paltrow was born in Los Angeles, the daughter of actress Blythe Danner and film producer-director Bruce Paltrow (1943–2002). She has a younger brother, Jake Paltrow, who is a director and screenwriter. Paltrow's father was Jewish, while her mother is from a Christian background.[8] She was raised celebrating \"both Jewish and Christian holidays.\" Her brother had a traditional Bar Mitzvah when he turned 13. Her father's Ashkenazi Jewish family emigrated from Belarus and Poland, while her mother has Pennsylvania Dutch (German), Irish, and some English ancestry. Paltrow's paternal great-great-grandfather was a rabbi in Nowogród, Poland, and a descendant of the well known \"Paltrowicz\" family of rabbis from Kraków. She is a half-cousin of actress Katherine Moennig, through her mother, and a second cousin of former U.S. Congresswoman Gabrielle Giffords , through her father. Her uncle is opera singer and actor Harry Danner, whose daughter, actress Hillary Danner, is Paltrow's cousin and close friend. Paltrow recalls their family gatherings: \"Hillary and I always had this in common, and do to this day [...] cooking for people we love, eating, hanging out as a family. It's how we were raised. It's what we do.\" Another cousin is Rebekah Paltrow Neumann, whose spouse is the Israeli-American billionaire Adam Neumann, founder of WeWork.","Her godfather is director Steven Spielberg.","Paltrow was raised in Santa Monica, California, where she attended Crossroads School, before enrolling in the Spence School, a private girls' school in New York City. Later, she briefly studied anthropology at the University of California, Santa Barbara, before dropping out to act. She is an \"adopted daughter\" of Talavera de la Reina (Spain), where at 15, she spent a year as an exchange student and learned to speak Spanish. She is also conversant in French."]
      },
      {
        "id": 7,
        "name": "Kirsten Dunst",
        "link": "kirstendunst",
        "image": "/static/actPics/2000000007.jpg",
        "history": ["Dunst was born in Point Pleasant, New Jersey, to Klaus Hermann Dunst and Inez Rupprecht. She has a younger brother, Christian. Her father worked for Siemens as a medical services executive, and her mother worked for Lufthansa as a flight attendant. She was also an artist and one-time gallery owner. Dunst's father is German, originally from Hamburg, and her mother was born in New Jersey, of German and Swedish descent.","Until the age of eleven, Dunst lived in Brick Township, New Jersey, where she attended Ranney School. In 1993, her parents separated, and she subsequently moved with her mother and brother to Los Angeles, where she attended Laurel Hall School in North Hollywood and Notre Dame High School. Among her classmates was Rami Malek, who was a grade above; they were both in a musical theater class. In 1995, her mother filed for divorce.","After graduating from high school in 2000, Dunst continued acting. As a teenager, she found it difficult to deal with her rising fame, and for a period she blamed her mother for pushing her into acting as a child. However, she later said that her mother \"always had the best intentions\". When asked if she had any regrets about her childhood, Dunst said:\"Well, it's not a natural way to grow up, but it's the way I grew up and I wouldn't change it. I have my stuff to work out... I don't think anybody can sit around and say, 'My life is more screwed up than yours.' Everybody has their issues.\""]
      },
      {
        "id": 13,
        "name": "Jim Carrey",
        "link": "jimcarrey",
        "image": "/static/actPics/2000000013.jpg",
        "history": ["While Carrey was struggling to obtain work and make a name for himself, his father tried to help the young comedian put together a stage act, driving him to Toronto to debut at comedy club Yuk Yuk's. Carrey's impersonations bombed and this gave him doubts about his capabilities as a professional entertainer. His family's financial struggles made it difficult for them to support Carrey's ambitions.[citation needed]","Eventually, the family's financial problems were resolved and they moved into a new home. With more domestic stability, Carrey returned to the stage with a more polished act. In a short period of time, he went from open-mic nights to regular paid shows, building his reputation in the process. A reviewer in the Toronto Star raved that Carrey was \"a genuine star coming to life\". Carrey was soon noticed by comedian Rodney Dangerfield, who signed the young comic to open his tour performances. Dangerfield eventually brought Carrey to Las Vegas. However, Carrey soon decided to move to Hollywood, where he began performing at The Comedy Store and, in 1982, appeared on the televised stand-up show An Evening at the Improv. The following year, he debuted his act on The Tonight Show.","Despite his increasing popularity as a stand-up comic, Carrey turned his attention to the film and television industries, auditioning to be a cast member for the 1980–81 season of NBC's Saturday Night Live. Carrey was not selected for the position, although he later hosted the show in May 1996, January 2011, and October 2014.[16][17] In 1984, Carrey was in the short-lived sitcom The Duck Factory."]
      },
      {
        "id": 10,
        "name": "Jessica Alba",
        "link": "jessicaalba",
        "image": "/static/actPics/2000000010.jpg",
        "history": ["Alba was born in Pomona, California, to Catherine Louisa (née Jensen) and Mark David Alba. Her mother has Danish, Welsh, German, English, and French ancestry, while her paternal grandparents, who were born in California, were both the children of Mexican immigrants. She has a younger brother, Joshua. Her third cousin, once removed, is writer Gustavo Arellano. Her father's Air Force career took the family to Biloxi, Mississippi, and Del Rio, Texas, before settling back in Claremont, California, when she was nine years old. Alba has described her family as being a \"very conservative family – a traditional, Catholic, Latin American family\" and herself as very liberal; she says she had identified herself as a \"feminist\" as early as age five.","Alba's early life was marked by a multitude of physical maladies. During childhood, she suffered from partially collapsed lungs twice, had pneumonia four to five times a year, as well as a ruptured appendix and a tonsillar cyst. She has also had asthma since she was a child. Alba became isolated from other children at school, because she was in the hospital so often due to her illnesses that no one knew her well enough to befriend her. She has said that her family's frequent moving also contributed to her isolation from her peers. Alba graduated from Claremont High School at age 16, and she subsequently attended the Atlantic Theater Company."]
      },
      {
        "id": 5,
        "name": "Leonardo DiCaprio",
        "link": "leonardodicaprio",
        "image": "/static/actPics/2000000005.jpg",
        "history": ["Leonardo Wilhelm DiCaprio was born on November 11, 1974, in Los Angeles. He is the only child of Irmelin (née Indenbirken), a legal secretary, and George DiCaprio, an underground comix artist and producer and distributor of comic books. DiCaprio's father is of Italian (from Alife) and German (from Bavaria) descent. DiCaprio's maternal grandfather, Wilhelm Indenbirken, was German.  His maternal grandmother, Helene Indenbirken (born Yelena Smirnova; 1915–2008), was a Russian-born German citizen. In an interview in Russia, DiCaprio referred to himself as \"half-Russian\" and said that two of his grandparents were Russian. DiCaprio's parents met while attending college and subsequently moved to Los Angeles, California.","DiCaprio was named Leonardo because his pregnant mother was looking at a Leonardo da Vinci painting in the Uffizi museum in Florence, Italy, when he first kicked. His parents separated when he was a year old, and he lived mostly with his mother. The two lived in several Los Angeles neighborhoods, such as Echo Park and Los Feliz (his Los Feliz residence was later converted into a public library), while his mother worked several jobs. DiCaprio attended Seeds Elementary School (now UCLA Lab School) and John Marshall High School a few blocks away, after attending the Los Angeles Center for Enriched Studies for four years. He dropped out of high school following his third year, eventually earning his general equivalency diploma (GED). DiCaprio spent part of his childhood in Germany with his maternal grandparents, Wilhelm and Helene. He is conversant in German and Italian."]
      },
      {
        "id": 3,
        "name": "Matt Damon",
        "link": "mattdamon",
        "image": "/static/actPics/2000000003.jpg",
        "history": ["Damon was born in Cambridge, Massachusetts, the second son of stockbroker Kent Telfer Damon and Nancy Carlsson-Paige, an early childhood education professor at Lesley University. His father had English and Scottish ancestry, and his mother is of five-eighths Finnish and three-eighths Swedish descent (his mother's family surname had been changed from the Finnish \"Pajari\" to \"Paige\"). Damon and his family moved to Newton for two years. His parents divorced when he was two years old, and Damon and his brother returned with their mother to Cambridge, where they lived in a six-family communal house. His brother Kyle is now an accomplished sculptor and artist.","As a lonely teenager, Damon has said that he felt that he did not belong. Due to his mother's \"by the book\" approach to child-rearing, he had a hard time defining a self identity. He attended Cambridge Alternative School (now Graham and Parks) and then Cambridge Rindge and Latin School, where he was a good student. Damon performed as an actor in several high school theater productions.He credited his drama teacher, Gerry Speca, as an important artistic influence, though Ben Affleck, his good friend and schoolmate, got the \"biggest roles and longest speeches\".","Damon attended Harvard University, where he was a resident of Lowell House and a member of the class of 1992, but left before receiving his degree to take a lead role in the film Geronimo: An American Legend. While at Harvard, he wrote an early treatment of the screenplay for Good Will Hunting as an exercise for an English class. Damon was a member of the Delphic Club, one of the University's select Final Clubs. In 2013, he was awarded the Harvard Arts Medal.Damon received an Academy Award for the screenplay of Good Will Hunting in 1998."]
      },
      {
        "id": 9,
        "name": "Tom Cruise",
        "link": "tomcruise",
        "image": "/static/actPics/2000000009.jpg",
        "history": ["Cruise was born in Syracuse, New York, the son of Mary Lee, a special education teacher, and Thomas Cruise Mapother III, an electrical engineer, both originally from Louisville, Kentucky. He has three sisters: Lee Anne, Marian, and Cass. They are of English, German, and Irish ancestry. One of Cruise's paternal great-great-great-grandfathers, Patrick Russell Cruise, was born in north County Dublin in 1799; he married Teresa Johnson in County Meath, in 1825. They left Ireland for the United States that same year and settled in New York. They had a daughter, Mary Paulina Russell Cruise, whose son Thomas Cruise Mapother was Cruise's great-grandfather. A cousin, William Mapother, is also an actor; he and Cruise have appeared in five films together.","Cruise grew up in near poverty, and had a Catholic upbringing. The family was dominated by his abusive father, whom Cruise has described as \"a merchant of chaos.\" Cruise has said that he was beaten by his father, whom he has called a \"bully and coward.\" He stated, \"He was the kind of person where, if something goes wrong, they kick you. It was a great lesson in my life how he'd lull you in, make you feel safe and then, bang! For me, it was like, 'There's something wrong with this guy. Don't trust him. Be careful around him.'\"","Cruise spent part of his childhood in Canada. His family moved to Beacon Hill, Ottawa, in late 1971 so that Cruise's father could take a position as a defense consultant with the Canadian Armed Forces. There, Cruise attended the newly opened Robert Hopkins Public School for much of grade four and grade five. In grade four, Cruise first became involved in drama, under the tutelage of George Steinburg. Cruise and six other boys put on an improvised play to music called IT at the Carleton Elementary School drama festival. Drama organizer Val Wright, who was in the audience that night, reflected, \"The movement and improvisation were excellent. It was a classic ensemble piece.\" Cruise also enjoyed sports at the school and played floor hockey, though he was known more for his aggression than his talent."]
      },
      {
        "id": 4,
        "name": "Tom Hanks",
        "link": "tomhanks",
        "image": "/static/actPics/2000000004.jpg",
        "history": ["Thomas Jeffrey Hanks was born in Concord, California on July 9, 1956, to hospital worker Janet Marylyn and itinerant cook Amos Mefford Hanks. His mother was of Portuguese descent (her family's surname was originally \"Fraga\"), while his father had English ancestry. His parents divorced in 1960. Their three oldest children, Sandra (later Sandra Hanks Benoiton, a writer), Larry (an entomology professor at the University of Illinois at UrbanaChampaign), and Tom, went with their father, while the youngest, Jim (who also became an actor and filmmaker), remained with their mother in Red Bluff, California. In his childhood, Hanks' family moved often; by the age of 10, he had lived in 10 different houses.","While Hanks' family religious history was Catholic and Mormon, he has characterized his teenage self as being a \"Bible-toting evangelical\" for several years. In school, he was unpopular with students and teachers alike, later telling Rolling Stone magazine, \"I was a geek, a spaz. I was horribly, painfully, terribly shy. At the same time, I was the guy who'd yell out funny captions during filmstrips. But I didn't get into trouble. I was always a real good kid and pretty responsible.\" In 1965, his father married Frances Wong, a San Francisco native of Chinese descent. Frances had three children, two of whom lived with Hanks during his high school years. Hanks acted in school plays, including South Pacific, while attending Skyline High School in Oakland, California.","Hanks studied theater at Chabot College in Hayward, California, and transferred to California State University, Sacramento, two years later. During a 2001 interview with Bob Costas, Hanks was asked whether he would rather have an Oscar or a Heisman Trophy. He replied he would rather win a Heisman by playing halfback for the California Golden Bears. He told New York magazine in 1986, \"Acting classes looked like the best place for a guy who liked to make a lot of noise and be rather flamboyant. I spent a lot of time going to plays. I wouldn't take dates with me. I'd just drive to a theater, buy myself a ticket, sit in the seat and read the program, and then get into the play completely. I spent a lot of time like that, seeing Brecht, Tennessee Williams, Ibsen, and all that.\""]
      },
      {
        "id": 6,
        "name": "Tommy Lee Jones",
        "link": "tommyleejones",
        "image": "/static/actPics/2000000006.jpg",
        "history": ["Jones was born on September 15, 1946, in San Saba, Texas. His mother, Lucille Marie (née Scott), was a police officer, school teacher, and beauty shop owner, and his father, Clyde C. Jones, was an oil field worker. The two were married and divorced twice. He has said that he is of part Cherokee descent. He was raised in Midland, Texas and attended Robert E. Lee High School.","Jones soon moved to Dallas and graduated from the St. Mark's School of Texas in 1965, which he attended on scholarship; he now serves on the board of directors.","He attended Harvard College on a need-based scholarship. He stayed in Mower B-12 as a freshman,[8] across the hall from future Vice President Al Gore. As an upperclassman, he stayed in Dunster House with roommates Gore and Bob Somerby, who later became editor of the media criticism site the Daily Howler. Jones graduated cum laude with a Bachelor of Arts in English in 1969; his senior thesis was on \"the mechanics of Catholicism\" in the works of Flannery O'Connor.","Jones played offensive guard on Harvard's undefeated 1968 varsity football team, was nominated as a first-team All-Ivy League selection, and played in the 1968 Game, which featured a memorable and literally last-minute Harvard 16-point comeback to tie Yale. He recounts his memory of \"the most famous football game in Ivy League history\" in the documentary Harvard Beats Yale 29-29."]
      },
      {
        "id": 14,
        "name": "Uma Thurman",
        "link": "umathurman",
        "image": "/static/actPics/2000000014.jpg",
        "history": ["Thurman was born in Boston, Massachusetts. Her first name \"Uma\" literally means \"splendour, light\" and it is also one of the epithets of Hindu female Goddess Parvati, while her second given name \"Karuna\". Her father, Robert Alexander Farrar Thurman, is a professor of Indo-Tibetan Buddhist Studies; an academic and writer, he lived as an ordained Buddhist monk for three years. Her mother, Nena von Schlebrügge, a high-fashion model, was born in Mexico City; Nena was discovered in Stockholm, and moved to New York City at the age of 17 to join the Ford Modeling Agency. Thurman received a Buddhist upbringing, and spent altogether around two years in the Indo-Himalayan town of Almora. She grew up mostly in Amherst, Massachusetts, where she went to Amherst Regional Junior High School, then moved to Woodstock, New York. She has three brothers, Ganden, Dechen Karl, and Mipam, and a half-sister named Taya, from her father's previous marriage. Thurman's first cousin, once removed, is Swedish football player Max von Schlebrügge.","Thurman is described is having been an awkward and introverted girl who was teased for her appearance and unusual name (sometimes using the name \"Uma Karen\" instead of her birth name). When Thurman was 10 years old, a friend's mother suggested a nose job. As a child, she suffered bouts of body dysmorphic disorder. She attended Amherst Public Schools. In the eighth grade she discovered her love for acting. Talent scouts noticed her performance as Abigail in a production of The Crucible and offered her the chance to act professionally. Thurman attended Northfield Mount Hermon School, a preparatory school in Massachusetts, before dropping out to pursue a career in acting"]
      },
      {
        "id": 2,
        "name": "Will Smith",
        "link": "willsmith",
        "image": "/static/actPics/2000000002.jpg",
        "history": ["Smith was born on September 25, 1968 in Philadelphia, Pennsylvania, to Caroline (Bright), a Philadelphia school board administrator, and Willard Carroll Smith Sr. U.S. Air Force veteran and refrigeration engineer. He grew up in West Philadelphia's Wynnefield neighborhood, and was raised Baptist.[14] He has an elder sister named Pamela and two younger siblings, twins Harry and Ellen. Smith attended Our Lady of Lourdes, a private Catholic elementary school in Philadelphia. His parents separated when he was 13, but did not actually divorce until around 2000.","Smith attended Overbrook High School. While it has been widely reported that Smith turned down a scholarship to attend the Massachusetts Institute of Technology (MIT), he never applied to college because he \"wanted to rap.\" Smith says he was admitted to a \"pre-engineering [summer] program\" at MIT for high school students, but he did not attend. According to Smith, \"My mother, who worked for the School Board of Philadelphia, had a friend who was the admissions officer at MIT. I had pretty high SAT scores and they needed black kids, so I probably could have gotten in. But I had no intention of going to college.\""]
      }
    ],
    "years": [
      1994, 1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008
    ],
      "movies": [
          {
              "id": 25,
              "link": "28dayslater",
              "movie": "28 Days Later",
              "poster": "/static/posters/0000000025.jpg",
              "director": "Danny Boyle",
              "producer": "Andrew Macdonald",
              "genre": "Horror",
              "genreLink":"horror",
              "year": 2002,
              "plot": ["In Cambridge, three animal liberation activists break into a medical research laboratory. A scientist in the lab desperately warns them against releasing the captive chimpanzees, which are infected with a highly contagious rage-inducing virus. Ignoring his pleas, the activists release a chimp, which infects a female activist. She then attacks and infects everyone else present.","28 days later, in London, Jim—a bicycle courier—awakens alone from a coma in St Thomas' Hospital. He wanders the streets of London, finding the city deserted with signs of catastrophe everywhere. Jim eventually encounters some infected humans and is pursued, but survivors Selena and Mark rescue him. At their shelter, the two explain to Jim that while he was in a coma, a virus had spread quickly among the populace, resulting in societal collapse. They claim the virus had been reported in Paris and New York City as well, suggesting the infection has spread worldwide.","The next day, Selena and Mark accompany Jim to his parents' house in Deptford, where he discovers they had committed suicide. That night, the three fend off a pair of infected; Mark is bitten, and Selena kills him. She explains to Jim that the virus spreads through blood and saliva and overwhelms its victims in 10 to 20 seconds. After leaving the house, the two see some blinking Christmas lights from Balfron Tower. There, they discover two more survivors: cab driver","Frank and his daughter Hannah, who allow them to take shelter. The next day, Frank informs them that their supplies (particularly water) are dwindling; he plays them a pre-recorded radio broadcast from a military blockade near Manchester, claiming to have 'the answer to infection' and promising protection to any survivors that can reach them.","The group board Frank's cab and head to Manchester, bonding with one another during the trip. At the deserted blockade, Frank is infected when a drop of blood falls into his eye. He is killed by arriving soldiers, who take the remaining survivors to a fortified mansion under the command of Major Henry West. West reveals to Jim that his 'answer to infection' entails waiting for the infected to starve to death and luring female survivors into sexual slavery to repopulate the world. The group attempts to flee, but Jim is captured and chained next to Sergeant Farrell, a dissenting soldier. Farrell shares with Jim his speculation that the virus has not spread beyond Great Britain and that the country is being quarantined.","The next day, the soldiers prepare the girls for gang rape, while two others lead Jim and Farrell to execution. While his executioners argue after killing Farrell, Jim escapes. Jim lures West and another soldier to the blockade, where Jim kills the latter and leaves West stranded for arriving infected. He runs back to the mansion and releases Mailer, an infected soldier West kept for observation. Mailer infects another soldier and they wreak murderous havoc throughout the mansion. In the confusion, a soldier drags Selena upstairs, where Jim ambushes and kills him. The two reunite with Hannah and run to Frank's cab; Jim is then shot by West, who has been waiting inside. Mailer grabs West through the rear window of the cab and kills him, and the trio finally leave the mansion."],
              "time": 113,
              "casting": ["Gerard Butler","Lena Headey","David Wenham","Dominic West"],
              "budget": 8,
              "boxoffice": 85
          },
          {
              "id": 14,
              "link": "300",
              "movie": "300",
              "poster": "/static/posters/0000000014.jpg",
              "director": "Zack Snyder",
              "producer": "Mark Canton",
              "genre": "Action",
              "genreLink":"action",
              "year": 1998,
              "plot": ["In 479 BC, one year after the Battle of Thermopylae, Dilios, a hoplite in the Spartan Army, begins his story by depicting the life of Leonidas I from childhood to kingship via Spartan doctrine. Dilios's story continues and a Persian herald arrives at the gates of Sparta demanding 'earth and water' as a token of submission to King Xerxes - the Spartans reply by throwing the envoy and his escort into a deep well. Leonidas then visits the Ephors, proposing a strategy to drive back the numerically superior Persians through the Hot Gates. His plan involves building a wall in order to funnel the Persians into a narrow pass between the rocks and the sea: negating the Persian advantage in numbers, and giving Greek heavy infantry the advantage over the vast waves of Persian light infantry. The Ephors consult the Oracle, who decrees that Sparta will not go to war during the Carneia. As Leonidas angrily departs, an agent from Xerxes appears, rewarding the Ephors for their covert support.","Although the Ephors have denied him permission to mobilize Sparta's army, Leonidas gathers three hundred of his best soldiers in the guise of his personal bodyguard. They are joined along the way by Arcadians. At Thermopylae, they construct the wall made up of stones and slain Persian scouts as mortar, angering a Persian emissary. Stelios, an elite Spartan soldier, orders the former to go back to the Persian lines and warn Xerxes, after cutting off his whipping arm.","Meanwhile, Leonidas encounters Ephialtes, a deformed Spartan whose parents fled Sparta to spare him certain infanticide. Ephialtes asks to redeem his father's name by joining Leonidas' army, warning him of a secret path the Persians could use to outflank and surround the Spartans. Though sympathetic, Leonidas rejects him since his deformity physically prevents him from holding his shield high enough, potentially compromising the phalanx formation, and Ephialtes is enraged.","The battle begins soon after the Spartans' refusal to lay down their weapons. Using the Hot Gates to their advantage, as well as their superior fighting skills, the Spartans repel wave after wave of the advancing Persian army. During a lull in the battle, Xerxes personally approaches Leonidas to persuade him to surrender, offering him wealth and power in exchange for his allegiance. Leonidas declines and mocks Xerxes for the inferior quality of his fanatical warriors. In response, Xerxes sends in his elite guard, the Immortals, later that night. The Spartans nonetheless manage to defeat the Immortals with few losses, with slight help from the Arcadians."],
              "time": 116,
              "casting": ["Gerard Butler","Lena Headey","David Wenham","Dominic West"],
              "budget": 65,
              "boxoffice": 456.1
          },
          {
              "id": 15,
              "link": "americanbeaty",
              "movie": "American Beauty",
              "poster": "/static/posters/0000000015.jpg",
              "director": "Sam Mendes",
              "producer": "Bruce Cohen",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 1999,
              "plot": ["Lester Burnham is a middle-aged magazine executive who despises his job. His wife, Carolyn, is an ambitious real estate broker; their sixteen-year-old daughter, Jane, abhors her parents and has low self-esteem. The Burnhams' new neighbors are retired United States Marine Corps Colonel Frank Fitts and his near-catatonic wife, Barbara. The Fitts' teenage son, Ricky, obsessively films his surroundings with a camcorder, collecting hundreds of recordings on video tapes in his bedroom, and uses his part-time job of a social events waiter as a front for his secret marijuana dealings. Frank is a strict disciplinarian who previously forced Ricky into a military academy and briefly committed him to a psychiatric hospital. Jim Olmeyer and Jim Berkley, a gay couple who live nearby, welcome the family to the neighborhood; Col. Fitts later reveals his homophobia when angrily discussing the incident with Ricky.","Lester becomes infatuated with Jane's vain cheerleader friend, Angela Hayes, after seeing her perform a half-time dance routine at a high school basketball game. He starts having sexual fantasies about Angela, in which red rose petals are a recurring motif. Carolyn begins an affair with a married business rival, Buddy Kane. Lester is told he is being laid off, but instead blackmails his boss, Brad, for one year's salary plus benefits. He continues his liberation by taking up employment at a fast-food outlet, purchasing his dream car and doing physical workout after he overhears Angela telling Jane that she would find him sexually attractive if he improved his physique. He begins smoking marijuana supplied by Ricky, and flirts with Angela whenever she visits Jane. The girls' friendship wanes after Jane starts a relationship with Ricky; they bond over what Ricky considers the most beautiful imagery he has ever filmed: a plastic bag being blown in the wind.","Lester discovers Carolyn's infidelity, but reacts indifferently. Buddy ends the affair, fearing an expensive divorce. Frank becomes suspicious of Lester and Ricky's friendship and later finds his son's footage of a nude Lester lifting weights, which Ricky captured by chance. After watching Ricky and Lester through Lester's garage window, Frank mistakenly concludes they are sexually involved. He later beats Ricky and accuses him of being gay. Fed up with his father's authoritarian lifestyle, Ricky goads Frank to expel him from their home by falsely admitting to the charges. Carolyn is shown sitting in her car, where she takes a handgun from the glove box. Ricky finds Jane in the midst of an argument with Angela and convinces her to flee with him to New York City, before admonishing Angela as being boring and ordinary.","Frank confronts Lester and attempts to kiss him, but Lester rebuffs Frank, who flees. Lester finds a distraught Angela sitting alone in the dark. She asks him to tell her she is beautiful; he does, and the pair kiss. However, moments before they are about to have sex, Angela admits her virginity and Lester decides not to go through with the act. Instead, they talk, and bond over their shared frustrations. Angela goes to the bathroom and Lester smiles at a family photograph in his kitchen before being shot by an unseen intruder. Ricky and Jane find Lester's body, while Carolyn is seen crying in the closet. A bloodied Frank returns home, where a gun is missing from his collection. Lester's closing narration describes meaningful experiences during his life; he says that, despite his death, he is happy because there is so much beauty in the world."],
              "time": 122,
              "casting": ["Annette Bening","Thora Birch","Allison Janney","Peter Gallagher"],
              "budget": 15,
              "boxoffice": 356.3
          },
          {
              "id": 42,
              "link": "borat",
              "movie": "Borat",
              "poster": "/static/posters/0000000042.jpg",
              "director": "Larry Charles",
              "producer": "Sacha Baron Cohen",
              "genre": "Comedy",
              "genreLink":"comedy",
              "year": 2006,
              "plot": ["At the behest of the Kazakh Ministry of Information, reporter Borat Sagdiyev leaves Kazakhstan for the United States, which he called \"Greatest Country in the World\", the \"U, S and A\", to make a documentary. He leaves behind his wife Oksana and other inhabitants of his village including his prostitute and implied lover sister Natalia and his annoying neighbour Nursultan Tulyakbay. His companions are his producer Azamat Bagatov and a pet hen.","In New York, Borat sees an episode of Baywatch on TV and immediately falls in love with Pamela Anderson's character, C. J. Parker. While interviewing and mocking a panel of feminists, he learns of the actress's name and her residence in California. Borat is then informed by telegram that Oksana has been killed by a bear. Delighted, he resolves to travel to California and make Pam Anderson his new wife. Azamat is afraid of flying because of the September 11, 2001, attacks, which he believes were the work of Jews. Borat takes driving lessons and buys a dilapidated ice-cream truck for the journey.","During the trip, Borat acquires a Baywatch booklet and continues gathering footage for his documentary. He meets gay pride parade participants, politicians Alan Keyes and Bob Barr, and African American youths. When Borat tells Keyes about the friends he made at gay pride, Keyes reveals that they are homosexual, shocking Borat and filling him with regret. Borat is also interviewed at a live local television station and proceeds to disrupt the weather report. Visiting a rodeo, Borat excites the crowd with jingoistic remarks, but then sings a fictional Kazakhstani national anthem to the tune of \"The Star-Spangled Banner\", receiving a strong negative reaction.","Staying at a bed-and-breakfast, Borat and Azamat are stunned to learn that their hosts are Jewish. Fearful at the hands of their hosts, the two escape after throwing money at two woodlice, believing that they are their Jewish hosts transformed. After their escape Borat insists they press on to California despite Azamat's objections as he wants to return to New York as he believes there are no Jews there. To appease Azamat, Borat attempts to buy a handgun to defend himself, but is turned away because he is not an American citizen, so he buys a bear instead.","An etiquette coach suggests Borat attend a private dinner at an eating club in the South. During the dinner, he unintentionally offends the other guests by showing them naked photos of him and his son and mistaking someone as retarded. When he lets Luenell, an African-American prostitute, into the house and shows her to the table, they both are kicked out. Borat befriends Luenell, and she invites him into a relationship with her, but he tells her that he is in love with someone else. Borat then visits an antique shop where he clumsily breaks various Confederate heritage items, almost bankrupting the documentary.","At a hotel, Borat, just out of the bath, sees Azamat masturbating over a picture of Pamela Anderson. A furious Borat accidentally reveals that she is the reason why they're travelling across the entire country instead of staying in New York. Azamat becomes livid at Borat's deception, and the situation escalates into a nude brawl with huge material damage to their room which spills out into the hallway, a crowded elevator, and then into a packed convention ballroom.","Azamat abandons Borat, taking his passport, all of their money, and their bear (whose head is later seen inside Azamat's motel refrigerator). Borat's truck runs out of gas, and he begins to hitchhike to California. He is soon picked up by drunken fraternity brothers from the University of South Carolina. On learning the reason for his trip, they show him the Pam and Tommy sex tape which reveals that she is not a virgin, as he had previously suspected. Despondent, Borat burns the Baywatch booklet and, by mistake, his return ticket to Kazakhstan.","Borat attends a United Pentecostal camp meeting, at which Republican U.S. Representative Chip Pickering and Mississippi Supreme Court Chief Justice James W. Smith, Jr. are present. He regains his faith, and forgives Azamat and Pamela. He accompanies church members on a bus to Los Angeles and disembarks to find Azamat dressed as Oliver Hardy (though Borat thinks that he is dressed as Adolf Hitler). The two reconcile in Azamat's hotel where he tells Borat where to find Pamela Anderson. Borat finally comes face-to-face with Anderson at a book signing at a Virgin Megastore. After showing Anderson his \"traditional marriage sack\", Borat pursues her throughout the store in an attempt to abduct her until security guards intervene.","Borat visits Luenell and they return to Kazakhstan together, bringing back American customs and technology. This includes the apparent conversion of the people to Christianity (the Kazakh version of which includes crucifixion and torturing of Jews) and the introduction of computer-based technology, such as iPods, laptop computers and a high-definition LCD television.","Over the credits, the fictional Kazakhstan national anthem which Borat sang at the rodeo is played accompanied by images of Soviet-style industry."],
              "time": 84,
              "casting": ["Sacha Baron Cohen"],
              "budget": 18,
              "boxoffice": 262
          },
          {
              "id": 27,
              "link": "braveheart",
              "movie": "Braveheart",
              "poster": "/static/posters/0000000027.jpg",
              "director": "Mel Gibson",
              "producer": "Alan Ladd, Jr.",
              "genre": "Historical",
              "genreLink":"historical",
              "year": 1995,
              "plot": ["In 1280, King Edward 'Longshanks' invades and conquers Scotland following the death of Alexander III of Scotland, who left no heir to the throne. Young William Wallace witnesses Longshanks' treachery, survives the deaths of his father and brother, and is taken abroad on a pilgrimage throughout Europe by his paternal Uncle Argyle, where he is educated. Years later, Longshanks grants his noblemen land and privileges in Scotland, including Prima Nocte. Meanwhile, a grown Wallace returns to Scotland and falls in love with his childhood friend Murron MacClannough, and the two marry in secret. Wallace rescues Murron from being raped by English soldiers, but as she fights off their second attempt, Murron is captured and publicly executed. In retribution, Wallace leads his clan to slaughter the English garrison in his hometown and send the occupying garrison at Lanark back to England.","Longshanks orders his son Prince Edward to stop Wallace by any means necessary. Wallace rebels against the English, and as his legend spreads, hundreds of Scots from the surrounding clans join him. Wallace leads his army to victory at the Battle of Stirling Bridge and then destroys the city of York, killing Longshanks' nephew and sending his severed head to the king. Wallace seeks the assistance of Robert the Bruce, the son of nobleman Robert the Elder and a contender for the Scottish crown. Robert is dominated by his father, who wishes to secure the throne for his son by submitting to the English. Worried by the threat of the rebellion, Longshanks sends his son's wife Isabella of France to try to negotiate with Wallace as a distraction for the landing of another invasion force in Scotland.","After meeting him in person, Isabella becomes enamored of Wallace. Warned of the coming invasion by Isabella, Wallace implores the Scottish nobility to take immediate action to counter the threat and take back the country. Leading the English army himself, Longshanks confronts the Scots at Falkirk where noblemen Lochlan and Mornay, having been bribed by Longshanks, betray Wallace, causing the Scots to lose the battle. As Wallace charges toward the departing Longshanks on horseback, he is intercepted by one of the king's lancers, who turns out to be Robert the Bruce, but filled with remorse, Bruce gets Wallace to safety before the English can capture him. Wallace kills Lochlan and Mornay for their betrayal, and wages a guerrilla war against the English for the next seven years, assisted by Isabella, with whom he eventually has an affair. Robert sets up a meeting with Wallace in Edinburgh, but Robert's father has conspired with other nobles to capture and hand over Wallace to the English. Learning of his treachery, Robert disowns his father. Isabella exacts revenge on the now terminally ill Longshanks by telling him that his bloodline will be destroyed upon his death as she is now pregnant with Wallace's child.","In London, Wallace is brought before an English magistrate, tried for high treason, and condemned to public torture and beheading. Even whilst being hanged, drawn and quartered, Wallace refuses to submit to the king. As cries for mercy come from the watching crowd deeply moved by the Scotsman's valor, the magistrate offers him one final chance, asking him only to utter the word, 'Mercy', and be granted a quick death. Wallace instead shouts, 'Freedom!', and the judge orders his death. Moments before being decapitated, Wallace sees a vision of Murron in the crowd, smiling at him."],
              "time": 178,
              "casting": ["Annette Bening","Thora Birch","Allison Janney","Peter Gallagher"],
              "budget": 65,
              "boxoffice": 210.4
          },
          {
              "id": 16,
              "link": "brokebackmountain",
              "movie": "Brokeback Mountain",
              "poster": "/static/posters/0000000016.jpg",
              "director": "Ang Lee",
              "producer": "Diana Ossana",
              "genre": "Western",
              "genreLink":"western",
              "year": 2005,
              "plot": ["In 1963, Ennis Del Mar and Jack Twist are hired by Joe Aguirre to herd his sheep through the summer in the Wyoming mountains. After a night of heavy drinking, Jack makes a pass at Ennis, who is initially hesitant but eventually responds to Jack's advances. Despite Ennis' telling Jack that it was a one-time incident, they develop a passionate sexual and emotional relationship. After Jack and Ennis eventually part ways, Ennis marries his longtime fiancée Alma Beers and has two daughters with her. Jack returns the next summer seeking work, but Aguirre, who had observed Jack and Ennis on the mountain, refuses to rehire him.","Jack moves to Texas, where he meets, marries, and has a son with rodeo rider Lureen Newsome. After four years, Jack visits Ennis. Upon meeting, the two kiss passionately, and Alma inadvertently observes this. Jack broaches the subject of creating a life with Ennis on a small ranch, but Ennis, haunted by a childhood memory of the torture and murder of two men suspected of homosexual behavior, refuses. He is also unwilling to abandon his family.","Ennis and Jack continue to meet for infrequent fishing trips as their respective marriages deteriorate. Lureen abandons the rodeo, going into business with her father and expecting Jack to work in sales. Alma and Ennis eventually divorce in 1975.","Upon hearing about Ennis' divorce, Jack drives to Wyoming. He suggests again that they live together, but Ennis refuses to move away from his children.","Jack finds solace with male prostitutes in Mexico. Ennis sees his family regularly until Alma finally confronts him about her knowing the true nature of his relationship with Jack. This results in a violent argument, causing Ennis to abandon his connections with Alma. Ennis meets and has a brief romantic relationship with Cassie Cartwright, a waitress.","Jack and Lureen meet and befriend another couple, Randall and Lashawn Malone. It is implied that Jack begins an affair with Randall, as Randall tells Jack his boss has a remote cabin that he can use anytime he wants and suggests they use it together sometime.","At the end of a regular fishing trip with Jack, Ennis tries to delay their next meeting. Jack's frustration erupts into argument, and Ennis blames Jack for being the cause of his own conflicted actions.","Ennis begins to cry. Jack tries to hold him and he momentarily objects, but they end up locked in an embrace. Jack watches as Ennis drives away. Some time later, Ennis receives a postcard he had sent to Jack, stamped 'Deceased'. He calls Lureen, who says that Jack died in an accident, when a tire he was changing exploded. As she is speaking, Ennis imagines that Jack was actually beaten to death by a gang of thugs, the fate that Ennis feared. Lureen tells Ennis that Jack wanted to have his ashes scattered on Brokeback Mountain, but she does not know where it is.","Ennis travels to meet with Jack's parents and offers to take Jack's ashes to the mountain. The father refuses, preferring to have them interred in a family plot. Permitted by Jack's mother to see Jack's childhood bedroom, Ennis finds the bloodstained shirt he thought he had lost on Brokeback Mountain. He discovers Jack kept it hanging with his own stained shirt from that summer's fight. Ennis holds both shirts up to his face, silently weeping. Jack's mother lets him keep the shirts."],
              "time": 134,
              "casting": ["Annette Bening","Thora Birch","Allison Janney","Peter Gallagher"],
              "budget": 14,
              "boxoffice": 178.1
          },
          {
              "id": 43,
              "link": "casinoroyale",
              "movie": "Casino Royale",
              "poster": "/static/posters/0000000043.jpg",
              "director": "Martin Campbell",
              "producer": "Michael G. Wilson",
              "genre": "Action",
              "genreLink":"action",
              "year": 2006,
              "plot": ["MI6 agent James Bond gains his licence to kill and status as a 00 agent by assassinating the traitorous MI6 section chief Dryden at the British Embassy in Prague, as well as his contact, Fisher, in a bathroom in Lahore, Pakistan.","In Uganda, the mysterious liaison Mr. White introduces warlord Steven Obanno of the Lord's Resistance Army to Le Chiffre, a terrorist financier. Obanno entrusts Le Chiffre with a large sum of money to invest safely for him; instead Le Chiffre uses it to buy put options on the aerospace company Skyfleet, thus betting the money on the company's failure.","In Madagascar, Bond pursues bomb maker Mollaka to an African embassy, shooting him dead and blowing up the building. In London, MI6 chief M admonishes Bond for having violated international law, and advises him to rethink his future as an agent.","Clues from Mollaka point to corrupt Greek official Alex Dimitrios. Bond finds Dimitrios in the Bahamas and, after seducing his wife, Solange, pursues him to Miami. Bond kills Dimitrios and follows his henchman to the airport. He thwarts the destruction of Skyfleet's airliner, costing Le Chiffre his investment. To recoup the money, Le Chiffre sets up a high-stakes Texas hold 'em tournament at the Casino Royale in Montenegro. MI6 enters Bond in the tournament, believing a defeat will force Le Chiffre to seek asylum with the British government, which they will grant in exchange for information on his clients. On the train to Montenegro, Bond meets Vesper Lynd, a British Treasury agent there to protect the government's $10 million buy-in.","In Montenegro, Bond and Vesper meet their MI6 contact, René Mathis. Bond gains the upper hand at the start of the game. During a break, Obanno, furious at the loss of his investment, ambushes Le Chiffre in his suite. After Obanno leaves Le Chiffre's room, Bond engages him and strangles him to death. Vesper is traumatised by the encounter, but Bond comforts her. When the tournament resumes, Bond loses his initial stake, and Vesper refuses to fund further playing. Frustrated, Bond is about to kill Le Chiffre when he meets Felix Leiter, a fellow player and CIA agent who is on the same mission as Bond. Leiter, on the verge of losing, agrees to stake Bond on the condition that the CIA takes custody of Le Chiffre after his defeat.","Bond rapidly rebuilds his position before the next break. Le Chiffre's girlfriend, Valenka, spikes Bond's martini with digitalis poison. Bond induces vomiting and retreats to his Aston Martin to inject himself with an antidote. MI6 instructs him to use the defibrillator, but a wire is disconnected; Vesper saves Bond by reconnecting the wire. Bond returns to the game just as Leiter loses his last hand to Le Chiffre. The tournament culminates in a $115-million hand in which the remaining players, including Bond and Le Chiffre, go all in. Le Chiffre trumps the other players, but Bond wins with a straight flush.","After Bond and Vesper share a romantic dinner, Vesper is kidnapped by Le Chiffre's men. Bond pursues them in his Aston Martin. He sees Vesper lying in the road and swerves to avoid her, crashing his car. They are taken captive by Le Chiffre. Before Bond falls unconscious, Le Chiffre reveals that Mathis was his mole in MI6. Le Chiffre tortures Bond for the password to the account containing the money, but Bond refuses to give in. As Le Chiffre prepares to castrate Bond, White bursts in and shoots him dead. Bond awakens in a hospital on Lake Como and has Mathis arrested by MI6. Bond decides to resign from MI6 to be with Vesper."],
              "time": 144,
              "casting": ["Daniel Craig","Eva Green","Mads Mikkelsen","Giancarlo Giannini","Jeffrey Wright"],
              "budget": 150,
              "boxoffice": 600
          },
          {
              "id": 17,
              "link": "donniedarko",
              "movie": "Donnie Darko",
              "poster": "/static/posters/0000000017.jpg",
              "director": "Richard Kelly",
              "producer": "Sean McKittrick",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 2001,
              "plot": ["On October 2, 1988, troubled teenager Donald 'Donnie' Darko is woken up and beckoned outside by a mysterious voice. Once outside, he meets a figure in a monstrous rabbit costume who introduces himself as 'Frank' and tells Donnie that the world will end in 28 days, 6 hours, 42 minutes and 12 seconds. Donnie wakes up the next morning on the green of a local golf course and returns home to discover a jet engine has crashed into his bedroom. His older sister Elizabeth tells him the FAA investigators do not know its origin.","Over the next several days, Donnie continues to have visions of Frank, and his parents Eddie and Rose send him to psychotherapist Dr. Thurman. Thurman believes Donnie is detached from reality, and that his visions of Frank are 'daylight hallucinations', symptomatic of paranoid schizophrenia. Frank asks Donnie if he believes in time travel, who, in turn, asks his science teacher Dr. Kenneth Monnitoff. Monnitoff gives Donnie The Philosophy of Time Travel, a book written by Roberta Sparrow, a former science teacher at the school who is now a seemingly senile old woman living outside of town.","Donnie also starts seeing Gretchen Ross, who has recently moved into town with her mother under a new identity to escape her violent stepfather. Frank begins to influence Donnie's actions, including causing him to flood his high school by breaking a water main. Gym teacher Kitty Farmer attributes the act of vandalism to the influence of the short story 'The Destructors', assigned by dedicated English teacher Karen Pomeroy. Kitty begins teaching 'attitude lessons' taken from local motivational speaker Jim Cunningham, but Donnie rebels against these, leading to friction between Kitty and Rose. Kitty arranges for Cunningham to speak at a school assembly, where Donnie insults him. He later finds Cunningham's wallet and address, and Frank suggests setting his house on fire. Firefighters discover a hoard of child pornography there. Cunningham is arrested, and Kitty, who wishes to testify in his defense, asks Rose to chaperone their daughters’ dance troupe on its trip to Los Angeles.","With Rose in Los Angeles and Eddie away for business, Donnie and Elizabeth hold a Halloween costume party to celebrate Elizabeth's acceptance to Harvard. At the party, Gretchen arrives distraught as her mother has gone missing, and she and Donnie have sex for the first time. When Donnie realizes that Frank's prophesied end of the world is only hours away, he takes Gretchen and two other friends to see Sparrow. Instead of Sparrow, they find two high school bullies, Seth and Ricky, who were trying to rob Sparrow's home. Donnie, Seth, and Ricky get into a fight in the road in front of her house, just as Sparrow was returning home. An oncoming car swerves to avoid Sparrow and runs over Gretchen, killing her. The driver turns out to be Elizabeth's boyfriend, Frank Anderson, wearing the same rabbit costume from Donnie's visions. Donnie shoots Frank in the eye with his father's gun, and walks home carrying Gretchen’s body.","Donnie returns home as a vortex forms over his house. He borrows one of his parent’s cars, loads Gretchen’s body into it, and drives to a nearby ridge that overlooks town. There, he watches as the plane carrying Rose and the dance troupe home from Los Angeles gets caught in the vortex's wake, which violently rips off one of its engines, and sends it back in time. Events of the previous 28 days unwind. Donnie wakes up in his bedroom, recognizes the date is October 2, and laughs as the jet engine falls into his bedroom, crushing him. Around town, those whose lives Donnie would have touched wake up from troubled dreams. Gretchen rides by the Darko home the next morning, and learns of Donnie's death. Gretchen and Rose exchange glances and wave as if they know each other, but cannot remember where."],
              "time": 113,
              "casting": ["Jake Gyllenhaal","Jena Malone","Drew Barrymore","Maggie Gyllenhaal","Mary McDonnell"],
              "budget": 4.5,
              "boxoffice": 7.5
          },
          {
              "id": 18,
              "link": "eternalsunshineofthespotlessmind",
              "movie": "Eternal Sunshine of the Spotless Mind",
              "poster": "/static/posters/0000000018.jpg",
              "director": "Michel Gondry",
              "producer": "Steve Golin",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 2004,
              "plot": ["Shy, soft-spoken Joel Barish and unrestrained free spirit Clementine Kruczynski begin a relationship on a Long Island Rail Road train from Montauk to Rockville Centre. Joel and Clementine almost immediately connect, feeling drawn to each other despite their contrasting personalities, and both had felt the need to travel to Montauk that day. Although they do not realize it, they are former lovers, now separated after having dated for two years.","After a fight a few days earlier, Clementine hires the New York City firm Lacuna, Inc. to erase all of her memories of their relationship. Upon discovering this from his friends Rob and Carrie, Joel is saddened and decides to undergo the procedure himself, a process that takes place while he sleeps.","Much of the film subsequently takes place in Joel's mind, during this memory erasure procedure. Joel finds himself revisiting his memories of Clementine in reverse, starting from the disintegration of their relationship. As he comes across happier, positive memories of Clementine early in his relationship, he decides to preserve at least some memory of her and his love for her, trying to evade the procedure by taking his idealized memory of Clementine into memories not linked to her or waking up to stop the process. Despite his efforts, the technicians steadily erase his memories. He comes to the last remaining memory of Clementine, the day he had first met her at a beach house in Montauk. As this memory disintegrates around them, she tells him, 'Meet me in Montauk.','The film features separate', but related, story arcs revolving around the employees of Lacuna during Joel's memory erasure. Patrick, one of the Lacuna technicians performing the erasure, uses Joel's memories and mannerisms to seduce and romance Clementine. Mary, the Lacuna receptionist, is dating the other memory-erasing technician, Stan, but has feelings for Dr. Howard Mierzwiak, a married doctor and the head of Lacuna. During Joel's memory wipe, Mary discovers she had previously had an affair with Dr. Mierzwiak and agreed to have this erased from her memory when Dr. Mierzwiak's wife found out. On learning this, she asks Stan whether he knew about this, to which he claims that he did not. Mary then quits her job and steals the company's records, mailing them to all of Lacuna's customers.","The film returns to the present after Joel and Clementine have met at the train station of Montauk. They both come upon their Lacuna records later that day, and react with shock and bewilderment – they have no clear memory of having known each other, let alone having had a relationship and having had their memories erased. Joel pleads with Clementine to restart their relationship; Clementine initially resists, pointing out it could go the same way. Joel accepts this, and they decide to try anyway."],
              "time": 108,
              "casting": ["Jim Carrey","Kate Winslet","Kirsten Dunst","Mark Ruffalo","Elijah Wood"],
              "budget": 20,
              "boxoffice": 72.3
          },
          {
              "id": 19,
              "link": "fargo",
              "movie": "Fargo ",
              "poster": "/static/posters/0000000019.jpg",
              "director": "Joel Coen",
              "producer": "Ethan Coen",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 1996,
              "plot": ["Shy, soft-spoken Joel Barish and unrestrained free spirit Clementine Kruczynski begin a relationship on a Long Island Rail Road train from Montauk to Rockville Centre. Joel and Clementine almost immediately connect, feeling drawn to each other despite their contrasting personalities, and both had felt the need to travel to Montauk that day. Although they do not realize it, they are former lovers, now separated after having dated for two years.","After a fight a few days earlier, Clementine hires the New York City firm Lacuna, Inc. to erase all of her memories of their relationship. Upon discovering this from his friends Rob and Carrie, Joel is saddened and decides to undergo the procedure himself, a process that takes place while he sleeps.","Much of the film subsequently takes place in Joel's mind, during this memory erasure procedure. Joel finds himself revisiting his memories of Clementine in reverse, starting from the disintegration of their relationship. As he comes across happier, positive memories of Clementine early in his relationship, he decides to preserve at least some memory of her and his love for her, trying to evade the procedure by taking his idealized memory of Clementine into memories not linked to her or waking up to stop the process. Despite his efforts, the technicians steadily erase his memories. He comes to the last remaining memory of Clementine, the day he had first met her at a beach house in Montauk. As this memory disintegrates around them, she tells him, 'Meet me in Montauk.','The film features separate', but related, story arcs revolving around the employees of Lacuna during Joel's memory erasure. Patrick, one of the Lacuna technicians performing the erasure, uses Joel's memories and mannerisms to seduce and romance Clementine. Mary, the Lacuna receptionist, is dating the other memory-erasing technician, Stan, but has feelings for Dr. Howard Mierzwiak, a married doctor and the head of Lacuna. During Joel's memory wipe, Mary discovers she had previously had an affair with Dr. Mierzwiak and agreed to have this erased from her memory when Dr. Mierzwiak's wife found out. On learning this, she asks Stan whether he knew about this, to which he claims that he did not. Mary then quits her job and steals the company's records, mailing them to all of Lacuna's customers.","The film returns to the present after Joel and Clementine have met at the train station of Montauk. They both come upon their Lacuna records later that day, and react with shock and bewilderment – they have no clear memory of having known each other, let alone having had a relationship and having had their memories erased. Joel pleads with Clementine to restart their relationship; Clementine initially resists, pointing out it could go the same way. Joel accepts this, and they decide to try anyway."],
              "time": 98,
              "casting": ["Frances McDormand","William H. Macy","Kirsten Dunst","Steve Buscemi","Peter Stormare"],
              "budget": 7,
              "boxoffice": 60.6
          },
          {
              "id": 20,
              "link": "fightclub",
              "movie": "Fight Club ",
              "poster": "/static/posters/0000000020.jpg",
              "director": "David Fincher",
              "producer": "Art Linson",
              "genre": "Action",
              "genreLink":"action",
              "year": 1999,
              "plot": ["The unnamed Narrator is an automobile recall specialist who is unfulfilled by his job and possessions. He finds catharsis by posing as a sufferer of testicular cancer and other afflictions in support groups, curing his insomnia. His bliss is disturbed by another impostor, Marla Singer. The two agree to split which groups they attend.","On a flight home from a business trip, the Narrator meets soap salesman Tyler Durden. The Narrator returns home to find that his apartment has been destroyed by an explosion. Deciding against asking Marla for help, he calls Tyler, and they meet at a bar. Tyler says the Narrator is beholden to consumerism. In the parking lot, he asks the Narrator to hit him, and they begin a fistfight.","The Narrator moves into Tyler's home, a large dilapidated house in an industrial area. They have further fights outside the bar, which attract growing crowds of men. The fights moves to the bar's basement where the men form Fight Club, which routinely meets for the men to fight recreationally.","Marla overdoses on pills and telephones the Narrator for help; he ignores her, but Tyler goes to her apartment to save her. To the Narrator's irritation, Tyler and Marla begin having loud sex at the house. Tyler warns the Narrator never to talk to Marla about him. The Narrator blackmails his boss and quits his job.","Fight clubs form across the country. Tyler recruits their members to a new anti-materialist and anti-corporate organization, Project Mayhem, without the Narrator's involvement. The group engages in subversive acts of vandalism and violence, increasingly troubling the Narrator. After the Narrator complains that Tyler has excluded him, Tyler leaves the house. The Narrator realizes that Tyler caused the explosion at his apartment."],
              "time": 139,
              "casting": ["Brad Pitt","Edward Norton","Helena Bonham Carter","Meat Loaf","Jared Leto"],
              "budget": 63,
              "boxoffice": 100.9
          },
          {
              "id": 11,
              "link": "eventhorizon",
              "movie": "Event Horizon",
              "poster": "/static/posters/0000000011.jpg",
              "director": "Paul W. S. Anderson",
              "producer": "Lawrence Gordon",
              "genre": "Horror",
              "genreLink":"horror",
              "year": 1997,
              "plot": ["After a government agency makes first contact with aliens in 1961, alien refugees begin living in secret on Earth, mostly disguised as humans in the New York metropolitan area. A secret agency known as the Men in Black (MIB) polices these aliens, protects Earth from intergalactic threats and uses memory-erasing neuralyzers to keep alien activity a secret. Agents have their former identities erased, and retired agents are neuralyzed and given new identities. After an operation to arrest an alien criminal near the Mexican border by Agents K and D, D decides that he is too old for his job. K neuralyzes him and begins looking for a new partner.","New York Police Department officer James Darrell Edwards III pursues a supernaturally fast and agile suspect into the Solomon R. Guggenheim Museum, but is unable to stop him from leaping off the roof to his death. K interviews Edwards about his encounter, then neuralyzes him and leaves him a business card with an address. The next day, Edwards and several other candidates visit the address and undergo a series of tests, for which he finds unusual solutions. While the others are neuralyzed, K explains the history of MIB to Edwards and offers him a position within the agency. After much thought, Edwards accepts and gives up his civilian identity to become Agent J.","In upstate New York, an alien illegally crash-lands on Earth and kills a farmer named Edgar to use his skin as a disguise. The alien goes into a Manhattan diner in search of something and kills two aliens disguised as humans eating lunch. After learning about Edgar's death in a tabloid magazine, J and K investigate the crash site and conclude that Edgar's skin was taken by a 'bug', a species of aggressive cockroach-like aliens. They visit a morgue to examine the bodies the bug killed and find a dying Arquillian alien within one, who tells them, 'To prevent war, the galaxy is on Orion's belt.' K fears that the death of this alien, who used the name Rosenberg and was a member of the Arquillian royal family, may start a war.","After finding that the bug has ransacked Rosenberg's jewelry shop without taking anything of value, J and K question Frank the Pug, an alien informant disguised as a dog. Frank explains that the missing galaxy is a massive energy source housed in a small jewel, and the bug wants to destroy the Arquillians with it. He also reveals that the galaxy is on Earth. J deduces that it is hanging on the collar of Rosenberg's cat Orion, which refuses to leave the body at the morgue. J and K arrive just as the bug takes the galaxy and kidnaps the coroner, Laurel Weaver. An Arquillian battleship fires a warning shot in the Arctic and threatens to destroy Earth unless the galaxy is returned within one hour.","The bug arrives at the observation towers of the 1964-1965 New York World's Fair New York State Pavilion at Flushing Meadows, which disguise two flying saucers from the 1961 landing, where Laurel escapes its clutches. It escapes on one saucer, but J and K shoot it down and the ship crashes into the Unisphere. The bug sheds Edgar's skin and swallows both agents' guns, and K provokes it into swallowing him as well. The bug tries to escape on the other ship, but J slows it down by taunting it and crushing cockroaches, angering it. K blows the bug apart from the inside, having found his gun inside its stomach. J and K recover the galaxy, and Laurel destroys the remains of the bug with J's gun before it can ambush them. K tells J that he has been training J as a replacement rather than a partner and has J neuralyze him so he can retire from MIB.","Some time later, J reads about K's return to civilian life at a newsstand before he and Laurel (now MIB Agent L, his new partner) continue on to their next mission. After an extensive zoom out shot, it is revealed that the Milky Way itself exists within a marble (much like the galaxy), and is being used by a pair of colossal extra-terrestrial beings in a game of marbles."],
              "time": 98,
              "casting": ["Laurence Fishburne","Sam Neill","Kathleen Quinlan","Joely Richardson"],
              "budget": 60,
              "boxoffice": 26.7
          },
          {
              "id": 3,
              "link": "forrestgump",
              "movie": "Forrest Gump",
              "poster": "/static/posters/0000000003.jpg",
              "director": "Robert Zemeckis",
              "producer": "Wendy Finerman",
              "genre": "Comedy",
              "genreLink":"comedy",
              "year": 1994,
              "plot": ["In 1981, Forrest Gump recounts his life story to strangers who sit next to him on a bench at a bus stop in Savannah, Georgia.","On his first day of school in Greenbow, Alabama in 1954, Forrest meets a girl named Jenny Curran who, unlike the other children, immediately befriends him. Due to leg braces fitted to correct a curved spine, Forrest is unable to walk properly. One day, a young truck driver stays at the boarding house that Forrest lives in with his mother. The young truck driver turns out to be Elvis Presley, who, while playing guitar for him, becomes enthralled at the jerky hip thrusting movements that the hobbled Forrest makes while trying to dance. Later on, Elvis becomes famous by imitating the dance.","Forrest is often bullied because of his physical disability and marginal intelligence. One day, while trying to escape some bullies chasing him, his braces fall off revealing the young Forrest to be a very fast runner. Jenny yells to him, 'Run, Forrest, run!' Despite his low intelligence quotient, Forrest's new running ability leads to him receiving a football scholarship to the University of Alabama in 1963, becoming a top running back, being named on the All-American team, and meeting President John F. Kennedy. After his college graduation, he voluntarily enlists in the U.S. Army, where he befriends a fellow soldier named Bubba, who convinces Forrest to go into the shrimping business with him when the war is over. In 1967, they are sent to Vietnam and, during an ambush, Bubba is killed in action. Forrest saves many of his platoon, including his lieutenant, Dan Taylor, who loses both his legs. Forrest is awarded the Medal of Honor for his heroism.","While Forrest is in recovery for a gunshot wound to his buttocks received while saving his platoon-mates, he develops a talent for ping pong. He becomes a ping pong celebrity and plays competitively against Chinese teams in ping pong diplomacy. At an anti-war rally in Washington, D.C., Forrest briefly reunites with Jenny, who has been living a hippie lifestyle. While in D.C. in 1972, Forrest meets president Richard Nixon and is put up in the Watergate hotel, where he accidentally reveals the Watergate scandal, ultimately forcing Nixon to resign.","Returning home, Forrest endorses a company that makes ping pong paddles. He uses the earnings to buy a shrimping boat, fulfilling his promise to Bubba. Taylor joins Forrest in 1974, they initially have little success. After their boat becomes the only one to survive Hurricane Carmen they pull in huge amounts of shrimp. They use their income to purchase a fleet of shrimp boats. Dan invests the money in Apple Computer (which Forrest naïvely thinks is 'some kind of fruit company') and Forrest is financially secure for the rest of his life but gives half of his earnings to Bubba's family. He then returns home to see his mother's last days.","In late 1978, Jenny returns to visit Forrest, and he soon proposes to her. She declines but slips into his bedroom and makes love to him that night before leaving early the next morning. Heartbroken, Forrest goes running. He decides to keep running across the country several times over three and a half years, becoming famous in the process.","In the present, Forrest reveals that he is waiting at the bus stop because he received a letter from Jenny who, having seen him run on television, asked him to visit her. Reunited with Jenny, she introduces him to his son, named Forrest Gump, Jr. Jenny tells Forrest she is sick with an unknown virus. The three then move back to Greenbow. Jenny and Forrest finally marry but she dies a year later. Forrest and his son await the school bus on Forrest Jr.'s first day of school."],
              "time": 142,
              "casting": ["Tom Hanks","Robin Wright","Gary Sinise","Mykelti Williamson","Sally Field"],
              "budget": 55,
              "boxoffice": 677.9
          },
          {
              "id": 28,
              "link": "gangsofnewyork",
              "movie": "Gangs of New York",
              "poster": "/static/posters/0000000028.jpg",
              "director": "Martin Scorsese",
              "producer": "Alberto Grimaldi",
              "genre": "Historical",
              "genreLink":"historical",
              "year": 2002,
              "plot": ["In the slum neighborhood of Five Points, Manhattan in 1846, two gangs have engaged in a final battle (or \"challenge\") in Paradise Square over \"who holds sway over the Five Points\"; these two factions involved in this event are the nativist, Protestant \"Natives\" led by William \"Bill the Butcher\" Cutting, and the Irish Catholic group of immigrants, the \"Dead Rabbits\", led by \"Priest\" Vallon. At the end of this battle, Bill kills Vallon and declares the Dead Rabbits outlawed. Having witnessed this, Vallon's young son hides the knife that killed his father and is taken to an orphanage on Blackwell's Island.","Sixteen years later, Vallon's son, using the alias of Amsterdam, returns to the Five Points seeking revenge and retrieves the knife. An old acquaintance, Johnny Sirocco, familiarizes him with the local clans of gangs and thieves, all of whom pay tribute to Bill, who controls the neighborhood. Amsterdam is finally introduced to Bill, but keeps his past a secret, seeking to be recruited. He learns that many of his father's former loyalists are now in Bill's employ. Each year, Bill celebrates the anniversary of his victory over the Dead Rabbits; Amsterdam plans to murder him secretly during this celebration.","Amsterdam becomes attracted to pickpocket and grifter Jenny Everdeane, with whom Johnny is infatuated. Amsterdam gains Bill's confidence and Bill becomes his mentor, involving him in the dealings of corrupt Tammany Hall politician William M. Tweed. Amsterdam saves Bill from an assassination attempt, and is tormented by the thought that he may have done so out of honest devotion.","On the evening of the anniversary, Johnny, in a fit of jealousy over Jenny's affections for Amsterdam, reveals Amsterdam's true identity and intentions to Bill. Bill baits Amsterdam with a knife throwing act involving Jenny. As Bill toasts Priest Vallon, Amsterdam throws his knife, but Bill deflects it and wounds Amsterdam with a counter throw. Bill proclaims that rather than dying, Amsterdam shall live in shame, and burns his cheek with a hot blade. Going into hiding, Jenny nurses Amsterdam back to health and implores him to escape with her to San Francisco.","Amsterdam, however, returns to the Five Points seeking vengeance, and announces his return by hanging a dead rabbit in Paradise Square. Bill sends corrupt policeman Mulraney to investigate, but Amsterdam kills him and hangs his body in the square. In retaliation, Bill has Johnny severely beaten and run through with a pike, leaving it to Amsterdam to end his suffering. The incident garners newspaper coverage, and Tweed presents Amsterdam with a plan to defeat Bill's influence: Tweed will back the candidacy of Monk McGinn for sheriff. Monk wins in a landslide (the election had been rigged by the Dead Rabbits), and a humiliated Bill murders him. McGinn's death prompts an angry Amsterdam to challenge Bill to a gang battle in Paradise Square for order, in which Bill accepts."],
              "time": 168,
              "casting": ["Leonardo DiCaprio","Daniel Day-Lewis","Cameron Diaz","Jim Broadbent","John C. Reilly"],
              "budget": 100,
              "boxoffice": 193.8
          },
          {
              "id": 21,
              "link": "gladiator",
              "movie": "Gladiator ",
              "poster": "/static/posters/0000000021.jpg",
              "director": "Ridley Scott",
              "producer": "Douglas Wick",
              "genre": "Historical",
              "genreLink":"historical",
              "year": 2000,
              "plot": ["In AD 180, Hispano-Roman General Maximus Decimus Meridius intends to return to his home after he leads the Roman army to victory against the Germanic tribes near Vindobona on the Limes Germanicus. Emperor Marcus Aurelius tells Maximus that his own son, Commodus, is unfit to rule, and that he wishes Maximus to succeed him, as regent, to help save Rome from corruption. Commodus, upon hearing this, murders his father.","Commodus announces he is the new Emperor and asks Maximus for his loyalty, but the general refuses. Maximus is arrested by guards and is told that he and his family will die. He kills his captors and rides for his home near Trujillo, where he finds his family murdered. Maximus buries his wife and son; then collapses. He is found by slavers who take him to the Roman province of Zucchabar, where he is sold to a gladiator trainer named Proximo.","Although reluctant at first, Maximus fights in local tournaments and makes friends with two other gladiators: Juba, a Numidian; and Hagen, a German. His military skills help him win matches and gain recognition from other gladiators and the crowd. Proximo reveals that he was once a gladiator, and advises Maximus that he must 'win the crowd' to win his freedom. Proximo takes his gladiators to fight in Rome's Colosseum, because Commodus has organized 150 days of games.","Disguised by a masked helmet, Maximus debuts in gladiatorial combat in the Colosseum as a Carthaginian in a re-enactment of the Battle of Zama. Unexpectedly, Maximus leads his side to victory, and Commodus enters the Colosseum to offer his congratulations. He orders the disguised Maximus, as leader of the gladiators, to show himself and give his name; Maximus reveals himself and declares vengeance. Commodus is compelled by the crowd to let the gladiators live, and the Praetorian Guard is held back from striking them down.","Maximus's next fight is a victory against a legendary undefeated gladiator. Commodus orders Maximus to kill the gladiator, but Maximus spares his opponent's life; he is called 'Maximus the Merciful' by the crowd. Angered at this outcome, Commodus taunts Maximus about his family's deaths, but Maximus turns and walks away.","Maximus discovers from Cicero, his ex-orderly, that his former legions remain loyal. Lucilla, Commodus's sister; Gracchus, an influential senator; and Maximus meet secretly. Maximus will escape Rome, join his soldiers, topple Commodus by force, and hand power back to the Roman Senate. Commodus learns of the plot by threatening Lucilla, and has the Praetorian Guard arrest Gracchus and attack the gladiators' barracks. Proximo and his men, including Hagen, sacrifice themselves to enable Maximus to escape. Maximus is captured at the rendezvous with Cicero, where Cicero is killed."],
              "time": 155,
              "casting": ["Russell Crowe","Joaquin Phoenix","Connie Nielsen","Oliver Reed","Derek Jacobi"],
              "budget": 103,
              "boxoffice": 460.5
          },
          {
              "id": 35,
              "link": "grantorino",
              "movie": "Gran Torino ",
              "poster": "/static/posters/0000000035.jpg",
              "director": "Clint Eastwood",
              "producer": "Clint Eastwood",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2008,
              "plot": ["Walt Kowalski is a cantankerous, retired Polish American assembly line worker and Korean War veteran, who has recently been widowed after 50 years of marriage, causing him to be a lapsed Catholic. His Highland Park neighborhood in the Detroit area of Michigan, formerly populated by working-class white families, is now dominated by poor Asian immigrants, and gang violence is commonplace. Adding to his isolation and detachment are his feelings towards his married sons and their families.","He rejects a suggestion from one of his sons to move to a retirement community (sensing that they want his home and possessions), and lives alone with his elderly dog, Daisy. A longtime cigarette smoker, Walt suffers from coughing fits, occasionally coughing up blood, but conceals this from his family. Roman Catholic priest Father Janovich tries to comfort him, but Walt disdains the young, inexperienced man. Eventually, Walt opens up to the priest, revealing that he is still haunted by memories of the war.","The Hmong Vang Lor family reside next door to Walt. Initially, he wants nothing to do with his new neighbors, particularly after he catches Thao attempting to steal his 1972 Ford Gran Torino as a coerced initiation into a Hmong gang run by Thao's cousin, Fong, whose nickname is \"Spider\". The gang is infuriated by Thao's failure and they attack him, but Walt confronts them with an M1 Garand rifle and chases them off, earning the respect of the Hmong community.","As penance, Thao's mother makes him work for Walt, who has him do odd jobs around the neighborhood, and the two form a grudging mutual respect. Thao's sister Sue introduces Walt to Hmong culture and helps him bond with the Hmong community, who soon become more like family to Walt than his actual family and he, in turn, becomes a better man to them than he was to his own sons. Walt helps Thao get a job and gives him dating advice. Walt eventually visits a doctor regarding his coughing fits, where it's implied that he does not have long to live.","Spider's gang continues to pressure Thao, assaulting him on his way home from work. After he sees Thao's injuries, Walt visits the gang's house, where he attacks a gang member as a warning. In retaliation, the gang performs a drive-by shooting on the Vang Lor home, injuring Thao. They also beat up Sue, and Walt is upset by this. Father Janovich tells him the gang raped her and she is safe at the hospital. There are no other witnesses; the community members, including the victims, refuse to assist the police to incriminate the gang members.","The next day, Thao seeks Walt's help to exact revenge, and Walt tells him to return later in the afternoon. In the meantime, Walt makes personal preparations: he buys a suit, gets a haircut, and makes a confession to Father Janovich, who had pressured him to make it at the behest of his late wife. When Thao returns, Walt takes him to the basement, gives him his Silver Star medal, then locks him in the basement and tells him of his haunting memory of having killed a surrendering enemy soldier. He keeps Thao locked in the basement, until the revenge is over, to make sure the boy will never be haunted by killing someone, with his life ahead of him.","That night, Walt goes to the gang members' house, where they draw their firearms on him. He loudly berates them and enumerates their crimes, drawing the attention of the neighbors. Putting a cigarette in his mouth, he asks for a light, then puts his hand in the pocket of his jacket and provocatively pulls it out as if he were holding a gun, causing the gang members to shoot and kill him. As he falls to the ground, his hand opens to reveal the Zippo cigarette lighter with the 1st Cavalry insignia; he was unarmed. His plan had in fact been to provoke them into killing him in public. Sue, following Walt's directions, frees Thao, and they drive to the scene in Walt's Gran Torino. One of the police officers tells them that all gang members have been placed under arrest for the murder, and due to the number of witnesses, they all face a lengthy sentence in prison."],
              "time": 116,
              "casting": ["Clint Eastwood"],
              "budget": 25,
              "boxoffice": 270
          },
          {
              "id": 26,
              "link": "hightension",
              "movie": "High Tension ",
              "poster": "/static/posters/0000000026.jpg",
              "director": "Alexandre Aja",
              "producer": "Alexandre Arcady",
              "genre": "Horror",
              "genreLink":"horror",
              "year": 2003,
              "plot": ["The film begins with a woman wearing a hospital gown, whispering to herself. Her back is revealed, showing sutures from injuries all over her back. The scene cuts to a woman who runs from something unknown to a road near a forest. She stops a car, screaming, begging for help, when her hand is revealed, covered in blood from a wound on her stomach.","This is revealed to be Marie's dream. She and Alex, her best friend, are on their way to stay at Alex's parents' house for the weekend to study. When they arrive, Alex gives Marie a tour of her house before they settle down for dinner. After dinner, Marie and Alex get ready to go to bed. As Alex sleeps, Marie lies on her bed listening to music and masturbating. Marie hears a doorbell ring and Alex's father wakes to answer it. The man at the door is a serial killer, who slashes Alex's father's face with a straight razor. Alex's father's head is pressed between two spindles of the staircase, then the killer shoves a bookcase towards the father's head, decapitating him. The noise awakens Alex's mother, who finds her husband dead and is approached by the killer.","Marie, hearing the mother's screams, quickly arranges the guest room to make it appear that no one is staying there, and hides under her bed. The killer inspects Marie's room but does not find her. Marie creeps downstairs and finds Alex chained in her bedroom. Promising to find help, she sneaks into the parents' room to find a phone. After hearing loud thuds, she hides in the closet and through the slats of the door witnesses the killing of Alex's mother as her throat is brutally slashed with a razor.","Alex's younger brother runs from the house to the cornfield, pursued by the killer. Marie returns to Alex, where she witnesses the young boy's murder from a window. Marie promises to free Alex, but the killer is heard returning. Marie sneaks into the kitchen and takes a butcher knife. Alex is dragged into the killer's truck. Marie sneaks into the truck with the butcher knife and hides there with Alex. He locks them in and drives off.","When the killer stops at a gas station, Marie gives Alex the knife and sneaks into the gas station shop for help. When the killer comes into the shop, Marie hides and she witnesses the store clerk (Franck Khalfoun) being murdered with an axe. The killer returns to the truck and Marie takes the clerk's car keys and follows the killer down a deserted road. The killer notices Marie following him, and rams Marie's vehicle, pushing the car off the road where it wrecks. Exiting on foot, badly injured, Marie runs into the forest as the killer seeks her. Eventually, Marie bludgeons the killer with a fence post covered in barbed wire. As Marie inspects the body, he grabs at her throat, so Marie suffocates him with a plastic sheet and makes her way back to the truck. Alex seems terrified of Marie as she returns to the vehicle. As police investigate the gas station murders via the in-store videotape, the tape shows Marie murdering the store clerk. In retrospect, the audience is shown how the family murders really happened. Finally, the audience discovers that Marie is murderous, delusional, and in love with Alex."],
              "time": 95,
              "casting": ["Cecile de France","Maiwenn","Philippe Nahon","Oliver Reed","Derek Jacobi"],
              "budget": 2.5,
              "boxoffice": 6.8
          },
          {
              "id": 32,
              "link": "ironman",
              "movie": "Iron Man",
              "poster": "/static/posters/0000000032.jpg",
              "director": "Jon Favreau",
              "producer": "Avi Arad",
              "genre": "Action",
              "genreLink":"action",
              "year": 2008,
              "plot": ["Genius, billionaire, playboy and philanthropist Tony Stark, who has inherited the defense contractor Stark Industries from his father, is in war-torn Afghanistan with his friend and military liaison Lieutenant Colonel James Rhodes to demonstrate the new \"Jericho\" missile. After the demonstration, the convoy is ambushed and Stark is critically wounded by one of his own company's rocket-propelled grenades, used by the attackers. He is captured and imprisoned in a cave by a terrorist group, the Ten Rings; Yinsen, a fellow captive who is a doctor, implants an electromagnet into Stark's chest to keep the shrapnel shards that wounded him from reaching his heart and killing him. Ten Rings leader Raza offers Stark freedom in exchange for building a Jericho missile for the group, but Tony and Yinsen know that Raza will not keep his word.","Stark and Yinsen secretly build a small, powerful electric generator called an arc reactor to power Stark's electromagnet and a prototypical suit of powered armor to aid in their escape. Although they keep the suit hidden almost to completion, the Ten Rings discover their hostages' intentions and attack the workshop. Yinsen sacrifices himself to divert them while the suit is completed. The armored Stark battles his way out of the cave to find the dying Yinsen, then burns the Ten Rings' weapons in anger and flies away, crashing in the desert and destroying the suit in the process. After being rescued by Rhodes, Stark returns home and announces that his company will no longer manufacture weapons. Obadiah Stane, his father's old partner and the company's manager, advises Stark that this may ruin Stark Industries and his father's legacy. In his home workshop, Stark builds a sleeker, more powerful version of his improvised armor suit as well as a more powerful arc reactor for his chest. Personal assistant Pepper Potts places the original reactor inside a small glass showcase. Though Stane requests details, Stark keeps his work to himself because he is suspicious of his company.","At a charity event held by Stark Industries, reporter Christine Everhart informs Stark that his company's weapons, including the Jericho, were recently delivered to the Ten Rings and are being used to attack Yinsen's home village, Gulmira. Stark then learns that Stane has been arms trafficking to criminals worldwide, and is staging a coup to replace him as Stark Industries' CEO. Stark dons his new armor and flies to Afghanistan, where he saves the villagers. While flying home, Stark is shot at by two F-22 Raptor fighter jets. He reveals his secret identity to Rhodes over the phone in an attempt to end the attack. Meanwhile, the Ten Rings gather the pieces of Stark's prototype suit and meet with Stane, who subdues Raza and has the rest of the group killed. Stane has a massive new suit reverse engineered from the wreckage. Seeking to track his company's illegal shipments, Stark sends Potts to hack into its database. She discovers that Stane hired the Ten Rings to kill Stark, but the group reneged. Potts meets with Agent Phil Coulson of S.H.I.E.L.D., an intelligence agency, to inform him of Stane's activities.","Stane's scientists cannot duplicate Stark's miniaturized arc reactor, so Stane ambushes Stark at his home and takes the one from his chest. Stark manages to get to his original reactor to replace it. Potts and several S.H.I.E.L.D. agents attempt to arrest Stane, but he dons his suit and attacks them. Stark fights Stane, but is outmatched without his new reactor to run his suit at full capacity. The fight carries Stark and Stane to the top of the Stark Industries building, and Stark instructs Potts to overload the large arc reactor powering the building. This unleashes a massive electrical surge that causes Stane and his armor to fall into the exploding reactor, killing him. The next day, at a press conference, Stark defies suggestions from S.H.I.E.L.D. and publicly admits to being the superhero the press has dubbed \"Iron Man\"."],
              "time": 126,
              "casting": ["Will Smith","Bill Pullman","Jeff Goldblum","Mary McDonnell"],
              "budget": 140,
              "boxoffice": 585.2
          },
          {
              "id": 48,
              "link": "killbillvolume1",
              "movie": "Kill Bill: Volume 1",
              "poster": "/static/posters/0000000048.jpg",
              "director": "Quentin Tarantino",
              "producer": "Lawrence Bender",
              "genre": "Action",
              "genreLink":"action",
              "year": 2003,
              "plot": ["A woman in a wedding dress, the Bride, lies wounded in a chapel in El Paso, Texas, having been attacked by the Deadly Viper Assassination Squad. She tells their leader, Bill, that she is pregnant with his baby. Bill shoots her in the head.","Four years later, having survived the attack, the Bride goes to the home of Vernita Green, planning to kill her. Both women were members of the assassination squad, which has since disbanded. Vernita now leads a normal suburban family life. They engage in a knife fight, but are interrupted by the arrival of Vernita's young daughter, Nikki. The Bride agrees to meet Vernita at night to settle the matter, but Vernita tries to surprise the Bride with a pistol hidden in a box of cereal. The Bride dodges the shot and throws a knife into Vernita's chest, killing her.","Four years earlier, police investigate the massacre at the wedding chapel. The sheriff discovers the Bride is alive but comatose. In the hospital, Deadly Viper Elle Driver prepares to assassinate the Bride via lethal injection, but Bill aborts the mission at the last moment, considering it dishonorable to kill the Bride when she cannot defend herself.","In the present, the Bride awakens from her four-year coma and is horrified to find she is no longer pregnant. She kills a hospital worker who has been raping her while she was comatose, takes his truck, and teaches herself to walk again. Resolving to kill Bill and all four members of the Deadly Viper Assassination Squad, she picks her first target: Ren Ishii, now the leader of the Tokyo yakuza. O Ren's parents were murdered by the yakuza when she was a child; she took vengeance on the yakuza boss and replaced him after training as an elite assassin.","The Bride travels to Okinawa, Japan, to obtain a sword from legendary swordsmith Hattori Hanzo, who has sworn never to forge a sword again. After learning that her target is Bill, his former student, he crafts his finest sword for her. The Bride tracks down O-Ren at a Tokyo restaurant, the House of Blue Leaves, and defeats and kills her yakuza army, including the elite Crazy 88 and O-Ren's bodyguard, schoolgirl Gogo Yubari. She duels with O-Ren in the restaurant's Japanese garden, and slices the top of her head off with a sword stroke. She tortures Sofie Fatale, O Ren's assistant, for information about Bill, and leaves her alive as a threat. Bill asks Sofie if the Bride knows her daughter is alive."],
              "time": 111,
              "casting": ["Uma Thurman","Lucy Liu","Vivica A. Fox","Michael Madsen","Daryl Hannah","David Carradine"],
              "budget": 30,
              "boxoffice": 180.9
          },
          {
              "id": 49,
              "link": "killbillvolume2",
              "movie": "Kill Bill: Volume 2",
              "poster": "/static/posters/0000000049.jpg",
              "director": "Quentin Tarantino",
              "producer": "Lawrence Bender",
              "genre": "Action",
              "genreLink":"action",
              "year": 2004,
              "plot": ["The pregnant Bride and her groom rehearse their wedding. Bill, the Bride's former lover, the father of her child, and the leader of the Deadly Viper Assassination Squad, arrives unexpectedly and orders the Deadly Vipers to kill everyone at the wedding. The Bride survives and swears revenge.","Four years later, the Bride has already assassinated Deadly Vipers O-Ren Ishii and Vernita Green. She goes to the trailer of Bill's brother and Deadly Viper Budd, planning to ambush him. Budd has been warned by Bill of her approach; he shoots her in the chest with a shotgun blast of rock salt, then sedates her. He calls Elle Driver, another former Deadly Viper, and arranges to sell her the Bride's unique sword for a million dollars. He seals the Bride inside a coffin and buries her alive.","Years earlier, Bill tells the young Bride of the legendary martial arts master Pai Mei and his Five Point Palm Exploding Heart Technique, a death blow that Mei refuses to teach his students; the technique that supposedly kills any opponent after they have taken five steps. Bill takes the Bride to Mei's temple for training. Mei ridicules her and makes her training a torment, but she gains his respect. In the present, the Bride uses Mei's martial arts techniques to break out of the coffin and claw her way to the surface.","Elle arrives at Budd's trailer and kills him with a black mamba hidden with the money for the sword. She calls Bill and tells him the Bride has killed Budd and that Elle has killed the Bride. She uses the Bride's real name: Beatrix Kiddo. As Elle exits the trailer, Beatrix ambushes her and they fight. Elle, who was also taught by Mei, taunts Beatrix by revealing that she poisoned Mei in retribution for his plucking out her eye. Beatrix plucks out Elle's remaining eye and leaves her screaming in the trailer with the black mamba.","In Mexico, Beatrix meets a retired pimp, Esteban Vihaio, who helps her find Bill. She tracks him to a hotel, and discovers that their daughter B.B. is still alive, now aged four. She spends the evening with them. After she puts B.B. to bed, Bill shoots Beatrix with a dart containing truth serum and interrogates her. She recounts a mission in which she discovered she was pregnant and explains that she left the Deadly Vipers to give B.B. a better life. Bill explains that he assumed she had died and mourned her for three months; he ordered her assassination when he discovered she was alive and engaged to a \"jerk\" he assumed was the father of her child. Beatrix disables Bill and strikes with Mei's Five Point Palm Exploding Heart Technique, which she kept secret. Bill makes his peace with her, takes five steps and dies. Beatrix leaves with B.B. to start a new life."],
              "time": 136,
              "casting": ["Uma Thurman","David Carradine","Michael Madsen","Michael Madsen","Daryl Hannah","Gordon Liu"],
              "budget": 30,
              "boxoffice": 152.2
          },
          {
              "id": 1,
              "link": "leon",
              "movie": "Leon: The Professional",
              "poster": "/static/posters/0000000001.jpg",
              "director": "Luc Besson",
              "producer": "Patrice Ledoux",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 1994,
              "plot": ["Leon Montana (Jean Reno) is an Italian hitman (or 'cleaner', as he refers to himself) living a solitary life in New York City's Little Italy. His work comes from a mafioso named Tony (Danny Aiello). Leon spends his idle time engaging in calisthenics, nurturing a houseplant, and watching old films.",
                      "One day, Leon meets Mathilda Lando (Natalie Portman), a lonely 12-year-old girl. Mathilda lives with her dysfunctional family in an apartment down the hall, and has stopped attending class at her school for troubled girls. Mathilda's abusive father (Michael Badalucco) attracts the ire of corrupt DEA agents, who have been paying him to stash cocaine in his apartment. After they discover he has been cutting the cocaine to keep for himself, DEA agents storm the building, led by sharply dressed drug addict Norman Stansfield (Gary Oldman). During the raid, Stansfield quickly becomes unhinged and murders Mathilda's entire family while she is out shopping for groceries. When Mathilda returns, she realizes what has happened just in time to continue down the hall to Leon's apartment, who hesitantly gives her shelter.",
                      "Mathilda quickly discovers that Leon is a hitman. She begs him to take care of her and to teach her his skills, as she wants to avenge the murder of her four-year-old brother. At first, Leon is unsettled by her presence, and considers murdering her, but he eventually trains Mathilda and shows her how to use various weapons. In exchange, she runs his errands, cleans his apartment, and teaches him how to read. In time, the pair forms a close bond. Mathilda often tells Leon she loves him, but he refuses to reciprocate.",
                      "When Leon heads out for an apparent assignment, Mathilda fills a bag with guns from Leon's collection and sets out to kill Stansfield. She bluffs her way into the DEA office by posing as a delivery girl, only to be ambushed by Stansfield in a bathroom; one of his men arrives and announces that Leon had just killed one of the corrupt DEA agents in Chinatown that morning. Leon, after discovering her plan in a note left for him, rescues Mathilda, shooting two more of Stansfield's men in the process. An enraged Stansfield confronts Tony, who is violently interrogated for Leon's whereabouts."],
              "time": 110,
              "casting": ["Jean Reno","Natalie Portman","Gary Oldman","Danny Aiello"],
              "budget": 16,
              "boxoffice": 46.1
          },
          {
              "id": 39,
              "link": "juno",
              "movie": "Juno",
              "poster": "/static/posters/0000000039.jpg",
              "director": "Jason Reitman",
              "producer": "Lianne Halfon",
              "genre": "Comedy",
              "genreLink":"comedy",
              "year": 2007,
              "plot": ["Sixteen-year-old Minnesota high-schooler Juno MacGuff discovers she is pregnant by her friend and longtime admirer, Paulie Bleeker. She initially considers an abortion. Going to a local clinic run by a women's group, she encounters a schoolmate outside who is holding a one-person protest for pro-life vigil. Once inside, however, a variety of factors lead Juno to leave. She decides to give the baby up for adoption instead. With the help of her friend Leah, Juno searches the ads in the Pennysaver and finds a couple she feels will provide a suitable home. She tells her father, Mac, and stepmother, Bren, who offer their support. With Mac, Juno meets the couple, Mark and Vanessa Loring, in their expensive home and agrees to a closed adoption.","Juno visits Mark a few times, with whom she shares tastes in punk rock and horror films. Mark, who has set aside his rock band youth (now confined to memorabilia displayed in the one room of the house that Vanessa has designated for Mark's personal belongings), works at home composing commercial jingles. Juno and Leah happen to see Vanessa in a shopping mall being completely at ease with a child, and Juno encourages Vanessa to talk to her baby in the womb, where it kicks for her.","As the pregnancy progresses, Juno struggles with the emotions she feels for the baby's father, Paulie, who is clearly in love with Juno. Juno maintains an outwardly indifferent attitude toward him, but when she learns he has asked another girl to the upcoming prom, she angrily confronts him. Paulie reminds Juno that it is at her request they remain distant and tells her she broke his heart.","Not long before her baby is due, Juno is again visiting Mark when their interaction becomes emotional. Mark then tells her he will be leaving Vanessa to figure his life out. Juno is horrified by this revelation, with Mark asking Juno \"How do you think of me?\", revealing he is starting to develop feelings for her. Vanessa arrives home, and Mark tells her he does not feel ready to be a father and there are still things he wants to do first. Juno watches the Loring marriage fall apart, then drives away and breaks down in tears by the side of the road. Returning to the Lorings' home, she leaves a note and disappears as they answer the door.","After a heartfelt discussion with her father, Juno accepts that she loves Paulie. Juno then tells Paulie she loves him, and Paulie's actions make it clear her feelings are very much reciprocated. Not long after, Juno goes into labor and is rushed to the hospital, where she gives birth to a baby boy. She had deliberately not told Paulie because of his track meet. Seeing her missing from the stands, Paulie rushes to the hospital, finds Juno has given birth to their son, and comforts Juno as she cries."],
              "time": 96,
              "casting": ["Ellen Page","Michael Cera","Jennifer Garner","Jason Bateman"],
              "budget": 6.5,
              "boxoffice": 231.4
          },
          {
              "id": 9,
              "link": "meninblack",
              "movie": "Men In Black",
              "poster": "/static/posters/0000000009.jpg",
              "director": "Barry Sonnenfeld",
              "producer": "Walter F. Parkes",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 1997,
              "plot": ["After a government agency makes first contact with aliens in 1961, alien refugees begin living in secret on Earth, mostly disguised as humans in the New York metropolitan area. A secret agency known as the Men in Black (MIB) polices these aliens, protects Earth from intergalactic threats and uses memory-erasing neuralyzers to keep alien activity a secret. Agents have their former identities erased, and retired agents are neuralyzed and given new identities. After an operation to arrest an alien criminal near the Mexican border by Agents K and D, D decides that he is too old for his job. K neuralyzes him and begins looking for a new partner.","New York Police Department officer James Darrell Edwards III pursues a supernaturally fast and agile suspect into the Solomon R. Guggenheim Museum, but is unable to stop him from leaping off the roof to his death. K interviews Edwards about his encounter, then neuralyzes him and leaves him a business card with an address. The next day, Edwards and several other candidates visit the address and undergo a series of tests, for which he finds unusual solutions. While the others are neuralyzed, K explains the history of MIB to Edwards and offers him a position within the agency. After much thought, Edwards accepts and gives up his civilian identity to become Agent J.","In upstate New York, an alien illegally crash-lands on Earth and kills a farmer named Edgar to use his skin as a disguise. The alien goes into a Manhattan diner in search of something and kills two aliens disguised as humans eating lunch. After learning about Edgar's death in a tabloid magazine, J and K investigate the crash site and conclude that Edgar's skin was taken by a 'bug', a species of aggressive cockroach-like aliens. They visit a morgue to examine the bodies the bug killed and find a dying Arquillian alien within one, who tells them, 'To prevent war, the galaxy is on Orion's belt.' K fears that the death of this alien, who used the name Rosenberg and was a member of the Arquillian royal family, may start a war.","After finding that the bug has ransacked Rosenberg's jewelry shop without taking anything of value, J and K question Frank the Pug, an alien informant disguised as a dog. Frank explains that the missing galaxy is a massive energy source housed in a small jewel, and the bug wants to destroy the Arquillians with it. He also reveals that the galaxy is on Earth. J deduces that it is hanging on the collar of Rosenberg's cat Orion, which refuses to leave the body at the morgue. J and K arrive just as the bug takes the galaxy and kidnaps the coroner, Laurel Weaver. An Arquillian battleship fires a warning shot in the Arctic and threatens to destroy Earth unless the galaxy is returned within one hour.","The bug arrives at the observation towers of the 1964-1965 New York World's Fair New York State Pavilion at Flushing Meadows, which disguise two flying saucers from the 1961 landing, where Laurel escapes its clutches. It escapes on one saucer, but J and K shoot it down and the ship crashes into the Unisphere. The bug sheds Edgar's skin and swallows both agents' guns, and K provokes it into swallowing him as well. The bug tries to escape on the other ship, but J slows it down by taunting it and crushing cockroaches, angering it. K blows the bug apart from the inside, having found his gun inside its stomach. J and K recover the galaxy, and Laurel destroys the remains of the bug with J's gun before it can ambush them. K tells J that he has been training J as a replacement rather than a partner and has J neuralyze him so he can retire from MIB.","Some time later, J reads about K's return to civilian life at a newsstand before he and Laurel (now MIB Agent L, his new partner) continue on to their next mission. After an extensive zoom out shot, it is revealed that the Milky Way itself exists within a marble (much like the galaxy), and is being used by a pair of colossal extra-terrestrial beings in a game of marbles."],
              "time": 98,
              "casting": ["Tommy Lee Jones","Will Smith","Linda Fiorentino","Vincent D'Onofrio"],
              "budget": 75,
              "boxoffice": 817.4
          },
          {
              "id": 47,
              "link": "milliondollarbaby",
              "movie": "Million Dollar Baby",
              "poster": "/static/posters/0000000047.jpg",
              "director": "Clint Eastwood",
              "producer": "Clint Eastwood",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2004,
              "plot": ["Margaret \"Maggie\" Fitzgerald (Hillary Swank), a waitress from a Missouri town in the Ozarks, shows up in the Hit Pit, a run-down Los Angeles gym owned and operated by Frankie Dunn (Clint Eastwood), an old, cantankerous boxing trainer. Maggie asks Frankie to train her, but he initially refuses. Maggie works out tirelessly each day in his gym, even after Frankie tells her she's \"too old\" to begin a boxing career at her age. Eddie \"Scrap-Iron\" Dupris (Morgan Freeman), Frankie's friend and employee and the film's narrator—encourages and helps her.","Frankie's prize prospect, \"Big\" Willie Little, signs with successful manager Mickey Mack after becoming impatient with Frankie rejecting offers for a championship bout. With prodding from Scrap and impressed with her persistence, Frankie reluctantly agrees to train Maggie. He warns her that he will teach her only the basics and then find her a manager. Other than Maggie and his employees, the only person Frankie has contact with is a local priest, with whom he spars verbally at daily Mass.","Before her first fight, Frankie leaves Maggie with a random manager in his gym, much to her dismay; upon being told by Scrap that said manager deliberately put her up against his best girl (coaching the novice to lose) to give her an easy win, Frankie rejoins Maggie in the middle of the bout and coaches her instead to an unforeseen victory. A natural, she fights her way up in the women's amateur boxing division with Frankie's coaching, winning many of her lightweight bouts with first-round knockouts. Earning a reputation for her KOs, Frankie must resort to bribery to get other managers to put their trainee fighters up against her.","Eventually, Frankie takes a risk by putting her in the junior welterweight class, where her nose is broken in her first match. Frankie comes to establish a paternal bond with Maggie, who substitutes for his estranged daughter. Scrap, concerned when Frankie rejects several offers for big fights, arranges a meeting for her with Mickey Mack at a diner on her 33rd birthday. Out of loyalty, she declines. Frankie begrudgingly accepts a fight for her against a top-ranked opponent in the UK, where he bestows a Gaelic nickname on her. The two travel to Europe as she continues to win; Maggie eventually saves up enough of her winnings to buy her mother a house, but her mother berates Maggie for endangering her government aid, claiming that everyone back home is laughing at her.","Frankie is finally willing to arrange a title fight. He secures Maggie a $1 million match in Las Vegas, Nevada against the WBA women's welterweight champion, Billie \"The Blue Bear\" Osterman, a German ex-prostitute who has a reputation as a dirty fighter. Overcoming a shaky start, Maggie begins to dominate the fight, but after a round has ended, Billie knocks her out with an illegal sucker punch from behind after the bell has sounded to indicate the end of the round. Before Frankie can pull the corner stool out of the way which was inappropriately placed on its side by Frankie's assistant, Maggie lands hard on it, breaking her neck and leaving her a ventilator-dependent quadriplegic."],
              "time": 132,
              "casting": ["Clint Eastwood","Hilary Swank","Morgan Freeman"],
              "budget": 30,
              "boxoffice": 216.8
          },
          {
              "id": 23,
              "link": "missionimpossible2",
              "movie": "Mission: Impossible 2",
              "poster": "/static/posters/0000000023.jpg",
              "director": "John Woo",
              "producer": "Tom Cruise",
              "genre": "Action",
              "genreLink":"action",
              "year": 1998,
              "plot": ["An elderly veteran visits the Normandy American Cemetery and Memorial with his family. At a tombstone, he falls to his knees with emotion. The scene then shifts to the morning of June 6, 1944, as American soldiers land on Omaha Beach as part of the Normandy Invasion. They suffer heavy losses in assaulting fortified German defensive positions. Captain Miller of the 2nd Ranger Battalion leads a breakout from the beach. Elsewhere on the beach, a dead soldier lies face-down in the bloody surf; his pack is stenciled Ryan, S.","In Washington, D.C., at the U.S. War Department, General George Marshall learns that three of the four sons of the Ryan family were killed in action and that the fourth son, James, is with the 101st Airborne Division somewhere in Normandy. After reading Abraham Lincoln's Bixby letter aloud, Marshall orders Ryan brought home.","Three days after D-Day, Miller receives orders to find Ryan and bring him back. He chooses six men from his company—T/Sgt. Horvath, Privates First Class Reiben and Caparzo, Privates Mellish and Jackson, medic Wade—plus T/5 Upham, an interpreter from headquarters. They move out to Neuville, where they meet a squad of the 101st engaged against the enemy. Caparzo is killed by a German sniper who is then killed by Jackson. They locate a Private James Ryan but he is not the right one. From passing soldiers, Miller learns that Ryan is defending an important bridge in Ramelle.","Near Ramelle, Miller decides to neutralize a German machine gun position at a derelict radar station, despite his men's misgivings. Wade is killed in the skirmish. At Upham's urging, Miller declines to execute a surviving German soldier, and sets him free. Losing confidence in Miller's leadership, Reiben declares his intention to desert, prompting a confrontation with Horvath, which Miller defuses by disclosing his civilian career as a high school English teacher, about which his men had set up a betting pool. Reiben stays.","At Ramelle, Ryan is among a small group of paratroopers preparing to defend the key bridge. Miller tells Ryan that his brothers are dead, and that he was ordered to bring him home. Ryan is distressed about his brothers, but he will not leave the fight. Miller combines his unit with the paratroopers in defense of the bridge against the imminent German attack. Miller prepares to ambush the enemy with various .30 caliber guns, Molotov cocktails, detonation cords, anti-tank mines and impromptu satchel charges made from socks."],
              "time": 123,
              "casting": ["Tom Cruise","Dougray Scott","Thandie Newton","Richard Roxburgh"],
              "budget": 126,
              "boxoffice": 546.4
          },
          {
              "id": 37,
              "link": "nocountryforoldmen",
              "movie": "No Country for Old Men",
              "poster": "/static/posters/0000000037.jpg",
              "director": "Joel Coen",
              "producer": "Scott Rudin",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 2007,
              "plot": ["In Texas, 1980, hitman Anton Chigurh strangles a deputy sheriff to escape custody and uses a captive bolt pistol to kill a driver and steal his car. He spares the life of a gas station owner who accepts a challenge and successfully guesses the result of Chigurh's coin flip.","Hunting pronghorns in the desert, Llewelyn Moss comes across the aftermath of a drug deal gone bad. He finds several dead men and dogs, a wounded Mexican man begging for water, and two million dollars in a briefcase. He takes the money and returns home. That night, Moss returns to the scene with water. He is pursued by two men in a truck and escapes. At home, he sends his wife, Carla Jean, to stay with her mother, then drives to a motel in Del Rio, where he hides the case in his room’s air conditioning duct.","Chigurh, hired to recover the money, arrives to search Moss's home, where he uses his bolt pistol to blow the lock out of the door. Investigating the break in, Terrell County Sheriff Ed Tom Bell observes the blown-out lock. Following an electronic tracking device hidden in the money, Chigurh goes to Moss's motel room and kills a group of Mexicans who are waiting to ambush Moss. Moss has rented a second room adjacent to the Mexicans' room with access to the duct where the money is hidden. He retrieves the briefcase just before Chigurh opens the duct and finds it empty.","Moving to a hotel in the border town of Eagle Pass, Moss discovers the tracking device, but Chigurh has already found him. Their firefight spills onto the streets, killing a civilian, and both are wounded. Moss flees across to Mexico, stashing the case of money in weeds along the Rio Grande. Finding Moss severely injured, a passing norteño band takes him to a hospital. Carson Wells, another hired operative, fails to persuade Moss to accept protection in return for the money. Chigurh cleans and stitches his own wounds with stolen supplies and sneaks up on Wells at his hotel. After Wells unsuccessfully attempts to barter for his life, Chigurh kills him in his hotel room. Moss telephones the room and Chigurh answers, and promises to also kill Carla Jean unless Moss freely gives up the money.","Moss retrieves the case from the bank of the Rio Grande and arranges to meet Carla Jean at a motel in El Paso, where he plans to give her the money and hide her from danger. Carla Jean is approached by Sheriff Bell, who promises to protect Moss. Carla Jean's mother unwittingly reveals Moss' location to a group of Mexicans who had been tailing them. Bell reaches the motel rendezvous at El Paso, only to hear gunshots and spot a pickup truck speeding from the motel. As Bell enters the parking lot, he sees Moss lying dead. When Carla Jean arrives, she chokes up upon finding out her husband is dead.","That night, Bell returns to the crime scene and finds the lock blown out. Chigurh hides behind the door after retrieving the money. Bell enters Moss's room and sees that the vent has been removed. Later, Bell visits his uncle Ellis, an ex-lawman, and tells him he plans to retire because he feels \"over-matched\". Ellis clarifies that the region has always been violent."],
              "time": 122,
              "casting": ["Tommy Lee Jones","Javier Bardem","Josh Brolin"],
              "budget": 25,
              "boxoffice": 171.6
          },
          {
              "id": 41,
              "link": "panslabyrinth",
              "movie": "Pan's Labyrinth",
              "poster": "/static/posters/0000000041.jpg",
              "director": "Guillermo del Toro",
              "producer": "Guillermo del Toro",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2006,
              "plot": ["In a fairy tale, Princess Moanna, whose father is the king of the underworld, visits the human world, where the sunlight blinds her and erases her memory. She becomes mortal and dies. The king believes that eventually, her spirit will return to the underworld, so he builds labyrinths (which act as portals) around the world in preparation for her return.","In 1944 Francoist Spain, protagonist Ofelia travels with her pregnant but sickly mother Carmen to meet Captain Vidal, her new stepfather. Vidal, the son of a famed commander who died in Morocco, believes strongly in Falangism and has been assigned to hunt down republican rebels.","A large stick insect, which Ofelia believes to be a fairy, leads Ofelia into an ancient stone labyrinth, but she is stopped by Vidal's housekeeper Mercedes, who is secretly supporting her brother Pedro and other rebels. That night, the insect appears in Ofelia's bedroom, where it transforms to a fairy and leads her through the labyrinth. There, she meets the faun, who believes she is the reincarnation of Princess Moanna. He gives her three tasks to complete in order for her to acquire immortality and return to her kingdom. Meanwhile, Vidal murders two local farmers detained (erroneously) on suspicion of helping the rebels.","Ofelia completes the first task — retrieving a key from the belly of a giant toad — but becomes worried about her mother, whose condition is worsening. The faun gives Ofelia a mandrake root, which seems to ease Carmen's illness. Accompanied by three fairy guides, Ofelia then completes the second task—retrieving a dagger from the lair of the Pale Man, a child-eating monster. Although she was warned not to consume anything there, she eats two grapes, awakening the Pale Man. He eats two of the fairies and chases Ofelia, but she manages to escape. Infuriated at her disobedience, the faun refuses to give Ofelia the third task.","Vidal interrogates and tortures a captive rebel. He asks Doctor Ferreiro to tend to the captive, whom Ferreiro euthanizes instead. Vidal realizes that Ferreiro is a rebel collaborator and kills him. Simultaneously, Vidal catches Ofelia tending to the mandrake root, which he considers delusional. Carmen agrees and throws the root into the fire. She immediately develops painful contractions and dies giving birth to a son.","Vidal discovers that Mercedes is also a spy. Mercedes and Ofelia secretly leave but are caught. Ofelia, mistaken as a traitor, is locked in her bedroom, while Mercedes is taken to be interrogated and tortured. Mercedes frees herself, stabs Vidal, and rejoins the rebels. The faun returns to Ofelia to give her a chance for the third task and tells her to bring her baby brother into the labyrinth. Ofelia complies and Vidal pursues her as the rebels launch an attack on the outpost.","Ofelia meets the faun at the center of the labyrinth. The faun suggests drawing a few drops of the baby's blood, as completing the third task and opening the portal to the underworld requires the blood of an innocent. Ofelia refuses to harm her brother. Vidal finds Ofelia talking to the faun, whom he cannot see. The faun leaves, and Vidal takes the baby from Ofelia's arms before shooting her.","Vidal returns to the labyrinth's entrance, where he is met by the rebels. Knowing that he will be killed, he hands the baby to Mercedes, demanding that she tell his son the exact time of his father's death. Mercedes says that the child will not even know his father's name, and Pedro shoots and kills Vidal.","Mercedes enters the labyrinth and comforts a motionless but breathing Ofelia. Drops of Ofelia's blood fall down the center of the spiral stone staircase onto an altar. Ofelia, well dressed and uninjured, then appears in a golden throne room. The king of the underworld says that she passed the real final test, which was to choose to spill her own blood rather than that of an innocent. The faun praises Ofelia for her choice, and addresses her as \"Her Majesty\". The queen of the underworld, her mother, invites Ofelia/Moanna to sit next to her father, and rule at his side. Back in the stone labyrinth (in the real world), Ofelia smiles as she passes."],
              "time": 119,
              "casting": ["Sergi López","Maribel Verdú","Ivana Baquero","Doug Jones"],
              "budget": 19,
              "boxoffice": 83.3
          },
          {
              "id": 34,
              "link": "quantumofsolace",
              "movie": "Quantum of Solace",
              "poster": "/static/posters/0000000034.jpg",
              "director": "Marc Forster",
              "producer": "Michael G. Wilson",
              "genre": "Action",
              "genreLink":"action",
              "year": 2008,
              "plot": ["James Bond is driving from Lake Garda to Siena, Italy, with the captured Mr. White (Jesper Christensen) in the boot of his car. After evading pursuers, Bond delivers White to M, who interrogates him regarding his organisation, Quantum. M's bodyguard, Craig Mitchell (Glenn Foster), is a double agent; he attacks M, enabling White to escape. Bond chases Mitchell and kills him. Bond and M return to London and search Mitchell's flat, discovering Mitchell had a contact in Haiti, Edmund Slate (Neil Jackson). Bond learns Slate is a hitman sent to kill Camille Montes (Olga Kurylenko) at the behest of her lover, environmentalist entrepreneur Dominic Greene (Mathieu Amalric). Observing her subsequent meeting with Greene, Bond learns Greene is helping exiled Bolivian General Medrano (Joaquín Cosío), who murdered Camille's family, to overthrow his government and become the new president, in exchange for a seemingly barren piece of desert.","After rescuing Camille from Medrano, Bond follows Greene to a performance of Tosca in Bregenz, Austria. Meanwhile, the head of the CIA's South American section, Gregg Beam (David Harbour), strikes a noninterference deal with Greene for access to putative stocks of Bolivian oil. Bond infiltrates Quantum's meeting at the opera, identifying members of Quantum's executive board, and a gunfight ensues. A Special Branch bodyguard working for Quantum member Guy Haines (Paul Ritter), is killed by one of Greene's men after Bond throws him off a roof. M assumes Bond killed him, and has Bond's passports and credit cards revoked. Bond heads to Italy and convinces his old ally René Mathis (Giancarlo Giannini) to accompany him to Bolivia. They are greeted by Strawberry Fields (Gemma Arterton), a consular employee who demands Bond return to the UK immediately. Bond seduces her and they attend a fundraising party Greene holds that night. At the party, Bond again rescues Camille from Greene. Leaving, Bond and Camille are pulled over by Bolivian police working for Medrano. They had earlier attacked Mathis and put him in the boot of Bond's car to frame Bond. In the ensuing struggle, Mathis and the cops are killed.","The following day, Bond and Camille survey Quantum's intended land acquisition by air; their plane is shot down by a Bolivian fighter aircraft. They skydive into a sinkhole, and discover Quantum is damming Bolivia's supply of fresh water to create a monopoly. Back in La Paz, Bond meets M and learns Quantum killed Fields by drowning her in crude oil. Bond meets CIA Agent Felix Leiter (Jeffrey Wright), who discloses Greene and Medrano will meet in the Atacama Desert to finalise their agreement. Warned by Leiter, he evades the CIA's Special Activities Division when they attempt to kill him.","At an eco hotel in the desert, Greene tells Medrano that now he controls the majority of Bolivia's water supply, Medrano must accept a new contract that makes Greene Planet Bolivia's sole water utility company at significantly higher rates. Bond infiltrates the complex, kills the chief of police (Fernando Guillén Cuervo) for betraying Mathis, and single-handedly assaults the hotel. After killing the security detail, he confronts Greene. Meanwhile, Camille kills Medrano, avenging the murders of her family. The struggle leaves the hotel destroyed by fire. Bond captures Greene and interrogates him about Quantum, leaving him stranded in the desert with only a can of engine oil, wondering if Greene will get thirsty enough to drink it.","Bond travels to Kazan, Russia, where he finds Vesper Lynd's former lover, Yusef Kabira (Simon Kassianides), a member of Quantum who seduces women with valuable connections, and who is indirectly responsible for her death. Bond tells Kabira's latest target, Corrine Veneau (Stana Katic), a Canadian Intelligence agent, of Kabira's true intentions, thus sparing her Vesper's fate. He allows MI6 to arrest Kabira. Outside, M tells Bond that Greene was found dead in the middle of the desert, shot twice and with engine oil in his stomach. M tells Bond she needs him back; he responds that he never left. Walking away, he drops Vesper's necklace in the snow."],
              "time": 106,
              "casting": ["Tom Cruise","Dougray Scott","Thandie Newton","Richard Roxburgh"],
              "budget": 200,
              "boxoffice": 256.1
          },
          {
              "id": 37,
              "link": "ratatouille ",
              "movie": "Ratatouille",
              "poster": "/static/posters/0000000037.jpg",
              "director": "Brad Bird",
              "producer": "Brad Lewis",
              "genre": "Action",
              "genreLink":"action",
              "year": 2007,
              "plot": ["Remy is an idealistic and ambitious young rat, gifted with highly developed senses of taste and smell. Inspired by his idol, the recently deceased chef Auguste Gusteau, Remy dreams of becoming a cook himself. When an old French woman discovers Remy's colony in her house and attempts to exterminate them with a shotgun, they are forced to flee, and Remy becomes separated from his family in the panic. He ends up in the sewers of Paris and eventually finds himself at a skylight overlooking the kitchen of Gusteau's restaurant.","As Remy watches through the window, a young man named Alfredo Linguini is hired as a garbage boy by Skinner, the restaurant's current owner and Gusteau's former sous-chef. When Linguini spills a pot of soup and attempts to recreate it, Remy sees that he is ruining it, and fixes his mistakes. Linguini catches Remy, but hides him when he is then confronted by Skinner for tampering with the soup. As the two argue, the soup is accidentally served and proves to be a success. The staff convinces Skinner to retain Linguini, who is assumed to be the soup's creator. When Skinner catches Remy attempting to escape, he orders Linguini to kill the rat, but Linguini discovers Remy's intelligence and decides to keep him instead.","Remy discovers that he can control Linguini's movements by pulling his hair.","On Linguini's first day as a chef, he and Remy find a way to communicate: Remy guides Linguini like a marionette by pulling on his hair while hidden under Linguini's toque. Skinner assigns Colette Tatou, the staff's only female chef, to train his new cook.","Suspicious, Skinner learns that Linguini is Gusteau's illegitimate son and the rightful owner of the restaurant. Remy discovers the evidence of Linguini's inheritance and, after eluding Skinner, gives it to Linguini, who deposes Skinner as owner. The restaurant continues to thrive, as all of Remy's recipes become immediate hits. A romance develops between Linguini and Colette, and Remy begins to feel left out. Remy finds that his clan has come to Paris as well, and is taken to their new lair, but his father Django's attempt to rid his son of his admiration for humans fails and Remy leaves.","France's top restaurant critic, Anton Ego, whose previous negative review cost Gusteau's one of its stars and caused Gusteau's death, announces he will dine at the restaurant the following evening. That night, Remy and Linguini have a heated argument. Remy leads his clan to raid the restaurant's pantries in retaliation, but Linguini catches them and drives them out. Having discovered Remy's skills, Skinner captures him in an attempt to use him to create a line of frozen foods. However, Remy is freed by Django and his brother Emile. He returns to the restaurant to find Linguini, who has been unable to cook without him. Linguini apologizes and reveals the truth to the staff, but they all leave in absolute disbelief. Colette later returns after recalling Gusteau's motto, \"Anyone can cook.\""],
              "time": 202,
              "casting": ["Patton Oswalt","Ian Holm","Lou Romano","Janeane Garofalo"],
              "budget": 150,
              "boxoffice": 620.7
          },
          {
              "id": 12,
              "link": "savingprivateryan",
              "movie": "Saving Private Ryan",
              "poster": "/static/posters/0000000012.jpg",
              "director": "Steven Spielberg",
              "producer": "Ian Bryce",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 1998,
              "plot": ["An elderly veteran visits the Normandy American Cemetery and Memorial with his family. At a tombstone, he falls to his knees with emotion. The scene then shifts to the morning of June 6, 1944, as American soldiers land on Omaha Beach as part of the Normandy Invasion. They suffer heavy losses in assaulting fortified German defensive positions. Captain Miller of the 2nd Ranger Battalion leads a breakout from the beach. Elsewhere on the beach, a dead soldier lies face-down in the bloody surf; his pack is stenciled Ryan, S.","In Washington, D.C., at the U.S. War Department, General George Marshall learns that three of the four sons of the Ryan family were killed in action and that the fourth son, James, is with the 101st Airborne Division somewhere in Normandy. After reading Abraham Lincoln's Bixby letter aloud, Marshall orders Ryan brought home.","Three days after D-Day, Miller receives orders to find Ryan and bring him back. He chooses six men from his company—T/Sgt. Horvath, Privates First Class Reiben and Caparzo, Privates Mellish and Jackson, medic Wade—plus T/5 Upham, an interpreter from headquarters. They move out to Neuville, where they meet a squad of the 101st engaged against the enemy. Caparzo is killed by a German sniper who is then killed by Jackson. They locate a Private James Ryan but he is not the right one. From passing soldiers, Miller learns that Ryan is defending an important bridge in Ramelle.","Near Ramelle, Miller decides to neutralize a German machine gun position at a derelict radar station, despite his men's misgivings. Wade is killed in the skirmish. At Upham's urging, Miller declines to execute a surviving German soldier, and sets him free. Losing confidence in Miller's leadership, Reiben declares his intention to desert, prompting a confrontation with Horvath, which Miller defuses by disclosing his civilian career as a high school English teacher, about which his men had set up a betting pool. Reiben stays.","At Ramelle, Ryan is among a small group of paratroopers preparing to defend the key bridge. Miller tells Ryan that his brothers are dead, and that he was ordered to bring him home. Ryan is distressed about his brothers, but he will not leave the fight. Miller combines his unit with the paratroopers in defense of the bridge against the imminent German attack. Miller prepares to ambush the enemy with various .30 caliber guns, Molotov cocktails, detonation cords, anti-tank mines and impromptu satchel charges made from socks."],
              "time": 98,
              "casting": ["Tom Hanks","Edward Burns","Matt Damon","Tom Sizemore"],
              "budget": 75,
              "boxoffice": 817.4
          },
          {
              "id": 6,
              "link": "seven",
              "movie": "Seven",
              "poster": "/static/posters/0000000006.jpg",
              "director": "Bryan Singer",
              "producer": "Kenneth Kokin",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 1995,
              "plot": ["Soon-to-retire detective William Somerset is partnered with short-tempered but idealistic David Mills, who has recently moved to the city with his wife Tracy. Tracy confides to Somerset that she is pregnant and has yet to tell Mills, as she is unhappy with the city and feels it is no place to raise a child. Somerset sympathizes, having had a similar situation with his ex-girlfriend many years earlier, and advises her to tell Mills only if she plans to keep the child.","Somerset and Mills investigate a set of murders inspired by the seven deadly sins: a man forced to eat until his stomach ruptured, representing gluttony, and a defense attorney killed after a pound of flesh was taken from him, representing greed. Clues at the murder scenes lead them to a suspect's apartment, where they find a third victim, a drug dealer and child molester, strapped to a bed, emaciated but alive, representing sloth. Daily photographs of the victim, taken over a year, show the crimes were planned far in advance.","The detectives use library records to identify a John Doe and track him to his apartment. Doe flees and Mills gives chase. Doe turns to hold Mills at gunpoint for a moment before escaping. The apartment contains hundreds of notebooks revealing Doe's psychopathy, as well as a clue to another murder. The detectives arrive too late to stop a man forced to kill a prostitute by raping her with a custom-made, bladed strap-on, representing lust. The following day, they attend the scene of a fifth murder, a model whose face has been mutilated by Doe; she was given the option to call for help and live disfigured, or commit suicide by taking pills, representing pride.","As Somerset and Mills return to the police station, Doe turns himself in, covered in the blood of an unidentified victim. Doe offers to take the detectives to the final two victims and confess to the murders, but only under specific terms, or he will plead insanity. Somerset is wary, but Mills agrees.","The detectives follow Doe's directions to a remote desert location. Within minutes, a delivery van approaches. Mills holds Doe at gunpoint while Somerset intercepts the driver, who has been instructed to bring a box to them. Doe begins to taunt Mills by telling him how envious he was of his life with Tracy. Somerset opens the box and, in a sudden panic, warns Mills to stay back. Doe then says that his sin was envy, and that Tracy died as a result of this; he also states that her head is in the box, and that she was pregnant. Despite Somerset's warnings, Mills shoots Doe, representing wrath, and completing Doe's plan. Police converge and take the devastated Mills away."],
              "time": 127,
              "casting": ["Brad Pitt","Morgan Freeman","Gwyneth Paltrow","John C. McGinley"],
              "budget": 33,
              "boxoffice": 327.3
          },
          {
              "id": 44,
              "link": "sincity",
              "movie": "Sin City",
              "poster": "/static/posters/0000000044.jpg",
              "director": "Frank Miller",
              "producer": "Elizabeth Avellán",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 2005,
              "plot": ["The Salesman walks onto a penthouse balcony where The Customer looks out over Basin City. He offers her a cigarette and says that she looks like someone who is tired of running and that he will save her. The two share a kiss and he shoots her; she dies in his arms. He says he will never know what she was running from but that he will cash her check in the morning, implying someone had paid him to kill her.","On the docks of Sin City, aging police officer John Hartigan tries to stop serial child-killer Roark Junior from raping and killing his fourth known victim, eleven-year-old Nancy Callahan. Junior is the son of Senator Roark, who has bribed the police to cover up his son's crimes. When Hartigan's corrupt partner, Bob, tries to convince Hartigan to walk away, Hartigan knocks him out.","Hartigan, experiencing pain from a bad heart, heads into the warehouse where Roark Junior and several henchmen are holding Nancy. Junior shoots Hartigan in the shoulder and tries to escape. Hartigan catches up and shoots off Junior's ear, hand and genitals. Bob, now recovered, shoots Hartigan in the back. As the sirens approach, Bob leaves and Nancy lies down in Hartigan's lap. Hartigan passes out, reasoning his death is a fair trade for the girl's life.","After a one-night stand, Marv awakens to find Goldie has been killed while he slept. He flees the frame-up as the police arrive, vowing to avenge her death. His parole officer, Lucille, warns him to give up on this mission, believing Marv may have imagined it all due to his \"condition\". Marv interrogates several informants, working up to a corrupt priest, who reveals that the Roark family was behind the murder. Marv kills the priest but is then attacked by a woman who looks like Goldie, which he dismisses as a hallucination.","Marv goes to the Roark family farm and is subdued by the silent stalker who killed Goldie. He awakens in the basement to find Lucille has been captured after looking into his story. She tells Marv that the killer is a cannibal and that Goldie was a prostitute. He learns that the killer's name is Kevin and escapes. Lucille is killed by the leader of a squad of corrupt cops. Marv kills the cops except for their leader, whom he interrogates. He learns that Cardinal Patrick Henry Roark arranged for Goldie's murder.","Marv goes to Old Town, Sin City's prostitute-run red-light district, to learn more about Goldie and is captured by her twin sister, Wendy, the attacker Marv previously dismissed as a hallucination. Once he convinces Wendy that he is not the killer, the two return to the farm where Marv kills Kevin. He confronts Cardinal Roark, who confesses his part in the murders. Kevin was the cardinal's ward; the two men ate the prostitutes to \"consume their souls\". Marv kills the cardinal but is then shot and captured by his guards.","Marv is taken to a hospital where cops threaten to kill his mother, to get him to confess to killing Roark, Kevin and their victims. He is sentenced to death in the electric chair. Wendy visits him on death row and thanks him for avenging her sister. Marv is then executed."],
              "time": 124,
              "casting": ["Jessica Alba","Benicio del Toro","Brittany Murphy","Clive Owen"],
              "budget": 40,
              "boxoffice": 158.8
          },
          {
              "id": 33,
              "link": "slumdogmillionaire",
              "movie": "Slumdog Millionaire",
              "poster": "/static/posters/0000000033.jpg",
              "director": "Danny Boyle",
              "producer": "Christian Colson",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2008,
              "plot": ["18-year-old Jamal Malik, an Indian Muslim from the Dharavi slum, is a contestant on the Indian version of Who Wants to Be a Millionaire?, and is one question away from the grand prize. However, before the ₹20 million (US$280,000) question, he is detained and tortured by the police, who suspect him of cheating because of the impossibility of a simple \"slumdog\" with very little education knowing all the answers. Jamal recounts, through flashbacks, the incidents in his life which provided him with each answer.","Jamal's flashbacks begin with his managing, at age five, to obtain the autograph of Bollywood star Amitabh Bachchan, where he had to jump into a toilet cesspit when his brother Salim blocked the door, who later sells the autograph, followed immediately by the death of his mother during the Bombay riots. As they flee the riot, the brothers meet Latika, a girl from their slum. Salim is reluctant to take her in, but Jamal suggests that she could be the \"third musketeer\", a character from the Alexandre Dumas novel The Three Musketeers (which they had been studying—albeit not very diligently—in school), whose name they do not know.","The three are found by Maman—a gangster who tricks and then trains street children into becoming beggars. When Salim discovers Maman is blinding the children in order to make them more effective beggars, he flees with Jamal and Latika to a departing train. Latika fails to board the train as Salim purposefully lets go of her hand, in revenge for an extremely embarrassing prank that Latika had played on Salim. This resulted in her being recaptured by Maman. Over the next few years, Salim and Jamal make a living travelling on top of trains, selling goods, picking pockets, working as dish washers, and pretending to be tour guides at the Taj Mahal, where they also steal people's shoes. At Jamal's insistence, they return to Mumbai to find Latika, discovering that she is being raised by Maman to be a prostitute, soon to fetch him a high price as a virgin. The brothers rescue her, and while escaping Maman they shoot him to death. Salim then manages to get a job with Javed—Maman's rival crime lord. Back at their room, Salim orders Jamal to leave him and Latika alone. When Jamal refuses, Salim draws a gun on him, whereas Latika persuades Jamal to obey his brother and go away.","Years later, Jamal, now a Chaiwala in an Indian call centre, searches the centre's database for Salim and Latika. He fails in finding Latika, while succeeding in finding Salim, now a high-ranking lieutenant in Javed's crime organisation. Jamal reproaches Salim, who then pleads for forgiveness, and offers him to stay in his luxurious apartment. Jamal later bluffs his way into Javed's residence to reunite with Latika but as he professes his love for her, Latika asks him to forget about her. Jamal nevertheless promises to wait for her every day at five o'clock at the VT station. Latika attempts to meet him there, but is recaptured by Javed's men, led by Salim, and once Javed moves to another house, outside Mumbai, the two again lose contact. Jamal becomes a contestant on Who Wants to Be a Millionaire?, knowing that she watches the show regularly. Much to the consternation of Prem Kumar, the show's host, Jamal becomes a wonder across India. During a break before Jamal answers the penultimate question, Kumar tries to fool him by feeding him the wrong answer whilst in the men's room. After the break Jamal uses the 50/50 lifeline, leaving Kumar's answer and one other, but chooses the other one."],
              "time": 120,
              "casting": ["Dev Patel","Freida Pinto","Madhur Mittal","Anil Kapoor"],
              "budget": 15,
              "boxoffice": 377.9
          },
          {
              "id": 50,
              "link": "theaviator",
              "movie": "The Aviator",
              "poster": "/static/posters/0000000050.jpg",
              "director": "Martin Scorsese",
              "producer": "Michael Mann",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2004,
              "plot": ["18-year-old Jamal Malik, an Indian Muslim from the Dharavi slum, is a contestant on the Indian version of Who Wants to Be a Millionaire?, and is one question away from the grand prize. However, before the ₹20 million (US$280,000) question, he is detained and tortured by the police, who suspect him of cheating because of the impossibility of a simple \"slumdog\" with very little education knowing all the answers. Jamal recounts, through flashbacks, the incidents in his life which provided him with each answer.","Jamal's flashbacks begin with his managing, at age five, to obtain the autograph of Bollywood star Amitabh Bachchan, where he had to jump into a toilet cesspit when his brother Salim blocked the door, who later sells the autograph, followed immediately by the death of his mother during the Bombay riots. As they flee the riot, the brothers meet Latika, a girl from their slum. Salim is reluctant to take her in, but Jamal suggests that she could be the \"third musketeer\", a character from the Alexandre Dumas novel The Three Musketeers (which they had been studying—albeit not very diligently—in school), whose name they do not know.","The three are found by Maman—a gangster who tricks and then trains street children into becoming beggars. When Salim discovers Maman is blinding the children in order to make them more effective beggars, he flees with Jamal and Latika to a departing train. Latika fails to board the train as Salim purposefully lets go of her hand, in revenge for an extremely embarrassing prank that Latika had played on Salim. This resulted in her being recaptured by Maman. Over the next few years, Salim and Jamal make a living travelling on top of trains, selling goods, picking pockets, working as dish washers, and pretending to be tour guides at the Taj Mahal, where they also steal people's shoes. At Jamal's insistence, they return to Mumbai to find Latika, discovering that she is being raised by Maman to be a prostitute, soon to fetch him a high price as a virgin. The brothers rescue her, and while escaping Maman they shoot him to death. Salim then manages to get a job with Javed—Maman's rival crime lord. Back at their room, Salim orders Jamal to leave him and Latika alone. When Jamal refuses, Salim draws a gun on him, whereas Latika persuades Jamal to obey his brother and go away.","Years later, Jamal, now a Chaiwala in an Indian call centre, searches the centre's database for Salim and Latika. He fails in finding Latika, while succeeding in finding Salim, now a high-ranking lieutenant in Javed's crime organisation. Jamal reproaches Salim, who then pleads for forgiveness, and offers him to stay in his luxurious apartment. Jamal later bluffs his way into Javed's residence to reunite with Latika but as he professes his love for her, Latika asks him to forget about her. Jamal nevertheless promises to wait for her every day at five o'clock at the VT station. Latika attempts to meet him there, but is recaptured by Javed's men, led by Salim, and once Javed moves to another house, outside Mumbai, the two again lose contact. Jamal becomes a contestant on Who Wants to Be a Millionaire?, knowing that she watches the show regularly. Much to the consternation of Prem Kumar, the show's host, Jamal becomes a wonder across India. During a break before Jamal answers the penultimate question, Kumar tries to fool him by feeding him the wrong answer whilst in the men's room. After the break Jamal uses the 50/50 lifeline, leaving Kumar's answer and one other, but chooses the other one."],
              "time": 170,
              "casting": ["Leonardo DiCaprio","Cate Blanchett","Kate Beckinsale","John C. Reilly"],
              "budget": 110,
              "boxoffice": 213.7
          },
          {
              "id": 13,
              "link": "thebiglebowski",
              "movie": "The Big Lebowski",
              "poster": "/static/posters/0000000013.jpg",
              "director": "Joel Coen",
              "producer": "Ethan Coen",
              "genre": "Comedy",
              "genreLink":"comedy",
              "year": 1998,
              "plot": ["In 1991 Los Angeles, slacker Jeff 'the Dude' Lebowski is assaulted in his home by two hired goons who demand money that the wife of a Jeffrey Lebowski owes to a porn magnate and loan shark named Jackie Treehorn. The two soon realize they have attacked the wrong Jeffrey Lebowski and leave but not before one of them urinates on the Dude's rug.","The next day, the Dude explains this incident to his two friends and bowling partners: timid Donny and temperamental Vietnam veteran Walter Sobchak. Encouraged by Walter, the Dude pays a visit to the other Jeffrey Lebowski, the eponymous 'Big Lebowski', a cantankerous elderly wheelchair-bound millionaire, to seek compensation for his ruined rug. Although his request is promptly refused, the Dude craftily steals one of Lebowski's expensive rugs by telling Brandt, Lebowski's sycophantic assistant, that his boss told him to take any rug in the house. The Dude subsequently meets Bunny, Lebowski's young trophy wife.","Days later, Lebowski contacts the Dude stating that Bunny has been kidnapped. He wants the Dude to deliver a briefcase containing the million-dollar ransom and see if he can recognize the culprits. Later, a different pair of thugs appear in the Dude's apartment, knock him unconscious and take Lebowski's rug. When Bunny's kidnappers call to arrange delivery of the ransom, Walter instead gives the kidnappers a fake ransom, namely, a briefcase filled with dirty underwear. The kidnappers grab the fake ransom and leave. Later that night, the Dude's car is stolen with the actual ransom money briefcase still inside.","Jeffrey Lebowski's adult daughter Maude contacts the Dude and reveals that she took the rug, explaining that Bunny is one of Jackie Treehorn's porn stars. She reasons that Bunny 'kidnapped' herself and asks the Dude to recover the ransom which her father illegally withdrew from the family's foundation. Lebowski is angry that the Dude failed to deliver the ransom money and shows him a severed green-painted toe, allegedly belonging to Bunny and delivered by the kidnappers. Later, a gang of German nihilists invade the Dude's apartment and threaten him, identifying themselves as the kidnappers. Maude says the German nihilists are actually Bunny's friends.","The Dude's car is found by the police without the ransom money, and he reclaims it. Later, while cruising around in the car, the Dude finds the homework assignment of a high school student named Larry inside. Assuming that Larry was the one who stole the car, Walter and the Dude go to his house, believing Larry has also stolen the money. When Larry refuses to respond to Walter and the Dude's threats, Walter wrecks a new sports car parked outside which they assume Larry bought with the money. However, a neighbor rushes outside, reveals himself as having just bought the car and angrily wrecks the Dude's car in revenge, thinking it to be Walter's."],
              "time": 117,
              "casting": ["Jeff Bridges","John Goodman","Julianne Moore","Steve Buscemi","David Huddleston"],
              "budget": 15,
              "boxoffice": 46.2
          },
          {
              "id": 31,
              "link": "thedarkknight",
              "movie": "The Dark Knight",
              "poster": "/static/posters/0000000031.jpg",
              "director": "Christopher Nolan",
              "producer": "Emma Thomas",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 2008,
              "plot": ["A gang of criminals rob a Gotham City mob bank, murdering each other for a higher share of the money until only the Joker remains, who escapes with the money. Batman, District Attorney Harvey Dent and Lieutenant Jim Gordon form an alliance to rid Gotham City of organized crime. Bruce Wayne believes that with Dent as Gotham's protector, he can retire from being Batman and lead a normal life with Rachel Dawes – even though she and Dent are dating.","Mob bosses Sal Maroni, Gambol, and the Chechen hold a video-conference with their corrupt accountant, Lau, who has taken their funds for safekeeping and fled to Hong Kong. The Joker interrupts the meeting to warn them that Batman is unhindered by the law, and offers to kill him in exchange for half of their money. The mob bosses disagree, and a bounty is placed on the Joker by Gambol. The Joker finds and kills Gambol, taking over his gang. The mob ultimately decides to take the Joker up on his offer. Batman finds Lau in Hong Kong and brings him back to Gotham to testify, allowing Dent to apprehend the entire mob. The Joker threatens to keep killing people unless Batman reveals his identity, and starts by murdering Police Commissioner Gillian B. Loeb and the judge presiding over the mob trial. The Joker also tries to kill Mayor Anthony Garcia, but Gordon sacrifices himself to stop the assassination. Dent kidnaps one of Joker’s henchmen and learns that Rachel is the next target.","Bruce decides to reveal his secret identity to prevent more deaths. Before he can, however, Dent falsely announces that he is Batman. Dent is taken into protective custody, but the Joker appears and attacks the convoy. Batman comes to Dent's rescue and Gordon, who faked his death, apprehends the Joker, securing a promotion to Commissioner. Rachel and Dent are escorted away by detectives on Maroni's payroll; Gordon later learns that they never arrived home. Batman interrogates the Joker, who reveals that they have been trapped in separate locations rigged with explosives and that Batman must choose one to save. Batman races to save Rachel, while Gordon attempts to rescue Dent. Batman arrives at the building, but realizes that the Joker sent him to Dent's location instead. Both buildings explode, killing Rachel and disfiguring half of Dent's face. The Joker escapes with Lau, who leads him to the Mob's funds. The Joker burns the money before killing Lau and the Chechen.","Coleman Reese, an accountant at Wayne Enterprises, deduces that Bruce is Batman and threatens to publicize the information. Not wanting Reese's revelation to interfere with his plans, the Joker threatens to destroy a hospital unless Reese is killed within an hour. All hospitals are evacuated and Gordon travels to secure Reese. The Joker, disguised as a hospital nurse, discovers Dent's ward and hands him a gun, convincing him to seek revenge for Rachel's death. The Joker then destroys the hospital and escapes with a busload of hostages. Dent goes on a killing spree, deciding the fates of people he holds responsible for Rachel's death by flipping his lucky coin. Dent eventually apprehends Gordon's family, believing Gordon's love for his family parallels his love for Rachel.","After announcing that Gotham City will be subject to his rule by nightfall, the Joker rigs two evacuating ferries with explosives; one containing civilians and the other containing prisoners. The passengers have been supplied with a trigger to the other boat's explosives, and the Joker announces through an intercom that he will blow both ferries if one of them has not been destroyed by midnight. Batman finds the Joker by using a sonar device that spies on the entire city, with the reluctant help of Lucius Fox. Both the civilians and the prisoners refuse to kill each other, while Batman apprehends the Joker after a brief fight. Before the police arrive to take the Joker into custody, he gloats that Gotham's citizens will lose hope once Dent's rampage becomes public knowledge."],
              "time": 152,
              "casting": ["Christian Bale","Michael Caine","Heath Ledger","Gary Oldman","Aaron Eckhart"],
              "budget": 185,
              "boxoffice": 1005
          },
          {
              "id": 36,
              "link": "thecuriouscaseofbenjaminbutton",
              "movie": "The Curious Case of Benjamin Button",
              "poster": "/static/posters/0000000036.jpg",
              "director": "David Fincher",
              "producer": "Ceán Chaffin",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2008,
              "plot": ["In August 2005, elderly Daisy Fuller is on her deathbed in a New Orleans hospital as Hurricane Katrina approaches. She starts rambling to her daughter, Caroline, about a train station built in 1918 and Mr. Gateau, the best clockmaker in all of the South, who was hired to make a clock for it. Mr. Gateau was blind, and lost his son in World War I, which crushed him, but he continued to labor over his clock. When it was unveiled at the station, the public was surprised to see that the clock ran backwards, to which Mr. Gateau says he made it that way so that the boys they lost in the war could come back again and live their lives that were ended too soon. After that, Mr. Gateau was never seen again, and people speculated he died of a broken heart or went out to sea.","Daisy then asks Caroline to read aloud from the diary of Benjamin Button.","From the reading, it is revealed that on the evening of November 11, 1918, a boy was born with the appearance and physical maladies of an elderly man. The baby's mother died after giving birth, and the father, Thomas Button, abandons the infant on the porch of a nursing home. Queenie and Mr. \"Tizzy\" Weathers, workers at the nursing home, find the baby, and Queenie decides to care for him as her own.","Benjamin learns to walk in 1925, after which he uses crutches in place of a wheelchair. On Thanksgiving 1930, Benjamin meets seven-year-old Daisy, whose grandmother lives in the nursing home. He and Daisy become good friends. Later, he accepts work on a tugboat captained by Mike Clark. Benjamin also meets Thomas Button, who does not reveal that he is Benjamin's father. In Autumn 1936, Benjamin leaves New Orleans for a long-term work engagement with the tugboat crew; Daisy later is accepted into a dance company in New York City under choreographer George Balanchine.","In 1941, Benjamin is in Murmansk, where he begins having an affair with Elizabeth Abbott, wife of the British Trade Minister. That December, Japan attacks Pearl Harbor, thrusting the United States into World War II. Mike volunteers the boat for the U.S. Navy; the crew is assigned to salvage duties. During a patrol, the tugboat finds a sunken U.S. transport and the bodies of many American troops. A German submarine surfaces; Mike steers the tugboat full speed towards it while a German gunner fires on the tugboat, killing most of the crew, including Mike. The tugboat rams the submarine, causing it to explode, sinking both vessels. Benjamin and another crewman are rescued by U.S. Navy ships the next day.","In May 1945, Benjamin returns to New Orleans and reunites with Queenie. A few weeks later, he reunites with Daisy; they go out for dinner. Upon failing to seduce him afterward, she departs. Benjamin later reunites with Thomas Button, who, terminally ill, reveals he is Benjamin's father and wills Benjamin his button company and his estate.","In 1947, Benjamin visits Daisy in New York unannounced but departs upon seeing that she has fallen in love with someone else. In 1954, Daisy's dancing career ends when her leg is crushed in an automobile accident in Paris. When Benjamin visits her, Daisy is amazed by his youthful appearance, but, frustrated by her injuries, she tells him to stay out of her life.","In 1962, Daisy returns to New Orleans and reunites with Benjamin. Now of comparable physical age, they fall in love and go sailing together. They return to learn that Queenie has died, then move in together. In 1967, Daisy, who has opened a ballet studio, tells Benjamin that she is pregnant; she gives birth to a girl, Caroline, in the spring of 1968. Believing he cannot be a proper father to his daughter due to his reverse aging, Benjamin departs after selling his belongings, leaving a bank account book holding the proceeds behind for Daisy and Caroline; he travels alone during the 1970s.","Benjamin returns to Daisy in 1980. Now married, Daisy introduces him, as a family friend, to her husband and daughter. Daisy admits that he was right to leave; she could not have coped otherwise. She later visits Benjamin at his hotel, where they again share their passion for each other, then part once more."],
              "time": 166,
              "casting": ["Brad Pitt","Cate Blanchett","Taraji P. Henson","Julia Ormond","Jason Flemyng"],
              "budget": 167,
              "boxoffice": 334
          },
          {
              "id": 40,
              "link": "thedeparted",
              "movie": "The Departed",
              "poster": "/static/posters/0000000040.jpg",
              "director": "Martin Scorsese",
              "producer": "Brad Pitt",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 2006,
              "plot": ["As a child, Colin Sullivan is introduced to organized crime by Irish-American mobster Frank Costello in the Irish neighborhood of South Boston. Over the years, Costello grooms him to become a mole inside the Massachusetts State Police. Sullivan is accepted into the Special Investigations Unit, which focuses on organized crime.","Before graduating from the state police academy, Billy Costigan is recruited by Captain Queenan and Staff Sergeant Dignam to go undercover, as his family ties to organized crime make him a perfect infiltrator. He drops out of the academy and does time in prison on a fake assault charge to increase his credibility.","Each man infiltrates his respective target organization. Sullivan begins a romance with police psychiatrist Madolyn Madden. Costigan sees her as a condition of his probation, and they begin a relationship, too. After Costello escapes a sting operation, each mole becomes aware of the other's existence. Sullivan is told to find the \"rat\" and asks Costello for information to identify the informer.","Costigan follows Costello into a porn theater, where Costello gives Sullivan an envelope containing personal information on his crew members. Costigan chases Sullivan through Chinatown. When it is over, neither man knows the other's identity. Sullivan has Queenan tailed to a meeting with Costigan on the roof of a building. Queenan orders Costigan to flee while he confronts Costello's men alone. The men throw Queenan off the building to his death. When they exit, Costigan pretends he has come to join them. Television news reveals that crew member Delahunt has been an undercover cop, working for the Boston Police Department. Dignam resigns rather than work with Sullivan. Dignam suspects Sullivan is the mole after Dignam asks Sullivan why he had Queenan followed.","Using Queenan's phone, Sullivan reaches Costigan, who refuses to abort his mission. Sullivan learns from Queenan's diary of Costello's role as an informant for the FBI, causing him to worry about his own identity being revealed. With Costigan's help, Costello is traced to a cocaine drop-off, where a gunfight erupts between Costello's crew and the police. Most of the crew are killed. Costello, confronted by Sullivan, admits he is an FBI informant. Costello tries to shoot Sullivan, but Sullivan shoots him multiple times. With Costello dead, Sullivan is applauded the next day by everyone on the force. In good faith, Costigan comes to Sullivan for restoration of his true identity and to be paid for his work, but notices the envelope from Costello on Sullivan's desk and flees, finally realizing Sullivan is the enemy. Fearing retaliation, Sullivan erases Costigan's records from the police computer system.","Sullivan is unaware that Madolyn had an affair with Costigan when she tells Sullivan that she is pregnant. Later, Sullivan finds her listening to a CD from Costigan containing incriminating recorded conversations between Costello and Sullivan. Sullivan unsuccessfully attempts to assuage her suspicions. He contacts Costigan, who reveals that Costello had recorded each of their conversations, and his attorney arranged for Costigan to take possession of the recordings, and Costigan intends to implicate Sullivan. The two agree to meet at the building where Queenan died.","On the roof, Costigan catches Sullivan off-guard and handcuffs him. As Costigan had secretly arranged, Trooper Brown appears on the roof as well. Shocked, Brown draws his gun on Costigan, who attempts to justify his actions by exposing Sullivan as Costello's mole. Costigan asks Brown why Dignam did not accompany him as Costigan had requested, but Brown does not answer. Costigan leads Sullivan, his hostage, to the elevator. When it reaches the ground floor, Trooper Barrigan shoots Costigan in the head, then shoots Brown, and afterward reveals to Sullivan that Costello had more than one mole in the police. Sullivan shoots and kills Barrigan. At state police headquarters, Sullivan identifies Barrigan as the mole and has Costigan posthumously given the Medal of Merit.","At Costigan's funeral, Sullivan notices that Madolyn is tearful. As they leave the gravesite, Sullivan attempts to talk to her, but she ignores him. When Sullivan returns to his apartment, he is ambushed by Dignam, who shoots and kills him as he enters."],
              "time": 151,
              "casting": ["Leonardo DiCaprio","Matt Damon","Jack Nicholson","Mark Wahlberg","Martin Sheen"],
              "budget": 90,
              "boxoffice": 291.5
          },
          {
              "id": 2,
              "link": "thelionking",
              "movie": "The Lion King",
              "poster": "/static/posters/0000000002.jpg",
              "director": "Roger Allers",
              "producer": "Don Hahn",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 1994,
              "plot": ["In the Pride Lands of Africa, a pride of lions rule over the animal kingdom from Pride Rock. King Mufasa's newborn son, Simba, is presented to the assembled animals by Rafiki the baboon (with the colorful facial marking of a mandrill) who serves as shaman and advisor. Mufasa shows young Simba the Pride Lands and explains to him the responsibilities of kingship and the 'circle of life' which connects all living things. Mufasa's younger brother, Scar, covets the throne and plots to eliminate Mufasa and Simba so he may become king. He tricks Simba and his best friend Nala—to whom Simba is betrothed—into exploring a forbidden elephants' graveyard, where they are attacked by three spotted hyenas who are in league with Scar. Mufasa is alerted to the danger by his majordomo, the hornbill Zazu, and rescues the cubs. Though angry with Simba, Mufasa forgives him and explains that the great kings of the past watch over them from the night sky, from which he will one day watch over Simba.","Scar sets a trap for his brother and nephew, luring Simba into a gorge and having the hyenas drive a large herd of wildebeest into a stampede that will trample him. He informs Mufasa of Simba's peril, knowing the king will rush to save his son. Mufasa saves Simba but ends up hanging perilously from the gorge's edge. Scar refuses to help Mufasa, instead sending him falling to his death. He then convinces Simba that the tragedy was Simba's own fault and advises him to flee the kingdom. He orders the hyenas to kill the cub, but Simba escapes. Scar tells the pride that both Mufasa and Simba were killed in the stampede and steps forward as the new king, allowing his three hyena minions and the rest of their large pack to live in the Pride Lands.","Simba collapses in a desert and is rescued by Timon and Pumbaa, a meerkat and warthog who are fellow outcasts. Simba grows up in the jungle with his two new friends, living a carefree life under the motto 'hakuna matata' ('no worries' in Swahili). Now a young adult, Simba rescues Timon and Pumbaa from a hungry lioness who turns out to be Nala. She and Simba reunite and fall in love, and she urges him to return home, telling him the Pride Lands have become a drought-stricken wasteland under Scar's reign. Feeling guilty over his father's death, Simba refuses and storms off. He encounters Rafiki, who tells him that Mufasa's spirit lives on in Simba. Simba is visited by the ghost of Mufasa in the night sky, who tells him he must take his rightful place as king. Realizing he can no longer run from his past, Simba decides to return home.","Aided by his friends, Simba sneaks past the hyenas at Pride Rock and confronts Scar, who taunts him over his role in Mufasa's death and backs him to the edge of the rock, where he reveals to Simba that he murdered Mufasa. Enraged, Simba pins Scar to the ground and forces him to reveal the truth to the rest of the pride. Timon, Pumbaa, Rafiki, Zazu, and the lionesses fend off the hyenas while Scar, attempting to escape, is cornered by Simba at the top of Pride Rock. Scar begs for mercy and attempts to blame the hyenas for his actions; Simba spares his life, but orders him to leave the Pride Lands forever. Scar attacks his nephew, but Simba manages to toss him from the top of the rock. Scar survives the fall, but is attacked and killed by the hyenas, who overheard his attempt to betray them. With his enemies gone, Simba takes over the kingship as the rains begin to fall, restoring life to the land."],
              "time": 88,
              "casting": ["Matthew Broderick","James Earl Jones","Jeremy Irons","Rowan Atkinson","Moira Kelly"],
              "budget": 16,
              "boxoffice": 46.1
          },
          {
              "id": 52,
              "link": "thelordoftheringthefellowshipofthering",
              "movie": "The Lord of the Rings: The Fellowship of the Ring",
              "poster": "/static/posters/0000000052.jpg",
              "director": "Peter Jackson",
              "producer": "Barrie M. Osborne",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 2001,
              "plot": ["In the Second Age of Middle-earth, the lords of Elves, Dwarves, and Men are given Rings of Power. Unbeknownst to them, the Dark Lord Sauron forges the One Ring in Mount Doom, infusing into it a great part of his power to dominate, through it and at a distance, the other Rings, so he might conquer Middle-earth. A final alliance of men and elves battles Sauron's forces in Mordor, where Prince Isildur of Gondor severs Sauron's finger, and the Ring with it, thereby destroying his physical form. With Sauron's first defeat, the Third Age of Middle-earth begins. Unfortunately, the Ring's influence corrupts Isildur, and, rather than destroy the Ring, Isildur takes it for himself. Isildur is later killed by Orcs, and the Ring is lost for 2,500 years, until it is found by Gollum, who owns it for five centuries. The Ring is then found by a hobbit named Bilbo Baggins.","Sixty years later, Bilbo celebrates his 111th birthday in the Shire, reuniting with his old friend, Gandalf the Grey. Bilbo reveals that he intends to leave the Shire for one last adventure, and he leaves his inheritance, including the Ring, to his nephew, Frodo. Although Bilbo has begun to become corrupted by the Ring and tries to keep it for himself, Gandalf intervenes. Gandalf, suspicious of the Ring, tells Frodo to keep it secret and to keep it safe. Gandalf then investigates the Ring, discovers its true identity, and returns to warn Frodo. Gandalf also learns that Gollum was tortured by Orcs, and that Gollum uttered two words during his torture: \"Shire\" and \"Baggins.\" Gandalf instructs Frodo to leave the Shire, accompanied by his gardener Samwise Gamgee. Gandalf rides to Isengard to meet with fellow wizard Saruman the White, but learns that he has joined forces with Sauron, who has unleashed the Ringwraiths to find Frodo. After a brief battle, Saruman imprisons Gandalf. Frodo and Sam are joined by fellow hobbits Merry and Pippin, and they evade the Ringwraiths, arriving in Bree, where they are meant to meet Gandalf. However, Gandalf never arrives, and they are instead aided by a ranger named Strider, a friend of Gandalf's, who escorts them to Rivendell.","The hobbits are ambushed by the Ringwraiths, and one stabs Frodo with a cursed Morgul blade. Arwen, an elf and Strider's lover, comes to Frodo's aid and successfully takes him to Rivendell, where he is healed. Frodo meets Gandalf, who escaped Isengard on the back of a giant Eagle. Arwen’s father, Lord Elrond, holds a council that decides the Ring must be destroyed in Mount Doom. While the members argue, Frodo volunteers to take the Ring, accompanied by Gandalf, Sam, Merry, Pippin, elf Legolas, dwarf Gimli, Boromir of Gondor, and Strider, who is revealed to be Aragorn, Isildur's heir and the rightful King of Gondor. Bilbo gives Frodo his sword, Sting. The Fellowship of the Ring sets off, but Saruman's magic forces them to travel through the Mines of Moria, much to Gandalf's displeasure.","The Fellowship discovers that the dwarves within Moria have been slain, and they are attacked by Orcs and a cave troll. They defeat them, but are confronted by an ancient demon called a Balrog. Gandalf casts the Balrog into a vast chasm, but it drags Gandalf down into the darkness with it. The rest of the Fellowship, now commanded by Aragorn, reaches Lothlórien, home to elves Galadriel and Celeborn. Galadriel privately informs Frodo that only he can complete the quest, and that one of his friends will try to take the Ring. Meanwhile, Saruman creates an army of Uruk-hai to track down and kill the Fellowship.","The Fellowship leaves Lothlórien by river to Parth Galen. Frodo wanders off and is confronted by Boromir, who tries to take the Ring in desperation. Afraid of the Ring corrupting his friends, Frodo decides to travel to Mordor alone. The Fellowship is then ambushed by the Uruk-hai. Merry and Pippin are taken captive, and Boromir is mortally wounded by the Uruk chieftain. After slaying the chieftain, Aragorn watches Boromir die peacefully. Sam follows Frodo, accompanying him to keep his promise to Gandalf to protect Frodo, while Aragorn, Legolas, and Gimli go to rescue Merry and Pippin."],
              "time": 200,
              "casting": ["Elijah Wood","Ian McKellen","Viggo Mortensen","Liv Tyler","Sean Astin"],
              "budget": 93,
              "boxoffice": 871.5
          },
          {
              "id": 51,
              "link": "thelordoftheringthereturnoftheking",
              "movie": "The Lord of the Rings: The Return of the King",
              "poster": "/static/posters/0000000051.jpg",
              "director": "Peter Jackson",
              "producer": "Barrie M. Osborne",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 2003,
              "plot": ["Two Hobbits, Sméagol and Déagol, are fishing when Déagol discovers the One Ring in the river. Sméagol is ensnared by the Ring, and kills his friend for it. He retreats into the Misty Mountains as the Ring twists his body and mind, until he becomes the creature Gollum.","Centuries later, Gandalf leads Aragorn, Legolas, Gimli, and King Théoden to Isengard, where they reunite with Merry and Pippin. Gandalf retrieves the defeated Saruman's palantír. Pippin later looks into the seeing-stone, and is telepathically attacked by Sauron. Gandalf deduces that Sauron will attack Gondor's capital Minas Tirith. He rides there to warn Gondor's steward Denethor, taking Pippin with him.","Gollum leads Frodo Baggins and Samwise Gamgee to Minas Morgul. The hobbits begin climbing a stair carved in the cliff face that will take them into Mordor via a 'secret way' - unaware that Gollum plans to kill them and take the Ring. Sauron's army strikes and overwhelms Osgiliath, forcing Faramir and his garrison to retreat to Minas Tirith.","Gollum disposes of the Hobbits' food, blaming Sam. Frodo tells Sam to go home, before Frodo and Gollum continue to the tunnel leading to Mordor, where Gollum tricks him into venturing into the lair of the giant spider Shelob. Frodo narrowly escapes and confronts Gollum, telling him that he must destroy the Ring for both their sakes. Gollum attacks Frodo, but falls down a chasm. Frodo continues on, but Shelob discovers, paralyses and binds him. However, Sam arrives and drives her away. Sam hides as Orcs appear and take Frodo with them. Sam follows the Orcs into the Tower of Cirith Ungol, and frees Frodo so they can continue their journey.","Aragorn learns from Elrond that Arwen is dying, having refused to leave Middle Earth after seeing a vision of her son with Aragorn. Elrond gives Aragorn Andúril, Isildur's sword Narsil reforged, so he can reclaim his birthright while gaining reinforcements from the Dead Men of Dunharrow. Joined by Legolas and Gimli, Aragorn travels to the Paths of the Dead, recruiting the Army of the Dead by pledging to release them from the curse Isildur put on them. Faramir is gravely wounded after a futile effort to retake Osgiliath; believing his son to be dead, Denethor falls into madness. Gandalf is left to defend the city against the Orc army, led by Gothmog. As Gothmog's army forces its way into the city, Denethor attempts to kill himself and Faramir on a pyre. Pippin alerts Gandalf and they save Faramir, but Denethor leaps to his death from the top of Minas Tirith just before Théoden and his nephew, Éomer, arrive with the Rohirrim. During the ensuing battle, they are overwhelmed by the Oliphaunt-riding Haradrim, while the Witch-king of Angmar mortally wounds Théoden. Though Théoden's niece Éowyn destroys the Witch-King with Merry's help, Théoden dies of his wounds. Aragorn arrives with the Army of the Dead, who overcome the Orcs and win the battle; Aragorn then frees them from the curse. Aragorn decides to lead his army upon the Black Gate as a distraction, so Frodo and Sam can get to Mount Doom.","Aragorn's army draw out Sauron's forces and empties Mordor, allowing Frodo and Sam to reach the volcano, but Gollum attacks them just as they reach Mount Doom. Frodo succumbs to the Ring and claims it as his own. Gollum attacks Frodo and bites his finger off to reclaim the Ring. Frodo fights back and knocks Gollum, who is holding the Ring, into the volcano, destroying the Ring and killing Gollum. As Frodo and Sam escape, Sauron is destroyed and Mordor crumbles. Gandalf flies in with eagles to rescue the Hobbits, who awaken later in Minas Tirith and are reunited with the surviving Fellowship members. Aragorn is crowned King of Gondor and takes Arwen as his queen. The Hobbits return to the Shire, where Sam marries Rosie Cotton. A few years later, Frodo departs Middle Earth for the Undying Lands with his uncle Bilbo, Gandalf, and the Elves. He leaves Sam the Red Book of Westmarch, which details their adventures. Sam then returns to the Shire, where he embraces Rosie and their children."],
              "time": 200,
              "casting": ["Matthew Broderick","James Earl Jones","Jeremy Irons","Rowan Atkinson","Moira Kelly"],
              "budget": 94,
              "boxoffice": 1120
          },
          {
              "id": 30,
              "link": "thematrix",
              "movie": "The Matrix",
              "poster": "/static/posters/0000000030.jpg",
              "director": "The Wachowski Brothers",
              "producer": "Joel Silver",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 1994,
              "plot": ["A woman is cornered by police in an abandoned hotel; after overpowering them with superhuman abilities, a group of sinister superhuman grey green-suited Agents leads the police in a rooftop pursuit. She answers a ringing public telephone and vanishes.","Computer programmer Thomas Anderson, living a double life as the hacker \"Neo\", feels something is wrong with the world and is puzzled by repeated online encounters with the cryptic phrase \"the Matrix\". The woman, Trinity, contacts him, saying that a man named Morpheus can explain its meaning; however, the Agents, led by Agent Smith, apprehend Neo and attempt to threaten him into helping them capture the \"terrorist\" Morpheus. Undeterred, Neo meets Morpheus, who offers him a choice between a red pill that will show him the truth about the Matrix, and a blue pill that will return him to his former life. After swallowing the red pill, his reality disintegrates and Neo awakens, naked, weak and hairless, in a liquid-filled pod, among countless others connected by cables to an elaborate electrical system. He is rescued and brought aboard Morpheus' hovercraft, the Nebuchadnezzar.","As Neo recuperates, Morpheus explains the truth: in the 21st century, intelligent machines waged war against their human creators. When humans blocked the machines' access to solar energy, the machines retaliated by harvesting the humans' bioelectric power. The Matrix is a shared simulation of the world, in which the minds of the harvested humans are trapped and pacified. All free humans live in Zion, the last refuge in the real world. Morpheus and his crew are a group of rebels who hack into the Matrix to \"unplug\" enslaved humans and recruit them. Their understanding of the simulated reality enables them to bend its physical laws, granting them superhuman abilities. Morpheus warns Neo that death within the Matrix also kills the physical body, and that the Agents are powerful sentient programs that eliminate threats to the system. Neo's prowess during virtual combat training lends credence to Morpheus' belief that Neo is \"the One\", an especially powerful human prophesied to free humans and end the war.","The group enters the Matrix to visit the Oracle, an all-knowing prophet who predicted the emergence of the One. She implies that Neo is not the One and warns Neo that he will have to choose between Morpheus' life and his own. Before they can leave the Matrix, the group is ambushed by Agents and tactical police alerted by Cypher, a disgruntled crew member who betrayed Morpheus to Smith in exchange for a comfortable life back in the Matrix. Morpheus allows himself to be captured so Neo and the rest of the crew can escape. Cypher exits the Matrix and murders several crew members as they lie defenseless in the real world. As he prepares to disconnect Neo and Trinity, Tank, a crewman whom he had left for dead, kills him.","In the Matrix, the Agents interrogate Morpheus to learn his access codes to the mainframe computer in Zion. Tank proposes killing Morpheus to prevent this, but Neo, believing that he is not the One, decides himself worth sacrificing if need be to rescue Morpheus; Trinity insists she accompany him. While rescuing Morpheus, Neo gains confidence in his abilities, performing feats comparable to the Agents'. Morpheus and Trinity exit the Matrix, but Smith ambushes and kills Neo before he can leave. In the real world, machines called Sentinels attack the Nebuchadnezzar. Trinity whispers to Neo that he can't be dead because she loves him and the Oracle told her that she would fall in love with the One. She kisses Neo and he revives with the power to perceive and control the Matrix. He effortlessly defeats Smith and leaves the Matrix just as the ship's electromagnetic pulse weapon disables the attacking Sentinels."],
              "time": 136,
              "casting": ["Keanu Reeves","Laurence Fishburne","Carrie-Anne Moss","Hugo Weaving","Joe Pantoliano"],
              "budget": 63,
              "boxoffice": 463.5
          },
          {
              "id": 29,
              "link": "thepianist",
              "movie": "The Pianist",
              "poster": "/static/posters/0000000029.jpg",
              "director": "Roman Polanski",
              "producer": "Roman Polanski",
              "genre": "Historical",
              "genreLink":"historical",
              "year": 2002,
              "plot": ["In September 1939, Władysław Szpilman, a Polish-Jewish pianist, is playing live on the radio in Warsaw when the station is bombed during Nazi Germany's invasion of Poland. Hoping for a quick victory, Szpilman rejoices with his family at home when learning that Britain and France have declared war on Germany. But the promised aid does not come. Fighting lasts for just over a month, with both the German and Soviet armies invading Poland at the same time on different fronts. Warsaw becomes part of the Nazi-controlled General Government. Jews are soon prevented from working or owning businesses, and are also made to wear blue Star of David armbands.","By November 1940, Szpilman and his family are forced from their home into the overcrowded Warsaw Ghetto, where conditions only get worse. People starve, the guards are brutal, and starving children are abandoned in the streets. On one occasion, the Szpilmans witness the SS kill an entire family in an apartment across the street during a round-up.","On 16 August 1942, Szpilman and his family are transported to Treblinka extermination camp as part of Operation Reinhard. But a friend in the Jewish Ghetto Police recognizes Władysław at the Umschlagplatz, and separates him from his family. He becomes a slave labourer, and learns of a coming Jewish revolt. He helps the resistance by smuggling weapons into the ghetto, on one occasion narrowly avoiding a suspicious guard. Szpilman eventually manages to escape, and goes into hiding with help from a non-Jewish friend, Andrzej Bogucki, and his wife, Janina.","In April 1943, Szpilman watches from his window as the Warsaw Ghetto Uprising, which he aided, unfolds, and then ultimately fails. After a neighbor discovers Szpilman in the flat, he is forced to flee to a second hiding place. The new room has a piano in it, but he is compelled to keep quiet, while beginning to suffer from jaundice.","In August 1944, during the Warsaw Uprising, the Armia Krajowa attacks a German building across the street from Szpilman's hideout. Tank shells hit the apartment, forcing him to flee. Over the course of the following months, Warsaw is destroyed. Szpilman is left alone to search desperately for shelter and supplies among the ruins. He eventually makes his way to a house where he finds a can of pickled cucumbers. While trying to open it, he is discovered by Wehrmacht officer Wilm Hosenfeld who learns that Szpilman is a pianist. He asks Szpilman to play on a grand piano in the house. The decrepit Szpilman manages to play Chopin's \"Ballade in G minor\". Hosenfeld lets Szpilman hide in the attic of the empty house. From here, he is regularly supplied with food by the German officer."],
              "time": 150,
              "casting": ["Adrien Brody","Thomas Kretschmann","Frank Finlay","Maureen Lipman","Emilia Fox"],
              "budget": 35,
              "boxoffice": 120.1
          },
          {
              "id": 24,
              "link": "thering",
              "movie": "The Ring",
              "poster": "/static/posters/0000000024.jpg",
              "director": "Gore Verbinski",
              "producer": "Walter F. Parkes",
              "genre": "Horror",
              "genreLink":"horror",
              "year": 2002,
              "plot": ["Teenagers Katie and Becca discuss a legend about a cursed videotape; whoever watches it dies seven days later. Katie confesses that she watched the tape with her friends the previous week. That night, Katie is killed by an unseen force.","At Katie's funeral, Ruth, Katie's mother, urges her sister Rachel, a Seattle journalist, to investigate her daughter's death as she recalls the night she discovered Katie's disfigured body in the closet, with doctors being unable to explain the cause of death. Rachel discovers that Katie's friends were killed in bizarre accidents on the night of her death. She also learns that Becca has been institutionalized after witnessing Katie's death. Rachel goes to Shelter Mountain Inn, the mountain retreat where Katie and her friends watched the supposed cursed tape. While probing the inn's manager for details concerning Katie and her friends' stay, she notices an unmarked videotape on a nearby shelf advertising rental videos for guests; while the manager's back is turned, she slips the tape into her purse. She rents the same cabin that Katie stayed in and reluctantly watches the tape; it contains gruesome and disturbing imagery, culminating in the static image of a lone well in an empty field. After the tape ends, she receives a phone call from an unknown caller who whispers 'seven days'.","Rachel recruits the help of her ex-boyfriend Noah, a skeptical video analyst. He watches the tape and Rachel makes him a copy so they can both investigate where it came from. Rachel experiences supernatural symptoms of the curse, including irregular nosebleeds and having cords stuck in her throat, which she is forced to vomit out. She discovers hidden imagery of a lighthouse and identifies a woman on the tape: a horse breeder, Anna Morgan, who committed suicide after some of her horses drowned themselves off Moesko Island. Rachel finds their son, Aidan, watching the videotape.","Leaving Aidan in Ruth's care, Rachel heads for Moesko Island to speak to Anna's widower, Richard, while Noah travels to Eola Psychiatric Hospital to view Anna's medical files. On the ferry to the island, a horse is affected by Rachel's cursed presence and leaps to its death. On the island, she discovers Anna had an adopted daughter, Samara, but Richard denies it. Rachel speaks to the island doctor, who explains that Anna adopted Samara due to her infertility. Samara possessed the ability to psychically etch images onto objects and into minds, tormenting her parents and their horses. Noah finds a psychiatric file on Samara which mentions a missing video record last seen by Richard.","Rachel sneaks into the Morgan house and watches the missing video, which shows Samara explaining her powers during a psychotherapy session. Richard discovers her and strikes her. Horrified that Samara's evil is still at large, he electrocutes himself in the bathtub. Noah arrives and he and Rachel enter the barn. In a loft converted to a bedroom to isolate Samara from her mother, they find an image of a tree behind the wallpaper; Rachel recognizes it as a tree at the Shelter Mountain Inn."],
              "time": 115,
              "casting": ["Naomi Watts","Martin Henderson","David Dorfman","Brian Cox"],
              "budget": 48,
              "boxoffice": 249.3
          },
          {
              "id": 45,
              "link": "thetalentedmrripley",
              "movie": "The Talented Mr. Ripley",
              "poster": "/static/posters/0000000045.jpg",
              "director": "Anthony Minghella",
              "producer": "William Horberg",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 1999,
              "plot": ["Tom Ripley is a young man struggling to make a living in 1950s New York City with his \"talents\": telling lies, forging signatures and impersonating people. While working at a party, he is approached by the wealthy shipbuilder Herbert Greenleaf, who mistakenly believes that Ripley attended Princeton with his son, Dickie. Greenleaf recruits Ripley, for $1,000, to travel to Italy to persuade Dickie to return home. During the trip to Italy, Ripley strikes up a friendship with an American socialite, Meredith Logue, while pretending to be Dickie.","In the Italian seaside town of Mongibello, Ripley charms himself into the lives of Dickie and his fiancée, Marge, partly through pretending to be a fellow jazz lover. Ripley becomes infatuated with Dickie's life; he also becomes obsessed with Dickie himself. Eventually, however, Dickie tires of him and starts spending more time with his Princeton friend Freddie Miles, a womanizer who treats Ripley with contempt.","When Dickie impregnates a local woman, he rejects her and she drowns herself. Only Ripley knows what happened, and promises to keep it a secret. Meanwhile, Dickie catches Ripley dressed in Dickie's clothes and pretending to be him in front of a mirror, which further alienates him from Ripley.","When Dickie's father cuts off Ripley's travel funds, Dickie cancels a planned trip to Venice and tells Ripley they should part ways, but offers to take him on a short, final trip to San Remo. They take a boat out, but when Ripley suggests they move in together, Dickie becomes angry, accusing Ripley of mooching. The two fight, and Ripley beats Dickie to death with an oar. Ripley scuttles the boat in a nearby cove.","Realizing that people easily mistake him for Dickie, Ripley decides to impersonate him. He forges a letter to Marge, convincing her that Dickie has left her to live in Rome. He creates the illusion that Dickie is still alive by checking into one Roman hotel as Dickie and another as himself, creating an exchange of communications between the two. Through forgery, he is able to draw on Dickie's allowance, which allows him to live lavishly. He runs into Meredith, and pretends to romance her to gain access to her wealthy circle of friends. His ruse is threatened when Marge arrives in Rome, so he breaks it off with Meredith to prevent being discovered.","Freddie shows up at Ripley's apartment looking for Dickie, and is immediately suspicious. When the landlady addresses Tom with \"Ciao Dickie\", Freddie realizes the fraud, but Ripley beats him to death with a stone bust. After disposing of the body, Ripley is forced into a cat-and-mouse existence between the Italian police and Marge. Realizing that the police suspect Dickie of murdering Freddie, Ripley forges a suicide note to dispose of the Dickie persona once and for all. He then travels to Venice, where he meets Marge's friend, Peter Smith-Kingsley, and they develop feelings for each other."],
              "time": 115,
              "casting": ["Matt Damon","Gwyneth Paltrow","Cate Blanchett"],
              "budget": 40,
              "boxoffice": 128.8
          },
          {
              "id": 46,
              "link": "thetrumanshow",
              "movie": "The Truman Show",
              "poster": "/static/posters/0000000046.jpg",
              "director": "Peter Weir",
              "producer": "Scott Rudin",
              "genre": "Science Fiction",
              "genreLink":"sciencefiction",
              "year": 1998,
              "plot": ["Truman Burbank is the unsuspecting star of The Truman Show, a reality television program which is broadcast live around the clock and across the globe. His entire life has taken place within a giant arcological dome in Hollywood, fashioned to create the seaside town of Seahaven Island, and equipped with thousands of cameras to monitor all aspects of his life. The producers discouraged Truman from wanting to leave Seahaven by instilling him with aquaphobia through the \"death\" of his TV father in a boating \"accident\", and by constantly broadcasting and printing messages of the dangers of traveling. All of Seahaven's residents are actors, either acting out a script or repeating lines fed to them by the show's creator and executive producer, Christof. Christof seeks to capture Truman's real emotion and human behavior and give audiences a relatable everyman.","Despite Christof's control, Truman manages to act in unexpected ways. During his college years, Truman was intended to fall in love with and marry co-student Meryl, but he fell in love with another actress, Sylvia. Sylvia managed to bring Truman out of the sight of cameras long enough to warn him that his reality is fake before she was taken away, with her \"father\" claiming they are traveling to Fiji. While Truman went on to marry Meryl, he continues to fantasize about Sylvia, using scraps from magazines to recreate her face in secret, and seeks travel to Fiji. Outside of the show, Sylvia has become part of a \"Free Truman\" campaign that demands the end of the show.","The film begins during the thirtieth year of the show. Truman starts noticing unusual events that seem centered on him: a falling spotlight, rain that only falls on him, and a radio channel that precisely describes his movements. Truman spots a disheveled man and recognizes him as his father, who had snuck back into the set, but other actors quickly drag the man away. Despite efforts by Meryl and Truman's best friend Marlon to reassure him, Truman becomes even more suspicious about his life. One day, he takes Meryl by surprise by going on an impromptu road trip, but their way is blocked by increasingly implausible emergencies. Meryl begins to break down from the stress; during an argument with Truman, she breaks character and is taken off the show. Hoping to bring Truman back to a controllable state, Christof re-introduces Truman's father to the show properly, under the guise of having lost his memory after the boating accident. This helps the show regain the ratings lead with audiences.","Truman seems to return to his routines, except that after Meryl moves out he begins sleeping in his basement. One evening the production staff discovers that the sleeping Truman is completely out of their sight. Marlon is sent to check on Truman, finding that he has left a dummy and a tape recorder in his place and disappeared through a makeshift tunnel. Marlon breaks character, and Christof orders the first transmission cut in the show's history while a citywide search for Truman is launched. Audiences around the world are drawn to this sudden change. Truman is found sailing out of Seahaven, having conquered his fear of water, and Christof resumes the broadcast as he sends a man-made lightning storm to try to capsize the boat. Network executives fear that Truman may die on live television, but Truman manages to persist. Realizing he cannot dissuade Truman any further, Christof ends the storm."],
              "time": 103,
              "casting": ["Jim Carrey","Laura Linney","Noah Emmerich"],
              "budget": 60,
              "boxoffice": 264.1
          },
          {
              "id": 5,
              "link": "theusualsuspect",
              "movie": "The Usual Suspect",
              "poster": "/static/posters/0000000005.jpg",
              "director": "Bryan Singer",
              "producer": "Kenneth Kokin",
              "genre": "Crime",
              "genreLink":"crime",
              "year": 1995,
              "plot": ["A criminal, Dean Keaton, is lying badly wounded on a ship docked in San Pedro Bay. He is confronted by a mysterious figure whom he calls 'Keyser', who shoots him dead and sets fire to the ship.","The bloodbath on the ship leaves twenty-seven dead and only two survivors: Arkosh Kovash, a Hungarian mobster hospitalized with severe burns; and Roger 'Verbal' Kint, a con artist with cerebral palsy. Customs agent Dave Kujan flies from New York City to interrogate Verbal. In flashback the events that led Keaton, Michael McManus, Fred Fenster, Todd Hockney and Verbal onto the ship are described.","In the flashback, set six weeks earlier in New York, Verbal and the other four criminals are arrested on a trumped up truck hijacking charge, and decide to pull a real heist that will get back at the police. Led by Keaton, a former corrupt policeman, they rob a jewel smuggler being escorted by corrupt cops, netting millions in emeralds and getting fifty cops arrested. They then go to California to fence the jewels with a criminal named Redfoot, who turns them on to another jewel heist. The heist turns out to be heroin, and the five end up in a deadly (for their three targets) shootout. They learn the heist was actually arranged by a British lawyer named Kobayashi. They meet Kobayashi, who tells them that Keyser Soze, a Turkish crime lord with a legendary reputation from whom all of the thieves have unwittingly stolen, has offered them a job: invade a ship manned by a gang of Argentinian drug dealers with whom Soze is competing and destroy $91 million worth of cocaine onboard.","FBI agent Jack Baer informs Kujan that there was never any cocaine on the ship, and fills him in on Soze's involvement. When Kujan questions him, Verbal tells Kujan a story about Soze: that he had murdered his own family when they were being held hostage by members of a gang of Hungarian criminals, establishing his ruthlessness. He later kills many of the Hungarians, then massacres their families, friends and even people who owed them money. He then went underground, never to be seen again, and did business only through underlings who did not know for whom they were working. He became a fearsome urban legend, 'a spook story that criminals tell their kids at night'.","After Fenster runs out on the group, Kobayashi gives them a location at which they find Fenster’s corpse. They try to kill Kobayashi, but he strong-arms them into attacking the ship by threatening their loved ones. They stake out the ship and kill several Argentinian and Hungarian gangsters, then discover there is no cocaine. McManus, Hockney and a man locked aboard the ship are killed by an unseen person, who also kills Keaton and sets the ship on fire as Verbal looks on from a hiding place on the dock.","Verbal concludes his story, but Kujan does not believe it. He insists that Keaton must be Soze, as the murder victim locked on the boat was Arturo Marquez, a drug dealer who escaped prosecution by claiming he could identify Soze  and who was represented by Edie Finneran, Keaton's lawyer and girlfriend. Kujan claims that the Argentinians were selling Marquez to Soze's Hungarian rivals and Keaton used the heist as a distraction to allow him to kill Marquez. Kujan also informs Verbal that Finneran has been murdered. Verbal says that the entire plan was Keaton's idea, but refuses to testify in court. Verbal's bond is posted and he is released.","Moments later, Kujan realizes that Verbal's entire story was a lie, pieced together from details on a crowded bulletin board in the office. Meanwhile, Verbal walks outside, gradually dropping his limp and flexing his supposedly withered hand. As Kujan runs after Verbal, a fax comes in from the hospital where Kovash is being treated for his burns: a police sketch artist's rendering of Soze, dictated by Kovash, that looks exactly like Verbal. Kujan misses Verbal by moments, as the latter disappears into a car driven by 'Kobayashi'."],
              "time": 106,
              "casting": ["Stephen Baldwin","Gabriel Byrnet","Benicio del Toro","Chazz Palminteri","Kevin Pollak"],
              "budget": 55,
              "boxoffice": 677.9
          },
          {
              "id": 38,
              "link": "therewillbeblood",
              "movie": "There Will Be Blood",
              "poster": "/static/posters/0000000038.jpg",
              "director": "Paul Thomas Anderson",
              "producer": "JoAnne Sellar",
              "genre": "Drama",
              "genreLink":"drama",
              "year": 2007,
              "plot": ["In 1898, Daniel Plainview, a prospector in New Mexico, mines a potentially precious ore vein from a pit mine hole. In the process of dynamiting the lode, he falls and breaks his leg. With the silver sample, he climbs out of the mine, drags himself to an assay office, and receives a silver and gold certificate claim. In 1902, he discovers oil near Los Angeles and establishes a drilling company. Following the death of a worker in an accident, Daniel adopts the man's orphaned son. He refers to the child, H. W., as his business partner, which allows him to present himself to potential investors as a family man.","In 1911, Daniel is approached by Paul Sunday, who tells him of an oil deposit under his family's property in Little Boston, California. Daniel attempts to buy the farm at a bargain price. However, Paul's twin brother, Eli, demands $10,000 for the church, of which he is pastor. An agreement is made for $5,000 after the well begins producing, and Daniel acquires all the available surrounding land, except for one holdout: William Bandy. Oil production begins, but an accident kills a worker and a gas blowout deafens H. W. Eli blames the disasters on the well not being properly blessed. When Eli demands the $5,000 that Daniel still owes, Daniel beats and humiliates him. At the dinner table, Eli berates his father for trusting Daniel.","A man arrives at Daniel's doorstep claiming to be his half-brother, Henry. Daniel hires Henry and the two grow close. H. W. sets fire to their house, intending to kill Henry. Angry, Daniel sends him away to a school for the deaf in San Francisco. A representative from Standard Oil offers to buy out Daniel's local interests, but Daniel strikes a deal with Union Oil and constructs a pipeline to the California coast, though the Bandy ranch remains an impediment.","While reminiscing about his childhood, Daniel becomes suspicious about Henry's story and one night quizzes him about it at gunpoint. \"Henry\" confesses that he was a friend of the real Henry's, who died from tuberculosis, and that he learned the details of Henry's life by reading his personal journal. In a fit of rage, Daniel murders the impostor and buries his body. The next morning, Daniel is awakened by Bandy, who knows of the previous night's events and wants Daniel to repent. At the church, as part of Daniel's baptism, Eli humiliates him, strikes him, and makes him confess to having abandoned his son, before announcing to the congregation that Daniel will be making a large donation to the church. With the pipeline underway, Daniel arranges for the still angry H. W. to return, while Eli leaves town for missionary work.","In 1927, H. W. marries Mary, Eli and Paul's sister. Daniel, now extremely wealthy but suffering from alcoholism, lives as a recluse in a large mansion. Through a sign language interpreter, H. W. asks Daniel to dissolve their partnership so that H. W. can establish his own oil company in Mexico. Daniel reacts brutally, mocks H. W.s deafness, and reveals H.W true origins as an orphan. H. W. thanks God he has \"none of Daniel in him\" and leaves.","Eli visits Daniel, who is drunk, in Daniel's private bowling alley. Eli, now a radio preacher, offers to sell Daniel drilling rights on the land of William Bandy, who has recently died. Daniel agrees on the condition that Eli denounce his faith and his own credibility. Eli reluctantly does so. Daniel reveals that the property is now worthless because he has already drained its oil by slant drilling from surrounding wells. Shaken, Eli confesses to being in dire financial straits and to having strayed morally. Daniel taunts him, chases him around the bowling alley, and beats him to death with a bowling pin."],
              "time": 158 ,
              "casting": ["Daniel Day-Lewis","Paul Dano","Kevin J. O'Connor","Ciarán Hinds","Dillon Freasier"],
              "budget": 25,
              "boxoffice": 76.2
          },
          {
              "id": 10,
              "link": "tomorrowneverdies",
              "movie": "Tomorrow Never Dies",
              "poster": "/static/posters/00000000010.jpg",
              "director": "Roger Spottiswoode",
              "producer": "Michael G. Wilson",
              "genre": "Adventure",
              "genreLink":"adventure",
              "year": 1997,
              "plot": ["MI6 sends James Bond, agent 007, into the field to spy on a terrorist arms bazaar on the Russian border. Despite M's insistence on letting 007 finish his reconnaissance, British Admiral Roebuck orders the frigate HMS Chester to fire a missile at the bazaar. Bond then discovers two nuclear torpedoes mounted on an L-39 Albatros, and is forced to pilot the L-39 away seconds before the bazaar is destroyed.","Media baron Elliot Carver begins his plans to use an encoder obtained at the bazaar by his henchman, cyberterrorist Henry Gupta, to provoke war between China and the UK. Meaconing the GPS signal using the encoder, Gupta sends the British frigate HMS Devonshire off-course into Chinese-held waters in the South China Sea, where Carver's stealth ship, commanded by Mr. Stamper, sinks it and steals one of its missiles, while shooting down a Chinese J-7 fighter jet and killing off the Devonshire's survivors with Chinese weaponry. The British Minister of Defence orders Roebuck to deploy the British fleet to recover the frigate, and possibly retaliate, leaving M only 48 hours to investigate its sinking and avert a war.","M sends Bond to investigate Carver after he releases news articles about the crisis hours before MI6 had learned of it. Bond travels to Hamburg and seduces Carver's wife, Paris, who is also Bond's ex-girlfriend, to get information that would help him enter Carver's newspaper headquarters. He defeats three of Stamper's men, cuts Carver off the air during the inaugural broadcast of his satellite network, and steals back the GPS encoder; Carver orders Paris and Bond killed. Carver's assassin Dr. Kaufman kills Paris, but Bond kills Kaufman and escapes, protecting the encoder.","At a U.S. Air Force base in Okinawa, Bond learns that the encoder had been tampered with, and goes to the South China Sea to investigate the wreck (which was actually in Vietnamese waters). He and Wai Lin, a Chinese agent on the same case, explore the sunken ship and discover one of its cruise missiles missing, but are captured by Stamper and taken to the CMGN tower in Saigon. They soon escape and decide to collaborate on the investigation. The two contact the Royal Navy and the People's Liberation Army Air Force to explain Carver's scheme; Carver plans to destroy the Chinese government with the stolen missile, allowing a Chinese general to step in and stop war between Britain and China, although not before both sides destroy each other at sea; once the war is over, Carver will be given exclusive broadcasting rights in China for the next century. Finding Carver's stealth ship in Ha Long Bay, they board it to prevent him from firing the missile at Beijing."],
              "time": 119,
              "casting": ["Pierce Brosnan","Jonathan Pryce","Michelle Yeoh","Teri Hatcher"],
              "budget": 90,
              "boxoffice": 589.4
          },
          {
              "id": 4,
              "link": "toystory",
              "movie": "Toy Story",
              "poster": "/static/posters/0000000004.jpg",
              "director": "John Lasseter",
              "producer": "Ralph Guggenheim",
              "genre": "Comedy",
              "genreLink":"comedy",
              "year": 1995,
              "plot": ["The movie depicts a world where toys are living things, pretending to be lifeless when humans are present. A group of toys, owned by six-year-old Andy Davis, are caught off-guard when Andy's birthday party is moved up a week, as his family (including Andy, his mother, and his infant sister Molly) is preparing to move the following week. A pull-string cowboy doll named Sheriff Woody - the toys' leader and Andy's favorite toy - organizes a scouting mission, with the help of Bo Peep the shepherdess, Mr. Potato Head, Rex the Dinosaur, Hamm the Piggy Bank, and Slinky Dog. Green Army Men, led by Sarge, spy on the party, and report the results to the others via baby monitors. The toys are relieved when the party appears to end with none of them being replaced by new toys, but then Andy receives a gift – a Buzz Lightyear action figure, who thinks he is a real space ranger.","Buzz impresses the other toys with his various features, and Andy begins to favor him, making Woody feel abandoned. As Andy prepares for a family outing at Pizza Planet, his mother allows him to bring one toy. Fearing Andy will choose Buzz, Woody attempts to trap Buzz behind a desk, but ends up accidentally knocking him out of a window. The other toys rebel against Woody, believing he did harm to Buzz out of jealousy. Before they can exact revenge, Andy takes Woody and leaves for Pizza Planet. When the family stops for gas, Woody finds that Buzz has hitched a ride on the car as well. They have a fight, only to find the family has left without them. They manage to make their way to the restaurant by stowing away on a pizza delivery truck. Buzz, still thinking he is a real space ranger, despite Woody's attempts to convince him otherwise, gets them stuck in a crane game, where they are salvaged by Andy's mischievous neighbor, Sid Phillips.","Woody attempts to escape from Sid's house, but Buzz, finally realizing he is a toy after watching a Buzz Lightyear TV ad, sinks into despondency. Sid plans to launch Buzz on a fireworks rocket, but his plans are delayed by a thunderstorm. Woody tells Buzz about the joy he can bring to Andy as a toy, restoring his confidence. The next day, Woody and Sid's mutant creature toys rescue Buzz just as Sid is about to launch the rocket and scare Sid into no longer abusing toys, and he runs into his house screaming in horror. Woody and Buzz then leave Sid's house on a skateboard just as Andy and his family drive away toward their new home.","The duo tries to make it to the moving truck, but Sid's dog, Scud, sees them and gives chase. Buzz gets left behind while saving Woody from Scud, and Woody tries rescuing him with Andy's radio-controlled car (RC). Thinking Woody tries to eliminate RC as well, the other toys attack and toss him off the truck. Having evaded Scud, Buzz and RC retrieve Woody and continue to chase the truck. Upon seeing Woody and Buzz together on RC, the other toys realize their mistake and try to help them get back aboard, but RC's batteries become depleted, stranding them. Woody ignites the rocket on Buzz's back and manages to throw RC into the truck before they soar into the air. Buzz opens his wings to free himself from the rocket before it explodes, gliding with Woody to land safely into a box in the car, right next to Andy.","On Christmas Day, at their new house, Woody and Buzz stage another reconnaissance mission to prepare for the new toy arrivals. One of the toys is Mrs. Potato Head, much to Mr. Potato Head's delight. As Woody jokingly asks what might be worse than Buzz, they discover Andy's new gift is a puppy, and the two share a worried smile."],
              "time": 81,
              "casting": ["Tom Hanks","Tim Allen","Don Rickles","Jim Varney","Wallace Shawn"],
              "budget": 81,
              "boxoffice": 373.6
          },
          {
              "id": 8,
              "link": "trainspotting",
              "movie": "Trainspotting",
              "poster": "/static/posters/0000000008.jpg",
              "director": "Danny Boyle",
              "producer": "Andrew Macdonald",
              "genre": "Comedy",
              "genreLink":"comedy",
              "year": 1996,
              "plot": ["Edinburgh heroin addict Mark Renton buys opium suppositories from dealer Mikey Forrester to help him quit. After his final hit, and a violent spell of diarrhea caused by cessation of heroin, he locks himself in his flat to endure the withdrawal period. Finding that his sex drive has returned, he leaves a club with a girl, Diane, and they have sex in her bedroom. In the morning, he realises that Diane is underage and that her 'flatmates' are her parents. Diane threatens to reveal the encounter if he ends the relationship.","Renton and his friends, oafish but good-natured Spud and con artist Sick Boy, start using heroin again. His friend Tommy, a clean-cut athlete whose girlfriend has dumped him after a chain of events initiated by Renton, also begins using. Fellow addict Allison discovers that her infant daughter Dawn has died without the group noticing; all are horrified, especially Sick Boy, Dawn's father.","Renton and Spud are arrested for shoplifting. Spud goes to prison, but Renton avoids punishment by entering a drug interventions programme, where he is given methadone. Despite support from his family, Renton is desperate for a more substantial high and escapes to his drug dealer's flat. He nearly dies of an overdose, and his dealer sends him to hospital in a taxicab. Renton's parents lock him in his childhood bedroom to force him through withdrawal. Renton has hallucinations of Diane singing, his friends giving him advice, Dawn crawling on the ceiling, and a TV game show in which presenter Dale Winton asks Renton's parents questions about HIV.","At the insistence of his parents, Renton has an HIV/AIDS test; despite years of sharing syringes, Renton tests negative. Depressed, he visits Tommy, who has succumbed to addiction and is now HIV positive and severely ill. Renton moves to London and takes a job as a property letting agent. He begins to enjoy his new life of sobriety, and saves money while corresponding with Diane. However, to his annoyance, Renton's sociopathic friend Begbie, who has committed armed robbery, and Sick Boy, now a pimp and drug dealer, move into Renton's bedsit unannounced.","After Tommy dies from AIDS-related toxoplasmosis, the three travel back to Scotland to attend his funeral. They meet Spud, who has been released from prison. Sick Boy suggests a lucrative heroin transaction, but needs Renton to supply half of the initial £4,000. Renton injects himself with a sample to test the heroin's purity and the four sell the heroin to a dealer in London for £16,000. During their celebration at a pub, Renton secretly suggests to Spud that they steal the money, but Spud is too scared of Begbie to consider it.","Renton tires of Begbie after witnessing him glass and beat a man whom he bumped into. Early in the morning, as the others sleep, Renton takes the money. Spud sees Renton leave, but remains silent. When Begbie awakens, he destroys the hotel room in a rage. Spud and Sick Boy leave when the police arrive. Renton reiterates his vow to live a stable, traditional life and leaves Spud £4,000."],
              "time": 93,
              "casting": ["Ewan McGregor","Ewen Bremner","Jonny Lee Miller","Kevin McKidd","Robert Carlyle"],
              "budget": 1.5,
              "boxoffice": 72
          },
          {
              "id": 22,
              "link": "xmen",
              "movie": "X-Men ",
              "poster": "/static/posters/0000000022.jpg",
              "director": "Bryan Singer",
              "producer": "Lauren Shuler Donner",
              "genre": "Action",
              "genreLink":"action",
              "year": 2000,
              "plot": ["In Nazi-occupied Poland, 12-year-old Erik Lehnsherr is separated from his parents upon entering an Auschwitz concentration camp. While trying to reach them, he causes a set of metal gates to bend towards him as the result of his newfound mutant ability to control metal. Soon after he is knocked out by the guards. In the not too distant future, U.S. Senator Robert Kelly attempts to pass a 'Mutant Registration Act' in Congress, which would force mutants to publicly reveal their identities and abilities. Present are Lehnsherr, now going by the name 'Magneto', and his telepathic colleague Professor Charles Xavier. Seeing Lehnsherr in attendance, Xavier becomes concerned with how he will respond to the Registration Act.","Meanwhile, in Meridian, Mississippi, 17-year-old Marie D'Ancanto accidentally puts her boyfriend into a coma after kissing him as the result of her mutant ability to absorb the powers and life force of others. She runs away from home and adopts the name Rogue. In Alberta, she meets Logan, also known as The Wolverine, who possesses superhuman healing abilities and metal 'claws' that protrude from between his knuckles, and can not remember his past. While on the road together, they are attacked by a minion of Magneto's, Sabretooth, until two of Xavier's students Cyclops and Storm arrive and save them. Wolverine and Rogue are brought to Xavier's mansion and school for mutants in Westchester County, New York. Xavier tells Logan that Magneto appears to have taken an interest in Wolverine and asks him to stay while Xavier's mutants, the X-Men, investigate the matter. Meanwhile, Rogue enrolls in the school.","Senator Kelly is abducted by two more of Magneto's minions, Toad and Mystique and is brought to their hideout on the uncharted island of Genosha. There, Magneto uses Kelly as a test subject for a machine powered by his magnetic abilities that generates a field of radiation, inducing mutation in normal humans. Kelly later escapes by taking advantage of his newfound mutation. When Rogue uses her power on Wolverine after he accidentally stabs her, she is convinced by Mystique, who disguises herself as Rogue's crush Bobby Drake, that Xavier is angry with her and she should leave the school. Xavier uses his mutant-locating machine Cerebro to find Rogue at a train station, and the X-Men go to retrieve her. Meanwhile, Mystique enters Cerebro and sabotages it.","Having left ahead of Storm and Cyclops, Wolverine finds Rogue on a train and convinces her to return to the school. Before they can leave, however, Magneto arrives and incapacitates Wolverine by controlling the metal bonded to his skeleton. Although Xavier attempts to stop Magneto by mentally controlling Sabretooth, he is forced to release his hold on Sabretooth when Magneto threatens the police who have converged on the train station, allowing Magneto's Brotherhood to escape with Rogue. Kelly arrives at Xavier's school, and Xavier reads his mind to learn about Magneto's machine. Realizing the strain of powering it nearly killed Magneto, the group deduces he intends to transfer his powers to Rogue and use her to power it at the cost of her life. Kelly's body rejects his mutation, and his body dissolves into liquid. Xavier attempts to locate Rogue using Cerebro, but Mystique's sabotage incapacitates him, and he falls into a coma. Fellow telekinetic and telepath Jean Grey fixes Cerebro and uses it, learning that Magneto plans to place his mutation-inducing machine on Liberty Island and use it to 'mutate' the world leaders meeting at a summit on nearby Ellis Island. Meanwhile, Wolverine is still tied up, but Storm rescues him. The X-Men scale the Statue of Liberty, battling the Brotherhood while Magneto transfers his powers to Rogue and activates the mutating machine. As Wolverine confronts and distracts Magneto, Cyclops blasts him away, allowing Wolverine to destroy the machine. He transfers his powers to Rogue and his healing abilities rejuvenate her, while incapacitating himself."],
              "time": 104,
              "casting": ["Patrick Stewart","Hugh Jackman","Ian McKellen","Halle Berry","Famke Janssen"],
              "budget": 75,
              "boxoffice": 296.3
          }
      ]
}
